{"title":"CaravanToMidnight-AudioArchive 2014-02-04.mp3","uid":9581940,"size":204269412,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:001f106e477005783a4c0bc6b3f53787b6686379&amp;dn=CaravanToMidnight-AudioArchive+2014-02-04.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pileoftruth","files":1,"time":1391780574,"description":"Here is the very first Caravan To Midnight Show hosted by John B. Wells on 02/04/14. Because he has revealed the truth about government corruption he was just taken off as host of the Saturday night Coast To Coast A.M. radio show even though he had as many, if not more people listening to him on Saturday night then listened to the Coast to Coast show all 5 days of the week added together. \n\nHe decided to start his own radio show after he was taken off the C2C show using his web sight CARAVANTOMIDNIGHT.COM\n\nFrom day one his web sight has been under attack. It took me almost 9 hours to download this 299meg file because of the attack his sight is undergoing from the control freaks. The recording contained 3 breaks that lasted almost 45 minutes total. I have edited out the dead spaces from this recording. Please note that all of the talk show is in this recording. \n\nWhen you hear the information in this show you will understand why they are freaked out over what John B. Wells is revealing. \n\nGo to CaravanToMidnight.com and sign up and support him as he helps everyone wake up to the truth of what is going on in the world. The truth that the control freaks do not want you to know.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:001f106e477005783a4c0bc6b3f53787b6686379","amp;dn":"CaravanToMidnight-AudioArchive+2014-02-04.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001f106e477005783a4c0bc6b3f53787b6686379","infoHashBuffer":{"type":"Buffer","data":[0,31,16,110,71,112,5,120,58,76,11,198,179,245,55,135,182,104,99,121]},"announce":[],"urlList":[]}}