{"title":"RPG Alphadia Genesis v1.1.0g Android","uid":9571074,"size":75915329,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:008bae9a3ce3de0fb6a0f67820380dc0bb45cb17&amp;dn=RPG+Alphadia+Genesis+v1.1.0g+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":-1,"time":1391635135,"description":"RPG Alphadia Genesis v1.1.0g\nRequeriments: Android 2.2+\nOverview: A brand new entry in the Alphadia series! Full-fledged fantasy RPG experience with stunning 3D battles!\n\n\n\n\nAlphadia Genesis boasts a rich multifaceted story that revolves around Fray, an Archleign's guild member and Corone, a knight in the Ghalzabine Army. As their journey progresses and conflicting national interests come to the forefront, it becomes apparent that it will take more than a little work on both their parts if their relationship is to weather the boding storm on the horizon. \n\nHaving been at peace for only 15 years since the end of the Energi War, the kingdoms of Archleign and Ghalzabine are once again thrust onto center stage after a murder perpetrated by a clone, whose rights and freedoms they both lobbied for, comes to light. \nHoping the treaty signed to end the use of clones for conventional warfare has not been violated, a joint-investigative team is put together to find out the cause and bring those responsible to justice. However, things then appear to be far more volatile than anyone could have first imagined... \n\n\nDramatic Event Scenes \nWith a voice cast of many notable Japanese actors and actresses lending their talents to the story, significant events take on more meaning as each has life breathed into them, allowing players to become more deeply immersed in the world. \n\n\nIntense 3D Battles \nShifting camera angles and voiced characters are just a few of the new features that make battles more engaging than ever before! And with beautifully rendered graphics and vibrant Energi and Break Skills, players will never tire of being bloated with such a visual feast! Furthermore, with the inclusion of a highly efficient auto-battle function, portable gaming has never been this convenient! \nNot to be forgotten, however, roaming the land are monsters so powerful that if come upon unprepared, players will face certain doom! \n\n\nEnergi \nIn the world of Lagoon, there are three elementals from which all Energi flows- fire, water, and light. Learning to harness these forces will allow the player to become more adept in skills related to them, which include attack, recovery, and support. Therefore, it would be wise to become acquainted with their use as early on in the game as possible. \n\n\nSubmembers \nCharacters outside the battle party can cooperate in various ways through the use of Assists. Depending on the combination of submembers, attack, defense and other parameters like the critical rate can be increased. Moreover, when the Assist Gauge has been maxed out, powerful combo attacks can be unleashed with their help. \n\nWhat's New\n\n*Please contact &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;8dece3e9ffe2e4e9cde6e8e0eee2a3e7fd&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; if you discover any bugs or problems with the application. Note that we do not respond to bug reports left in application reviews.\nver 1.1.0g\n- Added English version\n\n\nNOTE: I only removed the license verification but not the license verification error screen. The License verification will show as failed at first, just press QUIT and open the app again to play. You will have to do this every time you close the app. You can play the game without any problem after that.","torrent":{"xt":"urn:btih:008bae9a3ce3de0fb6a0f67820380dc0bb45cb17","amp;dn":"RPG+Alphadia+Genesis+v1.1.0g+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"008bae9a3ce3de0fb6a0f67820380dc0bb45cb17","infoHashBuffer":{"type":"Buffer","data":[0,139,174,154,60,227,222,15,182,160,246,120,32,56,13,192,187,69,203,23]},"announce":[],"urlList":[]}}