{"title":"Outrageous Cherry - Out There in the Dark [1999]","uid":9618307,"size":305011916,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:008cfb1a80bfedf5f69213c82ee80a8062b70acc&amp;dn=Outrageous+Cherry+-+Out+There+in+the+Dark+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1392454451,"description":"Review by Heather Phares  [-]\nOutrageous Cherry's fourth album, Out There in the Dark, is their first for DF2K, the contemporary sister label of Del-Fi, one of the classic labels of the '50s and '60s. The group's jangly, bubblegum-noise aesthetic fits DF2K's retro-contemporary pop agenda to a tee; Out There in the Dark is not only one of Outrageous Cherry's finest albums, but also a fine choice for one of DF2K's first releases. Though the band's bittersweet yet tough sound hasn't changed much since their early singles, singer/songwriter Matt Smith's songwriting has been refined over the years, and the group's arrangements have expanded to include violins, cellos, and trumpets. Out There in the Dark is also the group's most diverse album, with bouncy pop numbers like &quot;Tracy,&quot; &quot;Corruptable,&quot; and the made-for-AM radio &quot;Where Do I Go When You Dream?&quot; balancing moodier songs like the album's slow dance centerpiece, &quot;Easy Come, Uneasy Glow.&quot; Their trippy side comes to the front on the excellent, backwards guitar driven &quot;Only the Easy Way Down,&quot; and in the title track's drifting guitars and shifting tempos. Smith's ultra-faithful, vintage production style sparkles on &quot;A Bad Movie,&quot; and the album closer &quot;There's No Escape From the Infinite&quot; is one of the group's extended, trance-inducing noise workouts -- and a further display of the range Outrageous Cherry finds in updating the styles of the past. While their sound evokes a host of garage-psych bands, from '60s originators to '80s revivalists, Outrageous Cherry's affection for this kind of music, and their experimental touches, make their albums a bit like a jukebox full of forgotten hits, and a bit like a time machine with its controls set for the past and the future. And as always, Out There in the Dark is an enjoyable, entertaining ride. (4.5/5)","torrent":{"xt":"urn:btih:008cfb1a80bfedf5f69213c82ee80a8062b70acc","amp;dn":"Outrageous+Cherry+-+Out+There+in+the+Dark+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"008cfb1a80bfedf5f69213c82ee80a8062b70acc","infoHashBuffer":{"type":"Buffer","data":[0,140,251,26,128,191,237,245,246,146,19,200,46,232,10,128,98,183,10,204]},"announce":[],"urlList":[]}}