{"title":"Shakira - Live &amp; Off the Record 320cbr (Big Papi) 2004","uid":9499256,"size":134248215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:00ed4c649645b50391e1ba7381bd2a0547a9ee93&amp;dn=Shakira+-+Live+%26amp%3B+Off+the+Record+320cbr+%28Big+Papi%29+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1390177609,"description":"Source: CD\nimage\n\nBy Alberto Vargas VINE VOICE\nI'd like to disclose upfront that I am an avid Shakira fan. I have and enjoy all of her albums and compilations, in both Spanish and English.\n\nThis is my favorite Shakira CD. If you are a Shakira fan, it is a must-have. She has some of her greatest hits here, and the energy of the audience at the live concert makes this a very uplifting, energizing listening experience.\n\nNote that this is not a collection of her best songs, and I believe most fans will agree. However, everything on the disc is good, and these are new, refreshing live versions.\n\nWhat is so amazing about this CD, besides the energy of the live versions of the songs? Shakira is a very talented musician and songwriter, unlike many teenybopper artists in the USA. She has been recording great stuff in Spanish since her mid-teens or so, before she was known in the USA.\n\nThe most striking feature in all of Shakira's songs is her voice. Amazing! She has great vocal talent and control. I wish I were a trained musician to describe it better. You have to listen to songs from different albums, in their entirety, to experience the variety and subtlety of her singing.\n\nThat said, to enjoy Shakira's work, and this CD in particular, you need to be able to understand Spanish, or at least be willing to listen to songs in Spanish is you don't understand the lyrics. Half of this CD is in Spanish. In my humble opinion (as a bilingual person who has hear all her work), her best stuff is in Spanish; what she has produced in English is good but just scratches the surface of her talent.\n\nWhile this is an amazing CD, it is probably not the best intro to Shakira if you have never heard her. I generally like remixes and live versions of an artist once I have appreciated the original.\n\nIf it is your first exposure to Shakira, I'd suggest her earlier best-of album, Grandes Exitos, which is purely in Spanish and a truly outstanding album by any measure. If you want English, try Laundry Service, which is a great album.\n\nAs far as songs on this CD go, &quot;Underneath Your Clothes&quot; and &quot;Ciega, Sordomuda&quot; are so outstanding they are worth the price of admission alone, but everything else is great too.\n\nListening to this CD, I wish I had not missed Shakira's Mongoose Tour!","torrent":{"xt":"urn:btih:00ed4c649645b50391e1ba7381bd2a0547a9ee93","amp;dn":"Shakira+-+Live+%26amp%3B+Off+the+Record+320cbr+%28Big+Papi%29+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00ed4c649645b50391e1ba7381bd2a0547a9ee93","infoHashBuffer":{"type":"Buffer","data":[0,237,76,100,150,69,181,3,145,225,186,115,129,189,42,5,71,169,238,147]},"announce":[],"urlList":[]}}