{"title":"Battlestar Galactica - COMPLETE","uid":9476503,"size":29564107812,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:01cb476c4362713cf01d6f179166f2f608bd3bc7&amp;dn=Battlestar+Galactica+-+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"navrasjueventa","files":76,"time":1389710893,"description":"Battlestar Galactica (BSG) is an American military science fiction television series, and part of the Battlestar Galactica franchise. The show was developed by Ronald D. Moore as a re-imagining of the 1978 Battlestar Galactica television series created by Glen A. Larson. The series first aired as a three-hour miniseries (comprising four broadcast hours) in December 2003 on the Sci-Fi Channel, and ran for four seasons thereafter, ending its run on March 20, 2009. The series features Edward James Olmos and Mary McDonnell, and garnered a wide range of critical acclaim, which included a Peabody Award, the Television Critics Association's Program of the Year Award, a placement inside Time's 100 Best TV Shows of All-TIME,[1] and Emmy nominations for its writing, directing, costume design, visual effects, sound mixing, and sound editing, with Emmy wins for both visual effects and sound editing.\n\nThe story arc of Battlestar Galactica is set in a distant star system, where a civilization of humans live on a group of planets known as the Twelve Colonies. In the past, the Colonies had been at war with a cybernetic race of their own creation, known as the Cylons. With the unwitting help of a human named Gaius Baltar, the Cylons launch a sudden sneak attack on the Colonies, laying waste to the planets and devastating their populations. Out of a population numbering in the billions, only approximately 50,000 humans survive, most of whom were aboard civilian ships that avoided destruction. Of all the Colonial Fleet, the eponymous Battlestar Galactica appears to be the only military capital ship that survived the attack. Under the leadership of Colonial Fleet officer Commander William &quot;Bill&quot; Adama (Olmos) and President Laura Roslin (McDonnell), the Galactica and its crew take up the task of leading the small fugitive fleet of survivors into space in search of a fabled refuge known as Earth.\n\nIt spawned the prequel spin-off TV series Caprica, which aired for one season in 2010. Another spin-off, Battlestar Galactica: Blood &amp; Chrome, was released in November 2012 as a web series of ten 10-minute episodes, and aired on February 10, 2013 on Syfy as a televised movie.[2][3]","torrent":{"xt":"urn:btih:01cb476c4362713cf01d6f179166f2f608bd3bc7","amp;dn":"Battlestar+Galactica+-+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cb476c4362713cf01d6f179166f2f608bd3bc7","infoHashBuffer":{"type":"Buffer","data":[1,203,71,108,67,98,113,60,240,29,111,23,145,102,242,246,8,189,59,199]},"announce":[],"urlList":[]}}