{"title":"20131119-WallstreetJournal.pdf","uid":9217163,"size":8560310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:035c55250500d74b391b841e130e2b3be77210ce&amp;dn=20131119-WallstreetJournal.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sidmal","files":-1,"time":1384878846,"description":"The Wall Street Journal is an American English-language international daily newspaper with a special emphasis on business and economic news. It is published six days a week in New York City by Dow Jones &amp; Company, a division of News Corp, along with the Asian and European editions of the Journal.\n\nThe Journal is the largest newspaper in the United States, by circulation. According to the Alliance for Audited Media, it has a circulation of about 2.4 million copies (including nearly 900,000 digital subscriptions), as of March 2013,[2] compared with USA Today's 1.7 million. Its main rival in the business newspaper sector is the London-based Financial Times, which also publishes several international editions.\n\nThe Journal primarily covers American economic and international business topics, and financial news and issues. Its name derives from Wall Street, located in New York City, which is the heart of the financial district; it has been printed continuously since its inception on July 8, 1889, by Charles Dow, Edward Jones, and Charles Bergstresser. The newspaper version has won the Pulitzer Prize thirty-four times,[3] including 2007 prizes for its reporting on backdated stock options and the adverse effects of China's booming economy.[4][5]\n\nIn 2011, The Wall Street Journal was ranked No. 1 in BtoB's Media Power 50 for the 12th consecutive year.\n","torrent":{"xt":"urn:btih:035c55250500d74b391b841e130e2b3be77210ce","amp;dn":"20131119-WallstreetJournal.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035c55250500d74b391b841e130e2b3be77210ce","infoHashBuffer":{"type":"Buffer","data":[3,92,85,37,5,0,215,75,57,27,132,30,19,14,43,59,231,114,16,206]},"announce":[],"urlList":[]}}