{"title":"Black.Girlfriend.Sex.Tapes.2.XXX.DVDRip.x264-DoggPound","uid":9455600,"size":811245821,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:05c245ee5e005b88afecff50f2236158882ab7f9&amp;dn=Black.Girlfriend.Sex.Tapes.2.XXX.DVDRip.x264-DoggPound&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":5,"time":1389265326,"description":"Category: All Sex, Interracial, Black, Amateur\n\nCast: Bella, Daniella D., Dezire, Pinkett\n\n100% Genuine Amateur Hardcover!\nFirst Time Girlfriends On Video! Big Titted Beauties Who Love To Fuck!\nPinkett - Sucks And Fucks Cock Like There is No Tomorrow - Wearing a black cat mask and a huge smile, Pinkett takes off her top for the camera then gets on her knees to suck some cock like there is no tomorrow. Bernie takes off her panties and plays with her clit for the camera. Bernie's cock is hard and ready for her tight pussy, so he slides it in and she moans at his girth! She tells him to fuck it harder, and he does in several positions before pulling out and cumming all over her ass!\nDezire - A Good Hard Fuck With A Big Hot Load To Swallow! - Vince Vibe is hanging out at home when the doorbell rings. It turns out to be his neighbor Dezire, and suddenly he realizes that there is something wrong with her. She admits that she wants to have a baby but is having problems conceiving, so being a good friend Vince decides to help her out. She starts out blowing him but soon they are on the couch with Vince giving her a good hard fuck before pulling out and letting her swallow his load!\nBella - Jake's Girlfriend's best Friend Is So Hot He Has To Fuck Her! - Bella is in town and it is Jake Sperrow's goal to fuck her before she leaves. Jake goes into her room and wakes her up with a cock to the face! At first Bella is worried that his girlfriend will hear but she sucks his cock anyway. He pulls up her skirt to look at her chocolate skinned tight ass. He slides inside her fucking her slowly then harder as they change positions, then he unloads all over her chest!\nDaniella D - Wipes All The Tension Away With A Full Body Massage! - Jelene and Daniella are on the bed and Jolene is tense. Daniella starts to lotion her up and rub her down, making sure she wipes all the tension away. Jolene asks for a lower body massage since she's very tense and Daniella is happy to help! The girls please each other over and over. Unable to resist, Jolene's boyfriend gives her something to suck on as her tension melts away with each orgasm!\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=54505820088674254307.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=54505820088674254307.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=40229949914201172562.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=40229949914201172562.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=43698161273793947043.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=43698161273793947043.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:05c245ee5e005b88afecff50f2236158882ab7f9","amp;dn":"Black.Girlfriend.Sex.Tapes.2.XXX.DVDRip.x264-DoggPound","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c245ee5e005b88afecff50f2236158882ab7f9","infoHashBuffer":{"type":"Buffer","data":[5,194,69,238,94,0,91,136,175,236,255,80,242,35,97,88,136,42,183,249]},"announce":[],"urlList":[]}}