{"title":"Rona Renner - Is That Me Yelling.","uid":10146057,"size":1864273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0704173f14af5d7b9551e05cb906a877b3f6e9ae&amp;dn=Rona+Renner+-+Is+That+Me+Yelling.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SectorVector","files":-1,"time":1400056044,"description":"\n\nIs That Me Yelling?: A Parent's Guide to Getting Your Kids to Cooperate Without Losing Your Cool \n\nby Rona Renner, Christine Carter (Foreword by) \n  \n\n# ISBN-13: 9781608829071 \n# Publisher: New Harbinger Publications\n# Publication date: 5/1/2014\n# Pages: 224\n\n\nBeing a parent is hard work! And when your child refuses to do even the little things -- like picking up their toys, taking a bath, or getting in the car to go to school -- it's easy to become frustrated. But what if there was a gentle, effective way for you to improve your kid's behavior without losing your cool or raising your voice? In Is That Me Yelling? leading authority on parenting, Rona Renner outlines effective communication strategies that focus on your child's unique temperament.\n\nWhile most books on discipline are &quot;one size fits all,&quot; this book offers a tailored parenting approach. Inside, you will learn powerful mindfulness techniques based in cognitive behavioral theory (CBT) and temperament theory to help reduce conflict and foster cooperation, respect, and understanding in your family. You will also learn the real reasons behind your frustration, how your unique temperament, as well as your child's, can contribute to you losing your temper, and how you can start feeling calm and connecting with your child in a positive way, right away.\n\n\n\nAuthor:\n======\n\nRona Renner, RN, graduated from Brooklyn College School of Nursing in 1966, and she has since been dedicated to solving problems and helping people reduce their suffering. Her extensive experience includes working in medical hospitals and mental health programs in New York City and California; training women in childbirth preparation in Zaire, Africa (now the Democratic Republic of the Congo); helping to start a learning disabilities program in Pune, India; and providing parent education and ADHD and temperament counseling at Kaiser Permanente in Northern California.\n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/16158325-is-that-me-yelling&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/16158325-is-that-me-yelling&lt;/a&gt; - 4.3/5.0\n\nAmazon - 4.8/5.0\n\n-_-","torrent":{"xt":"urn:btih:0704173f14af5d7b9551e05cb906a877b3f6e9ae","amp;dn":"Rona+Renner+-+Is+That+Me+Yelling.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0704173f14af5d7b9551e05cb906a877b3f6e9ae","infoHashBuffer":{"type":"Buffer","data":[7,4,23,63,20,175,93,123,149,81,224,92,185,6,168,119,179,246,233,174]},"announce":[],"urlList":[]}}