{"title":"BBX Hardcore - x264 - MP4 - DVDrip","uid":9503585,"size":4118199007,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:080987fe1033cba64cffedf74d426200bf561531&amp;dn=BBX+Hardcore+-+x264+-+MP4+-+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MrTVGuy","files":-1,"time":1390271548,"description":"All nine workouts have been encoded for maximum compatibility, small file sized and good quality. As always, my encodes are fully Softmod Wii compatible.\n\nPRODUCT DESCRIPTION\n\nBBX Hardcore is for athletes and serious fitness enthusiasts who are looking to take their performance to the next level. BBX Hardcore takes body weight training and endurance training to a whole new level helping you achieve maximum results through Dede's ground breaking methods of &quot;Power Endurance Training&quot; -no equipment is required You will challenge every major muscle group in your body, you will work them in ways you never thought possible and you will get ripped BBX Hardcore uses unique combinations of different exercises to challenge your body in new ways. Not only with you build lean muscle, you will also focus on balance, agility and functional training and your own body awareness will increase as a result of this workout. And like all BBX workouts, muscle confusion is key -you will not plateau with this workout BBX Hardcore will enhance your physique, your health, your energy, your athletic performance and your life This workout is intense and should only be attempted by those of you who are serious about fitness training. There is no choreography to learn and no dance moves to master, just an old-school hardcore workout that will push your limits and have you begging for more. ","torrent":{"xt":"urn:btih:080987fe1033cba64cffedf74d426200bf561531","amp;dn":"BBX+Hardcore+-+x264+-+MP4+-+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"080987fe1033cba64cffedf74d426200bf561531","infoHashBuffer":{"type":"Buffer","data":[8,9,135,254,16,51,203,166,76,255,237,247,77,66,98,0,191,86,21,49]},"announce":[],"urlList":[]}}