{"title":"Sabayon 14.05 KDE x64","uid":10130484,"size":2161115136,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:0883c235ce077a1f6d1ad6e3a99904f62aee7152&amp;dn=Sabayon+14.05+KDE+x64&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1399834902,"description":"Sabayon 14.05 KDE x64\n\nMay, 2014\n\n\n\n\n\n\nSabayon 14.05 is a modern and easy to use Linux distributionbased on Gentoo, following an extreme, yet reliable, rolling release model.\n\nThis is a monthly release generated, tested and published to mirrors by ourbuild servers containing the latest and greatest collection of softwareavailable in the Entropy repositories.\nThe ChangeLog files related to this release are availableon our mirrors.\n\nThe list of packages included in each Sabayon flavor is available inside*.pkglist&quot; files. Our team is always busy packaging the latest andgreatest stuff. If you want to have a look at what's inside ourrepositories, just go to our packages website.\n\nPlease read on to know where to find the images and their torrentfiles on our mirrors.\nFresh software, at all times\n\nSabayon developers have the funny habit of packaging all the latest stuff that is in the Gentoo repositories and make it available as soon as possible to our users. If you are looking for the latest KDE, GNOME or LibreOffice, the chance that &quot;it's all in the repos already&quot; are very high. We keep rolling 24/7, 365 days a year, because old software get us instantly bored.\nAvailable releases\n\nWe offer both 64bit and 32bit images but, these days, unless you're very masochist you should really avoid 32bit and go straight to the future, 64bit that is.\nBesides this little piece of advice, you are free to choose between the wonderful minimalism of GNOME, the eyecandy of KDE or the old fart called Xfce. If you are the kind of person who just needs Fluxbox/Openbox/whatever else, just get the Minimal image and you won't be hit by the &quot;OMG candies&quot; bloat that is in the other images.\nSteam Big Picture mode\n\nFollowing our well appreciated Media Center mode, that lets you convert your computer into an XBMC-based media center, we're now offering a way to get away from the boring Christmas movies and start doing something more serious: gaming, on Linux. Our KDE and GNOME images come with Steam preinstalled and ready to be launched. In addition to this, a new boot and install mode called &quot;Steam Big Picture&quot; (formerly and improperly known as SteamBox mode) is now available letting you turn your computer into a real Linux gaming console, no matter if it is NVIDIA, AMD or Intel GPU-based.\nBinary vs Source Package Manager\n\nIt's up to you whether turn a newly Sabayon installation into a geeky Gentoo ~arch system or just camp on the lazy side and enjoy the power of our binary, dumbed down Applications Manager (a.k.a. Rigo). With Sabayon you are really in control of your system the way you really want.\nNative NVIDIA and AMD GPU drivers support\n\nAll our releases natively support the latest and greatest GPU hardware from NVIDIA and AMD through their proprietary drivers. Whether you want to enjoy your Linux rig for gaming or video playback, you can. For AMD hardware though, we default to the Open Source implementation for the supported cards. Make sure to pass &quot;nomodeset&quot; to the boot command line to force the proprietary drivers to be used instead.\nLTSI Linux Kernels, 3.10, 3.12 offered\n\nWe are now tracking the 3.10 and 3.12 Long Term Stable Linux kernels, offering (almost) same-day updates to them. If you are using Sabayon in a server environment, you surely welcome this. However, if you're using Sabayon on your laptop, desktop workstation, switching between kernels or just moving to a new version has become a no-brainer operation through Rigo: just go to the preferences menu, select the kernel menu (LTS and regular kernels are listed in separate menus), pick a kernel and click &quot;Install&quot;. Rigo will take care of updating external modules in a reliable and safe way on your behalf.\n\n","torrent":{"xt":"urn:btih:0883c235ce077a1f6d1ad6e3a99904f62aee7152","amp;dn":"Sabayon+14.05+KDE+x64","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0883c235ce077a1f6d1ad6e3a99904f62aee7152","infoHashBuffer":{"type":"Buffer","data":[8,131,194,53,206,7,122,31,109,26,214,227,169,153,4,246,42,238,113,82]},"announce":[],"urlList":[]}}