{"title":"Alex Jones Show - 2014 May 07 WE [sebaygo1]","uid":10110261,"size":71638737,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0b92bfb68c4a09032a0093b26cd8d52ae16222c0&amp;dn=Alex+Jones+Show+-+2014+May+07+WE+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1399508470,"description":"Wednesday, 07 May 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\nFrom the Infowars web site :: On the Wednesday, May 7 edition of Infowars Live, Alex Jones delves into the veritable cornucopia of headlines, explaining the FEC's move to regulate conservative media outlets like Drudge Report as an attack on the First Amendment, and reporting on the crisis in Ukraine where pro-Russian forces battle for control of the east. \n\nJones also looks at the wider repercussions of U.S. entanglement in the regional war, keeping in mind Russia's military exercises involving nuclear capable strategic bombers off the Pacific coast of the U.S. \n\nOn today's show, Alex is joined by preeminent researcher and independent scholar in the field of the occult, secret societies and their symbols, Jordan Maxwell, to discuss the subversive symbolism in Hollywood, focusing on zombies and visible imagery in films such as Pirates of the Caribbean. \n\nWe'll also consider the latest Fukushima radiation news, predictions that every country will have armed drones within 10 years, the Obamacare boondoggle.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:0b92bfb68c4a09032a0093b26cd8d52ae16222c0","amp;dn":"Alex+Jones+Show+-+2014+May+07+WE+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b92bfb68c4a09032a0093b26cd8d52ae16222c0","infoHashBuffer":{"type":"Buffer","data":[11,146,191,182,140,74,9,3,42,0,147,178,108,216,213,42,225,98,34,192]},"announce":[],"urlList":[]}}