{"title":"[SexArt] Silvie Deluxe - Drive - NEW 25 MAY 2014 NEW","uid":10219318,"size":211651888,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0e8e2cafe68f943727b1207492591e8f7858fcda&amp;dn=%5BSexArt%5D+Silvie+Deluxe+-+Drive+-+NEW+25+MAY+2014+NEW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"manam69","files":1,"time":1401011176,"description":"[SexArt] Silvie Deluxe - Drive - NEW 25 MAY 2014 NEW\n\nMatt Ice steers his car along the streets of the city. Silvie Deluxe occupies the passenger seat. They chat. They laugh. They flirt. She teases him, licking his ear, kneading his crotch. She fishes his cock out of his pants, strokes it, then begins sucking it. Ice keeps the vehicle on the road and then pulls to a stop in front of her house. Frantic with desire, the couple race to the front door and hurry inside. Even though they're no longer cruising along the boulevard, &quot;Drive&quot; maintains its power and pace throughout. The couple kiss passionately, Deluxe resumes her blowjob. She pushes her partner backwards onto a plush chair. The blowjob soon becomes a sixty-nine. Deluxe lifts her pussy from Matt's mouth, straddles his waist, and takes his cock inside her. She rides him, each pump, each slap of skin on skin, every thrust, taking them ever closer to their destination. The breathless cowgirl pulls her steed into an upright, seated position, then she rolls onto her back. With Ice once more in the proverbial driver's seat, their journey to ecstasy continues with even more urgency. Silvie arrives first, but Matt is close behind. He pulls out and with a few determined strokes Deluxe milks the cum from Matt's cock. Impassioned performances and an energetic production style make &quot;Drive&quot; a high octane erotic ride.\n\n\n\n &lt;a href=&quot;\nhttp://imgfun.biz/img-53819ef476ca9.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgfun.biz/img-53819ef476ca9.html&lt;/a&gt; ","torrent":{"xt":"urn:btih:0e8e2cafe68f943727b1207492591e8f7858fcda","amp;dn":"%5BSexArt%5D+Silvie+Deluxe+-+Drive+-+NEW+25+MAY+2014+NEW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8e2cafe68f943727b1207492591e8f7858fcda","infoHashBuffer":{"type":"Buffer","data":[14,142,44,175,230,143,148,55,39,177,32,116,146,89,30,143,120,88,252,218]},"announce":[],"urlList":[]}}