{"title":"[PS3] Sonic The Hedgehog","uid":9582539,"size":7999921202,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0ec4f03bcbe401857edf4caf78436d063fcfdafa&amp;dn=%5BPS3%5D+Sonic+The+Hedgehog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"fuckface69","files":-1,"time":1391789353,"description":"Sonic and his friends are among the most recognisable icons in video games history. Since his birth in 1991, Sonic the Hedgehog has spanned several gaming generations, appearing in over 30 titles that have sold more than 38 million copies worldwide. Now Sonic makes the leap to the next generation with Sonic the Hedgehog for PlayStation 3.\n\nIn Soleanna, the City of Water, lives Princess Elise, The keeper of the Flames of Disaster, an artifact linked to the famous Chaos Emeralds.\n\nIn an attempt to gain control of the Flames of Disaster for his own nefarious ends, Dr. Eggman kidnaps the Princess. Now it's up to Sonic to set out once again to secure the Chaos Emeralds and to rescue Princess Elise from the clutches of Eggman.\n\nYou'll not only play as Sonic, but also as Shadow the Hedgehog, a dark and mysterious rival of Sonic's who is able to drive vehicles, and Silver the Hedgehog, a time travelling hedgehog with psychokinetic powers.\n\nEach character also has a partner character that can join in and help out from time to time on specific levels, including such favourites as Miles &quot;Tails&quot; Prower, Knuckles the Echidna and Amy Rose.\n\nTaking the attitude and gameplay of the classic Sonic games and combining it with the kind of speed that PlayStation 3 can deliver makes Sonic the Hedgehog the pinnacle of fast-paced platform gaming, as well as a non-stop thrill ride that is sure to please both the long-time Sonic fans along with a brand new generation of gamers.\n\n* Witness the rebirth of Sonic with an unparalleled sense of speed that is only possible using the processing power afforded by PlayStation 3\n* Play as one of three playable characters, each with their own partner character and special abilities\n* Make your way through 11 beautiful stages filled with unique hazards and dangers, along with special areas only reachable by certain characters.\n____________________________________\n\nUSE LATEST WINRAR FOR THE .RAR FILE!","torrent":{"xt":"urn:btih:0ec4f03bcbe401857edf4caf78436d063fcfdafa","amp;dn":"%5BPS3%5D+Sonic+The+Hedgehog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec4f03bcbe401857edf4caf78436d063fcfdafa","infoHashBuffer":{"type":"Buffer","data":[14,196,240,59,203,228,1,133,126,223,76,175,120,67,109,6,63,207,218,250]},"announce":[],"urlList":[]}}