{"title":"Hardtied--Submission  Yulia Catava  OT High","uid":10109362,"size":2239918451,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0efbe60b3d053d52e28b5de7a533e56e13313b40&amp;dn=Hardtied--Submission++Yulia+Catava++OT+High&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"merzedes","files":-1,"time":1399498601,"description":"Submission | Yulia Catava | OT\n\nMay 7, 2014\n\n\nHigh Bitrate MP4 only.\n\n\nOne word says it all with Yulia Catava: Submission. It is her ultimate desire to submit to a higher force power and find something greater than herself. Some people go looking for god when they feel that. Yulia came looking for O.T. She is a sexy young thing. He would never turn her away, She looks so sweet and innocent in her dress, but if that\n\nHer wrists are tied to her ankles, her elbows to her knees, leaving her sitting awkwardly, just waiting for him to decide what to do with her next. He ignores her completely while drilling into the floor and she knows better than to interrupt him with questions. It isn't long before he turns his attention to her and silently begins to elaborate upon her bondage.\n\nHer legs are spread wide by the rope. O.T. doesn't say a word as he moves around her and Yulia doesn't dare break the silence. She wonders to herself if he knows how wet she is, being exposed the way she is. When she feels his hand slide between her legs she doesn't have to wonder anymore. He can feel her lust through the panties that cover her and she knows it. She thought the humiliation of being found out would be too much to bear, but now that it has happened she is so turned on by it.\n\nThat is the moment O.T. knew he owned her. Her passion for bondage had completely overwhelmed her senses and she had barely even started. Everything after that just pushed her deeper into subspace. When most people would scream at having their clothing cut away, Yulia just let out a little gasp. While most women would scream at having their back whipped, she just let out small, satisfied moans. The caning, the humiliation, the feeling of helplessness and exposure, she knew they should make her run or beg for mercy, but all they did was make her more and more horny until her eventual orgasm was the hardest and most satisfying of her life. \n \nScreens &lt;a href=&quot;\nhttp://hardtied.com/hogtied/bondage/2014/05_07ycatava/Hardtied-Yulia-Catava-OT-Submission.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hardtied.com/hogtied/bondage/2014/05_07ycatava/Hardtied-Yulia-Catava-OT-Submission.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:0efbe60b3d053d52e28b5de7a533e56e13313b40","amp;dn":"Hardtied--Submission++Yulia+Catava++OT+High","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0efbe60b3d053d52e28b5de7a533e56e13313b40","infoHashBuffer":{"type":"Buffer","data":[14,251,230,11,61,5,61,82,226,139,93,231,165,51,229,110,19,49,59,64]},"announce":[],"urlList":[]}}