{"title":"Umberto D 1952 DVDRip Sonata Premiere","uid":9486769,"size":626958044,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1001d374c327872321c1dd32ebdb6075d9c815ae&amp;dn=Umberto+D+1952+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"klinho","files":5,"time":1389908099,"description":"Frequently mentioned on lists of masterpieces of modern cinema, Vittorio De Sica's Umberto D. transforms a simple character study into a painfully poignant drama. Umberto is an aging former civil servant, now retired on his scant government pension. He spends his time in his tiny room in Rome, with only his longtime pet dog for companionship. His lonely life only grows worse when his limited income forces him to fall behind on his rent, leading his landlady to threaten him with eviction. He makes a desperate attempt to raise the needed money and protest the unfair treatment of senior citizens to the government, but he receives little response. His one chance at human contact, through brief conversations with a pregnant servant, proves sadly disappointing. Indeed, Umberto slowly becomes convinced that the situation may be hopeless, and he ultimately considers committing suicide. Considered one of the high points of Italian neo-realist cinema, Umberto D. provides the ultimate example of the movement's unadorned, observational style, which emphasizes the reality of events without calling attention to their emotional or dramatic impact. The unschooled, natural performances also contribute to the film's feeling of verisimilitude, particularly the lead performance by non-actor Carlo Battisti.\n\n\nSubs srt: Portuguese / English / Spanish / French","torrent":{"xt":"urn:btih:1001d374c327872321c1dd32ebdb6075d9c815ae","amp;dn":"Umberto+D+1952+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1001d374c327872321c1dd32ebdb6075d9c815ae","infoHashBuffer":{"type":"Buffer","data":[16,1,211,116,195,39,135,35,33,193,221,50,235,219,96,117,217,200,21,174]},"announce":[],"urlList":[]}}