{"title":"RealtimeBondage--Pricked  Mollie Rose  Cadence Cross MP4","uid":9467301,"size":1079951854,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:17d3cee87d2acaa980a8268f32b3324eb3a6f27f&amp;dn=RealtimeBondage--Pricked++Mollie+Rose++Cadence+Cross+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1389479458,"description":"Pricked | Mollie Rose | Cadence Cross\n\nJanuary 11, 2014\n\n\nMP4 only.\n\n\nWhen a movie opens up on two beautiful young women locked in a cage you know that it is going to be a good one. Mollie Rose and Candace Cross are in this together today. \n\nMollie is our main focus. She has had the chance to sit in on our live feeds before, so she knew exactly what she was getting herself into when she signed up. In fact, that is why she was so excited to come work with us again. She is one of the most intense submissives that we have ever come across, in fact. She doesn't just like bondage and discipline. It isn't just a sexual fetish or even a lifestyle for her. It is part of the core of her being, and every time she finds one of her own limits it becomes her mission to have them pushed. It infiltrates every part of her life, but the best part of being with us is doing it all on a grand stage for so many viewers.\n\nCandace is on stand by today. She hasn't seen what kind of demented things come up during a live bondage show. We will go easy on her, at least at first, because one day she may have be doing a feed of her own. Of course, being a first timer she has no clue what to expect, and a little fear and anticipation make everything so much worse. We're going to work her nerves a bit before we start in on her body. It's better this way. \n\nLike always we start with the questioning. We like to get to know the girls before we start the action. It gives us insight into what makes them tick. No detail is too insignificant when you are looking for a bit of an opening. Anything they say can and will be used against them to make them cry. We learn a little bit about the things that they like and don't like, enough to make good use of the information later. \n\nWhen we take them out of the cage it doesn't mean they have found their freedom. Quite the contrary, in fact. We have some shackles and handcuffs to lock them into. There is a bowl full of keys nicknacks near by and the first girl to find her set and get unlocked is going to get a very special prize. There are some intense orgasms in store for the winner of our little competition. And for the loser? We haven't figured out what happens to her yet, but it will not be pleasant.\n\nA few of our members got curious about PD's particular style of bondage. With Mollie on set it makes perfect sense to use her for the demonstration. She knows her willingness to serve is going to pay off. The bondage comes in the form of a clam shell style tie that folds her perfectly in half. She can look up over her tightly tied legs and we have a nice view of her neatly maintained pussy. Add a ball gag for good measure and Mollie is in bondage slut heaven. \n\nCandace gets in on the action, too. She has her own tie on, but it allows her a lot more freedom of movement. Specifically she is more than able to put on a strap on dildo and give Mollie a hell of a ride. The great thing about the rubber cocks is that they are so relentless. The bells we have clamped to Candace's nipples add a nice little jingle to go along with the sex. This lesbian strap on sex session is going to last until we decide we have had enough, and it won't end a moment sooner. \n\nMollie has told us before she enjoys corporal punishment as much as she does sex, so we have to test that. The tie we have her in isn't really made for suspending girls, but that isn't going to stop us from trying. We lift her up and she immediately starts complaining about the tension on her neck. That's fine. There is always another way to handle these things. \n\nFor Mollie we set her back down and started giving her a bit more of the kind of punishment she loves. Pussy flogging, face slapping, and just general abuse all make her dripping wet. She has already been fucked once today, but if we keep this up she'll be begging for another in no time.  \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/01_11mrose/RealTimeBondage-Mollie-Rose-Cadence-Cross-Pricked.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/01_11mrose/RealTimeBondage-Mollie-Rose-Cadence-Cross-Pricked.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:17d3cee87d2acaa980a8268f32b3324eb3a6f27f","amp;dn":"RealtimeBondage--Pricked++Mollie+Rose++Cadence+Cross+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d3cee87d2acaa980a8268f32b3324eb3a6f27f","infoHashBuffer":{"type":"Buffer","data":[23,211,206,232,125,42,202,169,128,168,38,143,50,179,50,78,179,166,242,127]},"announce":[],"urlList":[]}}