{"title":"Owsley - Owsley [1999]","uid":9618317,"size":315427166,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1c06b8963f911239f100f250b3ff8d31df90fbc4&amp;dn=Owsley+-+Owsley+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"GenXRock","files":-1,"time":1392454962,"description":"Review by Paul Pearson  [-]\nAlabama born multi-instrumentalist Will Owsley followed a career path not unlike Sheryl Crow's, by backing up big mainstream pop artists, collecting the rewards and channeling them into his own solo work. Owsley plied his wares in the bands of Shania Twain and Amy Grant in the mid-'90s, then recorded his own material at home, and offered the finished product to record companies on a take-it-or-leave-it basis -- just like Tom Scholz did with the first Boston album, Owsley noted. Giant Records took it, and released Owsley's debut in 1999. Another of Owsley's old bands contained Ben Folds, and their likemindedness is hard to miss; this album's &quot;Zavelow House&quot; and &quot;Sonny Boy&quot; are practically Ben homages. While both craft pop hooks which make similarly instant impressions, Owsley toughens them up with meatier singing and crunching guitars, avoiding the occasional maudlin sensibilities of Folds' stuff -- the &quot;wimp factor&quot; is wisely absent here. Owsley's power-chord crunch and serviceable soloing amplify matters in songs like &quot;Oh No the Radio&quot; and &quot;I'm Alright.&quot; Owsley's sonic references originate in the '70s: there's Todd Rundgren's keyboard melodicism, the offbeat arrangements of 10cc, and even a throwback to the stylized country-rock of Dave Mason. In terms of amplitude and attitude, though, this album is a direct product of the late '90s. Owsley is about as ideal as pop solo debuts get; like Jason Falkner Presents Author Unknown and the first Folds album, it introduces expert tunesmithing and by an unassuming musical personality. Smart, tasty, and guilt-free. (4/5)","torrent":{"xt":"urn:btih:1c06b8963f911239f100f250b3ff8d31df90fbc4","amp;dn":"Owsley+-+Owsley+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c06b8963f911239f100f250b3ff8d31df90fbc4","infoHashBuffer":{"type":"Buffer","data":[28,6,184,150,63,145,18,57,241,0,242,80,179,255,141,49,223,144,251,196]},"announce":[],"urlList":[]}}