{"title":"The Miracle of the Bells (1948) Xvid 1cd - Fred MacMurray, Frank","uid":10173573,"size":734625792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e1c69ae6bed282e703050330f4fc15ead230b46&amp;dn=The+Miracle+of+the+Bells+%281948%29+Xvid+1cd+-+Fred+MacMurray%2C+Frank&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1400439791,"description":"The Miracle of the Bells (1948) Xvid 1cd - Fred MacMurray, Frank Sinatra [DDR]\n\nThe Miracle of the Bells is a 1948 film produced by RKO. It stars Fred MacMurray, Alida Valli, Frank Sinatra, and Lee J. Cobb. Directed by Irving Pichel, with a script by Quentin Reynolds and Ben Hecht.\nThe film is based on a novel by Russell Janney.\n\n    CAST:-\n    Fred MacMurray as William 'Bill' Dunnigan\n    Alida Valli as Olga Treskovna\n    Frank Sinatra as Father Paul\n    Lee J. Cobb as Marcus Harris\n    Harold Vermilyea as Nick Orloff\n    Charles Meredith as Father J. Spinsky\n    James Nolan as Tod Jones\n    Veronica Pataky as Anna Klovna\n    Philip Ahn as Ming Gow\n    Frank Ferguson as Mike Dolan\n    Frank Wilcox as Dr. Jennings\n    Dorothy Sebastian as Miss Katie Orwin (Uncredited)\n    Michael Raffetto - Harold Tanby (uncredited)\n\nDirected by Irving Pichel\nWritten by Russell Janney\n\nMOVIE REVIEW:- The Miracle of the Bells (1948)\nThe story begins as Hollywood press agent Bill Dunnigan (Fred MacMurray), who works for a fictional movie studio, arrives by train with the body of Polish-born actress Olga Treskovna (Alida Valli), in her hometown, a city referred to affectionately by its population as &quot;Coaltown&quot; because of its coal mining industry. In a voiceover narrated by Dunnigan, we learn that he was in love with Olga, although we never find out if she truly reciprocated his love. He has brought her back to &quot;Coaltown&quot; to honor her deathbed request - to be buried there. After encountering some hostility from the local funeral director who resents Olga's father because he was crooked, Dunnigan enlists the services of Father Paul (Frank Sinatra), the local priest, who pulls some strings to grant Olga's request.\n\nThe main flashback story then begins, showing how Olga is plucked from a chorus line in a nightclub to serve as a double for an extremely temperamental film actress who is to star as Joan of Arc in a motion picture. Dunnigan realizes that Olga has the makings of a talented actress herself, and when the film's star throws a tantrum and walks out, he manages to convince Marcus Harris, the film's producer (Lee J. Cobb), to audition Olga, despite her having had no film experience. The screen test is a success and Olga is cast as Joan. However, as filming progresses, she shows signs of being seriously ill. After taking her to see a doctor, Dunnigan is secretly informed that Olga has a severe, potentially fatal form of tuberculosis, caused by her inhalation of the coal dust that circulated in &quot;Coaltown&quot;. Desperate to do something for her hometown that will restore the pride of its bitter and disillusioned citizens, Olga continues with the filming, and collapses after the shooting ends. Rushed to a hospital, she dies with Dunnigan at her side.\n\nTo generate interest in the film, the grief-stricken Dunnigan desperately pulls a publicity stunt, convincing churches all across &quot;Coaltown&quot; to ring their bells for three days as a tribute to the dead actress and promising to pay them with checks that he cannot possibly cover. Huge interest begins to develop in the unknown actress who gave her life to complete a film, and Marcus Harris wires Dunnigan enough money to cover the checks. But Harris calls Dunnigan and tells him that he has decided not to release the film, because the moviegoing public might resent greeting the arrival of a new star who is actually dead. Harris intends to recast the role and begin filming all over again.\n\nOn the day of Olga's funeral, an overflow crowd which includes Dunnigan enters the tiny local church, which can only hold a certain number of people, and has never been full until now. As the crowd prays, a loud creaking noise is heard, and the statues of St. Michael and the Virgin Mary slowly turn on their pedestals until they face Olga's coffin. The parishioners regard this as a miracle, even though the logical explanation is that the ground underneath the church has been weakened because of the large crowd, causing the statues to turn. Dunnigan persuades Father Paul not to tell the people of Coaltown the truth; their religious faith is restored, and Marcus Harris, after much reluctance, decides to release the film, which becomes a huge success.\n\n\nPRODUCTION NOTES:-\nThe film was put into production at the same time that Ingrid Bergman was filming her own Technicolor Joan of Arc, which was also released by RKO in 1948. Ironically, the very expensive Bergman film, although much more highly regarded today, was not a success upon release, unlike the fictional Joan of Arc film depicted in The Miracle of the Bells.\n\nFor that matter, The Miracle of the Bells has also been dismissed by critics, and was mentioned in the satirical film book The Golden Turkey Awards, which poked fun at Frank Sinatra's portrayal of Father Paul. Time Magazine excoriated the film upon release, declaring in their review that &quot;St. Michael ought to sue&quot;. In recent decades the film has developed a better reputation due to its realistic portrayal of coal miners in small town America. Many of the extras in the film were actual miners working for the Glen-Alden Coal Company. Several exterior shots were filmed on location in Glen Lyon, Pennsylvania, the town in which the film and novel take place.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 120 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 120 mins","torrent":{"xt":"urn:btih:1e1c69ae6bed282e703050330f4fc15ead230b46","amp;dn":"The+Miracle+of+the+Bells+%281948%29+Xvid+1cd+-+Fred+MacMurray%2C+Frank","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1c69ae6bed282e703050330f4fc15ead230b46","infoHashBuffer":{"type":"Buffer","data":[30,28,105,174,107,237,40,46,112,48,80,51,15,79,193,94,173,35,11,70]},"announce":[],"urlList":[]}}