{"title":"NubileFilms - Her Pussy Craves (2014) [540p].mp4","uid":10383887,"size":234663692,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2599730506622dc3979696f87676863f067bb440&amp;dn=NubileFilms+-+Her+Pussy+Craves+%282014%29+%5B540p%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Artrage","files":-1,"time":1403112977,"description":"\nNubileFilms - Her Pussy Craves (2014) [540p].mp4\n\n\nPosters and Screenshots\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=65711582510317112852.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=65711582510317112852.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=00081290778068070418.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=00081290778068070418.jpg&lt;/a&gt;\n\n\n\nCast\n\nAidra Fox \n\n\nDescription\n\n&quot;Super sexy Aidra Fox is keeping herself occupied throughout the afternoon as she waits for her man Bruce Venture to return her text so that she can hook up with him for a good time. When he finally does get back to her, a big smile crosses Aidra's face and she rises to meet him.\n\nThe lovers are finally able to come together and they do with a passion! Their clothes go flying as they get skin to skin as quickly as possible, and within moments Aidra is able to take her man's already hard cock and wrap her eager lips around the head to start a wet warm blowjob. In her excitement she takes every inch of her beau's dick deep in her throat!\n\nAfter enjoying the oral pleasure for a few minutes, Bruce just can't take it any longer. Lifting Aidra up, he flips up her miniskirt and slams his cock deep into her tight pussy that is already dripping with pleasure. Aidra is happy to ride her man cowgirl style, thrusting her hips to piston Bruce's fuck rod in and out of her cum hungry twat.\n\nTurning his woman over on her back, Bruce uses the perfect height of the couch to slam himself home from an angle that hits Aidra's g-spot and causes instant moans of ecstasy from his woman. With Aidra rubbing her clit in time to her man's thrusts, it is only a few moments before she experiences her first trembling climax.\n\nMoments later after Aidra has rewarded her guy with a second dick sucking, she re-mounts his rock hard dick to enjoy the power of being on top. Bruce plays along for a while, but as Aidra's second orgasm grows closer he flips them into a spooning position and then drops down to eat out her still pulsing pussy for a quick third shivering moment of ecstasy.\n\nNext Aidra goes up on her hands and knees and offers her luscious ass to her guy so that her soft pussy is fully exposed. Bruce instantly takes advantage and delivers a proper pussy pounding that goes on until the last moment when he pulls out to let Aidra drink down all of his salty warm cum in her eagerly open mouth.&quot;\n\n\nTags \n\nHardcore, XxX, Hot, Blowjob, Brunette, Straight\n\n\nResolution  \n\n960x540\n\n\nDuration  \n\t\n00:15:05\n\n\nSize      \n\n223 MB\n","torrent":{"xt":"urn:btih:2599730506622dc3979696f87676863f067bb440","amp;dn":"NubileFilms+-+Her+Pussy+Craves+%282014%29+%5B540p%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2599730506622dc3979696f87676863f067bb440","infoHashBuffer":{"type":"Buffer","data":[37,153,115,5,6,98,45,195,151,150,150,248,118,118,134,63,6,123,180,64]},"announce":[],"urlList":[]}}