{"title":"Official Formula 1 2012 Season Review 720p 50fps F1 ThaiSchumiHD","uid":9532941,"size":7303742846,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:259b95b635c68f0e38f9cb1d7b7fc81098039041&amp;dn=Official+Formula+1+2012+Season+Review+720p+50fps+F1+ThaiSchumiHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"minhthai911","files":9,"time":1390874260,"description":"What an amazing season of F1 racing the 2012 World Championship has produced!\n\nWith the official review, you'll be able to relive vital highlights from throughout the year, including action-packed racing, interviews, behind-the-scenes access and more - it is your comprehensive record of a scintillating Formula 1 year.  Includes a 2-hour extra disc - exclusive to the blu-ray version - entitled: &quot;The Story of 2012&quot; with lots of  pre-race, practice and qualifying news and reviews, narrated by Will Buxton.\n\nAlthough reigning champion Sebastian Vettel started the year as favourite, the first half of the season proved thoroughly unpredictable, with seven different winners in the first three races, including first time Grand Prix winners Nico Rosberg and Pastor Maldonado.\n\nAs McLaren pairing Lewis Hamilton and Jenson Button struggled with various issues, Fernando Alonso became the unlikely championship leader in a Ferrari regarded by most as not the fastest nor most competitive car on the grid.\n\nOf course, Red Bull can never be discounted and when Vettel found his form the title battle became a thrilling two horse race right down to the very last race of the year in Brazil.\n\nOther highlights included the return of F1 to America, the return of Kimi Raikkonen and some of the most stunning races of recent years.","torrent":{"xt":"urn:btih:259b95b635c68f0e38f9cb1d7b7fc81098039041","amp;dn":"Official+Formula+1+2012+Season+Review+720p+50fps+F1+ThaiSchumiHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"259b95b635c68f0e38f9cb1d7b7fc81098039041","infoHashBuffer":{"type":"Buffer","data":[37,155,149,182,53,198,143,14,56,249,203,29,123,127,200,16,152,3,144,65]},"announce":[],"urlList":[]}}