{"title":"Petals On The River - Kathleen Woodiwiss.epub","uid":9504568,"size":553990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26543cb769846be62fda2d730354a1e06900f21c&amp;dn=Petals+On+The+River+-+Kathleen+Woodiwiss.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"taylorman","files":1,"time":1390292484,"description":"A proud and spirited woman whose life was stolen from her ... A man of secrets accused of a terrible crime ... In a place of new beginnings their destinies are joined --- in a glorious romantic new work from the incomparable storyteller KATHLEEN E. WOODWISS\n\nThe fiery and outspoken adopted daughter of one of England's most formidable women, Shemaine O'Hearn has made powerful enemies. And now her adversaries have found a way to remove the hot-blooded beauty from her life of privilege: by falsely convicting Shemaine of thievery, and sending her in shackles to America, where she is to be sold in indentured servitude to the highest bidder.\n\nIn a bustling port city in the colony of Virginia, she becomes the servant of Gage Thornton --- a shipbuilder with a young child in need of a nanny. And despite whispered rumors condemning the handsome widower for the untimely death of his wife, Shemaine cannot ignore her desire for this caring, generous and enigmatic stranger who silently aches with his growing need for her --- even as grave peril reaches out from across a vast ocean to threaten their flowering love.","torrent":{"xt":"urn:btih:26543cb769846be62fda2d730354a1e06900f21c","amp;dn":"Petals+On+The+River+-+Kathleen+Woodiwiss.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26543cb769846be62fda2d730354a1e06900f21c","infoHashBuffer":{"type":"Buffer","data":[38,84,60,183,105,132,107,230,47,218,45,115,3,84,161,224,105,0,242,28]},"announce":[],"urlList":[]}}