{"title":"Anime Explosion - The What Why And Wow Of Japanese Animation 201","uid":9531086,"size":5514334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27c2ccfcc8eb33d4e44bf64282ecf3c650a0da64&amp;dn=Anime+Explosion+-+The+What+Why+And+Wow+Of+Japanese+Animation+201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1390847231,"description":"Anime Explosion: The What Why and Wow of Japanese Animation, Revised and Updated Edition by Patrick Drazen\n\n\nFormat: mobi/epub/azw3\nLength: 388 pages\nGenre: Non-Fiction/Comics &amp; Graphic Novels\nDate: 10 January 2014\n\nAn updated look at Japanese cartoons, and the manga that inspired them. New chapters on &quot;Fullmetal Alchemist,&quot; manga/anime by CLAMP, and Satoshi Kon. It brings fans up to date on Studio Ghibli movies after the Academy Award-winning &quot;Spirited Away,&quot; new titles like &quot;Negima&quot; and &quot;Ouran High School Host Club,&quot; and breakthrough same-sex stories &quot;Gravitation&quot; and &quot;Mother Mary is Watching.&quot; \n\nFor fans, culture watchers, and perplexed outsiders, this expanded edition offers an engaging tour of the anime megaverse, from older artistic traditions to the works of modern creators like Hayao Miyazaki, Katsuhiro Otomo, Satoshi Kon, and CLAMP. Examined are all of anime's major themes, styles, and conventions, plus the familiar tropes of giant robots, samurai, furry beasts, high school heroines, and gay/girl/fanboy love. Concluding are fifteen essays on favorite anime, including Evangelion, Escaflowne, Sailor Moon, Patlabor, and Fullmetal Alchemist.\n\nAuthor:\n\nPatrick Drazen has presented at the 2004 Schoolgirls and Mobilesuits, at Yaoi-Con in 2002, at the 2006 Cherry Blossom Festival Anime Marathon at the Freer Gallery of the Smithsonian Institution, and for several years at Anime Central in Chicago. Drazen has an extensive anime collection, from Betamax to DVD, and his presentations have touched on Japanese folklore in modern anime, same-sex relationships, and the fluid nature of heroes and villains in anime.","torrent":{"xt":"urn:btih:27c2ccfcc8eb33d4e44bf64282ecf3c650a0da64","amp;dn":"Anime+Explosion+-+The+What+Why+And+Wow+Of+Japanese+Animation+201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27c2ccfcc8eb33d4e44bf64282ecf3c650a0da64","infoHashBuffer":{"type":"Buffer","data":[39,194,204,252,200,235,51,212,228,75,246,66,130,236,243,198,80,160,218,100]},"announce":[],"urlList":[]}}