{"title":"Vice Squad 1953 DvdRip Mp4 Lee1001","uid":10150619,"size":827522125,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a8514b9ec263502427f3fb99e224c3160d5d145&amp;dn=Vice+Squad+1953+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xultfoad","files":2,"time":1400098693,"description":"Vice Squad 1953 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0046514/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0046514/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Vice_Squad_(1953_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Vice_Squad_(1953_film)&lt;/a&gt;\nVice Squad is an American crime film first released on 31st July 1953, directed by Arnold Laven. The film is based on a novel by Leslie T. White and stars Edward G. Robinson, Paulette Goddard, K.T. Stevens, Porter Hall and Adam Williams. It has also been released under the title: The Girl in Room 17. \n\nAuthor: jotix100 from New York, 3 August 2012\n*** This review may contain spoilers ***\nAn unsuspecting man, Jack Hartrampf, the owner of a funeral parlor, is seen coming out of a tryst with a young woman. Little prepares him for watching from the shadows as two criminals kill a policeman who discovered the pair were up to no good. Jack is of two minds, on the one hand it is his civil duty to report what he saw, on the other, he is a married man who cannot be involved in a scandal. He is taken as a witness, anyhow.\n\nAt the police station the day is starting for Capt. Barnaby, a hard working man facing another tough day at the center of all sorts of police matters needing his attention. The death of one of his men hurts Barmaby as well as enrages him. He knows Jack Hartrampf saw exactly what happened, but he cannot make the man go out of his way to help. With the help of his highly paid lawyer, Hartrampf is released, but Barnaby has a way to get him back as a material witness.\n\nCapt. Barnaby hears from a man being held at the station about a possible robbery at a bank. The criminal has heard on the street this piece of information, which he uses to get out of detention. Barnaby's life is further complicated when Mona Ross, the owner of a &quot;escort service&quot; knows one of the potential bank robbers, one Al Barkis. He uses his leverage in keeping two of her girls to get the woman to cooperate.\n\n&quot;Vice Squad&quot; the MGM release was one of the better B type films of the era, something that was the case of releases that were produces as fillers as double features. Arnold Laven directed this crime drama set in the Los Angeles of the time. The screenplay is by Lawrence Roman, an adaptation of the novel &quot;Harness Bull&quot; written by Leslie White.\n\nAt the time the great Edward G. Robinson was perhaps not the bright star of his early career, but he kept making movies which he made better by his intelligent approach that was his hallmark. He was also a marked man in the era of the Hollywood 'witch hunt'. Mr. Robinson is a pleasure to watch in &quot;Vice Squad&quot;. Here he plays a good man, a far cry for this start in the cinema. He carries the film on the strength of his performance. There are things that will appear as politically incorrect in the way Barnaby torments the poor milquetoast of Hartrampf, something that was not an issue at the time when the film was made. His methods might not have gone according to the book, but he got the results expected of his rank.\n\nPaulette Goddard has the second billing as Mona Ross. Her role is a small one, but she is a welcome presence in the story. The supporting players enhance the picture, especially Porter Hall as Hartrampf. Edward Binns and Lee Van Cleef are the criminals at the heart of the plot; both men give good performances.\n\nJoseph Biroc, a veteran cinematographer gives us a glimpse of different parts of Los Angeles as it looked in those years. The musical score is credited to Herschel Burke Gilbert. &quot;Vice Squad&quot; is one of the best films of the genre thanks to Arnold Laven inspired direction.\n\nVIDEO\nSize.... 789mb\nDuration.... 01:28:08\nCodec.... avc1\nFrame Width..... 712\nFrame Height.... 480\nData Rate.... 1117kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:2a8514b9ec263502427f3fb99e224c3160d5d145","amp;dn":"Vice+Squad+1953+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a8514b9ec263502427f3fb99e224c3160d5d145","infoHashBuffer":{"type":"Buffer","data":[42,133,20,185,236,38,53,2,66,127,63,185,158,34,76,49,96,213,209,69]},"announce":[],"urlList":[]}}