{"title":"The Housemaid's Daughter (2013) Barbara Mutch (multi)","uid":9505987,"size":1453882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c3acde910725d1cc666c8961a06e4153d89f514&amp;dn=The+Housemaid%27s+Daughter+%282013%29+Barbara+Mutch+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7","files":-1,"time":1390318147,"description":"The Housemaid's Daughter by Barbara Mutch\n\n\nFormat: mobi/epub/azw3\nLength: 416 pages\nGenre: Historical Fiction\nDate: 10 December 2013\n\nBarbara Mutch's stunning first novel tells a story of love and duty colliding on the arid plains of Apartheid-era South Africa\n\nCathleen Harrington leaves her home in Ireland in 1919 to travel to South Africa and marry the fiance she has not seen for five years. Isolated and estranged in a harsh landscape, she finds solace in her diary and the friendship of her housemaid's daughter, Ada. Cathleen recognises in her someone she can love and respond to in a way that she cannot with her own husband and daughter. Under Cathleen's tutelage, Ada grows into an accomplished pianist, and a reader who cannot resist turning the pages of the diary, discovering the secrets Cathleen sought to hide.\n\nWhen Ada is compromised and finds she is expecting a mixed-race child, she flees her home, determined to spare Cathleen the knowledge of her betrayal, and the disgrace that would descend upon the family. Scorned within her own community, Ada is forced to carve a life for herself, her child, and her music. But Cathleen still believes in Ada, and risks the constraints of apartheid to search for her and persuade her to return with her daughter. Beyond the cruelty, there is love, hope - and redemption.\n\nAuthor:\n\nBarbara was born and brought up in South Africa, the granddaughter of Irish immigrants who settled in the Karoo in the early 1900s. She went to school in Durban and Port Elizabeth and then graduated from Rhodes University in the Eastern Cape during the height of apartheid\n","torrent":{"xt":"urn:btih:2c3acde910725d1cc666c8961a06e4153d89f514","amp;dn":"The+Housemaid%27s+Daughter+%282013%29+Barbara+Mutch+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c3acde910725d1cc666c8961a06e4153d89f514","infoHashBuffer":{"type":"Buffer","data":[44,58,205,233,16,114,93,28,198,102,200,150,26,6,228,21,61,137,245,20]},"announce":[],"urlList":[]}}