{"title":"Marvel NOW! Week 65/All-New Marvel NOW! Week 8 02/12/2014","uid":9608184,"size":474701989,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2e456bc87003e1516bed6ce124f45ceb9c8fe552&amp;dn=Marvel+NOW%21+Week+65%2FAll-New+Marvel+NOW%21+Week+8+02%2F12%2F2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"yarrrjun","files":13,"time":1392256656,"description":"Hi folks! As per usual, I didn't see a collected torrent for this week's Marvel NOW! titles yet, so I thought I'd upload one. \nIncluded are:\n\n\nAll-New X-Factor #3\nAll-New X-Men #23\nAvengers #26\nDeadpool #23\nSecret Avengers #15\nShe-Hulk #1\nSuperior Spider-Man #27.NOW\nThor, God of Thunder #19.NOW\nThe Winter Soldier: Bitter March #1\nWolverine and the X-Men #41\nX-Force #1\nX-Men Legacy #24\n\nRevolutionary War: Death's Head II #1\nPart 4 of &quot;Revolutionary War&quot;\n* The long-awaited return of DEATH'S HEAD -- one of the biggest hits of the original Marvel UK!\n* Death's Head! Death's Head II! On an adventure together for the first time EVER!\n* What threat could be grave enough to bring these two heroes together from across time? How about the villainous Mys-Tech organization resurfacing with an army?!\n\n\nIf you like them and have the money, BUY THEM and support your favorite creators, writers, artists, local comic shops and publishers. \n\nSeriously, buy the comics you have money for. But only the ones you think deserve your money-- vote with your dollars, and also make your voices heard. Marvel has a pretty good internet presence, which also means they read emails, tweets, tumblr responses, facebook comments. They've shown that they are solely focused on sales numbers-- vote with yr money, and tell them with words (not curses). They WILL listen, eventually. You know-- the internets.\n\nAll my thanks to all the uploaders and scanners and seeders out there! Enjoy! (and seed!)\n\nPersonal commentary of the week: all these years I was complaining that winters never really got cold anymore, and now we're drowning in snow. That's cool (hah!) but what's not cool is being SO SICK like I haven't been in years. More importantly, we are well into the All-New Marvel NOW! days, with the final issue of Wolverine and the X-Men upon us. Aw. Awww. It's a very cute cover, too. What else is exciting? The Winter Soldier: Bitter March! The art's very cool, and so is the story so far. I'm digging it (because the Winter Soldier is such a great mashup of pulp military/science/espionage fiction). And Revolutionary War is continuing that trend, with Death's Head and Death's Head II uniting to fight Mys-Tech's magical science clones... it's the best kind of madness. Enjoy the week!","torrent":{"xt":"urn:btih:2e456bc87003e1516bed6ce124f45ceb9c8fe552","amp;dn":"Marvel+NOW%21+Week+65%2FAll-New+Marvel+NOW%21+Week+8+02%2F12%2F2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e456bc87003e1516bed6ce124f45ceb9c8fe552","infoHashBuffer":{"type":"Buffer","data":[46,69,107,200,112,3,225,81,107,237,108,225,36,244,92,235,156,143,229,82]},"announce":[],"urlList":[]}}