{"title":"Knife in the Water - Plays One Sound and Others [1998]  [EAC/FLA","uid":10280734,"size":276551536,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2f2d898ce5c89e9163a9180acfe65500d640147b&amp;dn=Knife+in+the+Water+-+Plays+One+Sound+and+Others+%5B1998%5D++%5BEAC%2FFLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":13,"time":1401692666,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Glitterhouse Records #807412\nCountry: USA\nYear: September 6, 1999\nGenre: Americana\nFormat: CD,Album\n\n\n\n1. One Sound\n2. Swallows\n3. Seat of Pity\n4. Married Woman\n5. Norma\n6. Come on Cotton\n7. Sent You Up\n8. Muse\n9. Careening\n\n\n\n\nThe debut album from Texas quintet Knife in the Water, a name appropriately borrowed from a psychological thriller from filmmaker Roman Polanski, opens with Laura Krause's lovely Hammond organ. It could almost be construed as a celebratory sound until Aaron Blount's disinterested, somnambulant vocals enter singing &quot;I want to fall right back to sleep/to dive back in the sheets.&quot; Though, instead of one long, funereal downer, Plays One Sound and Others is a moody piece of lo-fi, gothic country-psychedelia, both stately and mysterious, suffocating and spacious. Part country, part space-rock, part lazily dismissive, part perfectly in the moment, everything about the album works. They undercut the stereotypical pathos of country by letting their sometimes unpleasant thoughts seep into the music, but they nevertheless tug at your heartstrings with their honesty. Blount's lyrics are terrific, if disturbing, and he sings them with such a sympathetic delivery that, as hard as they are to reconcile with any notion of commiseration, you want to be on his side. On &quot;I Sent You Up,&quot; for instance, the narrator sings about killing his now dead lover (&quot;So I cut you into pieces/And I threw you in the river/Now the fishes they all curse me/For the poison I deliver&quot;), but his pain at the wrong he feels has been done to him is so tangible that you can't help but want to feel sorry for him. Every song on the album balances the same degree of passion and pain, emotional directness and matter-of-fact ugliness of action. Knife in the Water harbor no illusions of grandeur and feel deeply the real emotions about which they sing, even if they are conveyed by the voices of indistinct narrators. As Blount croons on the final &quot;Careening,&quot; Plays One Sound and Others is &quot;awful and sweet both at once,&quot; and the music itself is &quot;one vast disembodied thought.&quot;","torrent":{"xt":"urn:btih:2f2d898ce5c89e9163a9180acfe65500d640147b","amp;dn":"Knife+in+the+Water+-+Plays+One+Sound+and+Others+%5B1998%5D++%5BEAC%2FFLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f2d898ce5c89e9163a9180acfe65500d640147b","infoHashBuffer":{"type":"Buffer","data":[47,45,137,140,229,200,158,145,99,169,24,10,207,230,85,0,214,64,20,123]},"announce":[],"urlList":[]}}