{"title":"Cause &amp; Effect - Trip [1994]","uid":9544413,"size":332808612,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2fdb64e514581f9c1a6b12511cc0070db43be453&amp;dn=Cause+%26amp%3B+Effect+-+Trip+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391102320,"description":"Review by Ned Raggett  [-]\nComing back from the unexpected death of Sean Rowley was a big hurdle to begin with, but with Keith Milo's help on synths to flesh out the trio back to its full strength, Cause &amp; Effect soldiered on with Trip, understandably dedicated to the deceased keyboardist. Released as it was in 1994 and near completely out of sync with the prevailing grunge/G-funk trends of popular music, Trip is noteworthy for holding its own ground with style. Cause &amp; Effect didn't see the need to bend to the whims of fashion and the result is quite entertaining. Lead single &quot;It's Over Now&quot; made for a great opening, the blend of emotive synths and anthemic guitars and drums a near-perfect distillation of many new wave heights. With the formula established, the trio essentially offered up a number of variations on the same for Trip, yet such is the quality of the atmosphere and pace established that the group avoids pointless repetition. Rowe's singing, if perhaps a touch too formally indebted to the restrained-yet-soaring style of any number of Euro-inclined early-'80s acts, not to mention older sources such as Bryan Ferry, still works very nicely. Perhaps unsurprisingly, the clearest models are Depeche Mode singers David Gahan and Martin Gore, given the appropriately heated and passionate-with-a-capital-P lyrics about love, lust, religion, and so forth. &quot;In Shakespeare's Garden&quot; and &quot;Soul Search&quot; (opening line: &quot;I took a drink of holy water&quot;) are just two examples of many, but what can read as a bit much in print often sounds just right with the busy but not over-cluttered arrangements. Musical references and hints are everywhere -- there's a touch of New Order on &quot;You Are the One,&quot; for instance -- but if Cause &amp; Effect isn't a truly great band, it's a very good one. (3/5)","torrent":{"xt":"urn:btih:2fdb64e514581f9c1a6b12511cc0070db43be453","amp;dn":"Cause+%26amp%3B+Effect+-+Trip+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fdb64e514581f9c1a6b12511cc0070db43be453","infoHashBuffer":{"type":"Buffer","data":[47,219,100,229,20,88,31,156,26,107,18,81,28,192,7,13,180,59,228,83]},"announce":[],"urlList":[]}}