{"title":"Queen THE MAGIC YEARS VOLUME 3 DVD","uid":10219687,"size":2541891584,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:31c31a96dd45816a3a816cc6ad8688d6b263f2af&amp;dn=Queen+THE+MAGIC+YEARS+VOLUME+3+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pishflakes","files":8,"time":1401023939,"description":"MAGIC YEARS - is the ultimate story of one of the world's biggest rock bands, an action packed ride through the 16 year history of a four-piece who've stayed together to become bigger today than ever before. &quot;MAGIC YEARS&quot; is the first major group history to involve pop's aristocracy, whose contributions and comments about the band are interspersed with amazing archive film of the earliest milestones in QUEEN'S development. With the aid of comprehensive and candid footage of live with QUEEN - shot over the years exclusively for this project - &quot;MAGIC YEARS&quot; peels back the security barriers to give you a backstage view of the madness, myth and magic we call rock 'n' roll. Uncovering the group's private side (plus a few failed out-takes from their acclaimed videos) &quot;MAGIC YEARS&quot; is the most complete visual anthology a rock band has ever had, attacking its subject with a journalistic and entertaining spirit as ambitious as the band itself. &quot;MAGIC YEARS&quot; records impressions all around the world of life in a rock band, the personal doubt, the public triumph and everything else that makes up the magic that is QUEEN. This 3-DVD set is broke into 3 volumes","torrent":{"xt":"urn:btih:31c31a96dd45816a3a816cc6ad8688d6b263f2af","amp;dn":"Queen+THE+MAGIC+YEARS+VOLUME+3+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31c31a96dd45816a3a816cc6ad8688d6b263f2af","infoHashBuffer":{"type":"Buffer","data":[49,195,26,150,221,69,129,106,58,129,108,198,173,134,136,214,178,99,242,175]},"announce":[],"urlList":[]}}