{"title":"Fountains of Wayne - Traffic and Weather [2007]","uid":9575725,"size":359683351,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31fbceb417b0f186772fcb529cea89397f1eb9f8&amp;dn=Fountains+of+Wayne+-+Traffic+and+Weather+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391700405,"description":"Review by Stephen Thomas Erlewine  [-]\nFountains of Wayne finally managed to score that big hit single their fans always knew they had in them when &quot;Stacy's Mom&quot; became a fluke hit a few months after the release of their third album, 2003's Welcome Interstate Mangers. Anybody worried that success had spoiled the power pop quartet shouldn't find their long-awaited fourth album, Traffic and Weather -- its title song a nifty ploy to get drive-time radio plugs, but also fitting right into the Jersey roadside themes of the titles -- a disappointment, nor should it offer much in way of surprises. Perhaps the slight traces of a disco-rock beat on the opening track/lead single, &quot;Someone to Love,&quot; shows some evidence of copping to modern trends, but Fountains of Wayne still remain devotees of classic pop -- usually guitar-driven power pop, but they'll spike that with some Bacharach horns or country-rock if the mood strikes them. If the sound is unabashedly, even defiantly classicist, that's balanced by Adam Schlesinger's obsession with chronicling the weird incidental byroads of modern America in his lyrics. He packs odd, telling details into each of his songs, whether it's how the disaffected, lonely photo retoucher in &quot;Someone to Love&quot; spends her Thursdays watching King of Queens or how the jealous narrator in &quot;This Better Be Good&quot; notices the light blue Dockers on the guy who is holding the hand of his girlfriend. Even if they're often used in the service of joke setups or punch lines, such details give the songs weight and help Fountains of Wayne seem contemporary when their music is grounded in the '60s and '70s and could have been released anytime in the last 20 years; the dance beats underpinning the title song sound like new wave, while the synths and phased vocals on the quite wonderful on-the-run-from-loan-sharks tale &quot;Strapped for Cash&quot; brings to mind early-'80s AOR (a fact underscored by the &quot;heart attack-ack-ack-ack&quot; reference to Billy Joel's &quot;Movin' Out&quot;). Such lyrical and musical flourishes keep Traffic and Weather from sounding too similar to previous FOW platters, but there is something missing here: a truly knockout single, along the lines of &quot;Radiation Vibe,&quot; &quot;Stacey's Mom,&quot; or even &quot;Maureen&quot; from their B-sides comp, Out of State Plates (or for that matter, &quot;Pop Goes My Heart,&quot; the Schlesinger-written Wham! homage for Music and Lyrics that was on the charts at the time of the release of Traffic and Weather). It's sturdy, well-written power pop, but it falls prey to some of the faults of craftsmanlike pop -- mainly, it's possible to hear the craft behind the pop instead of just getting sucked into the sugar rush of the melodies. Even so, Traffic and Weather is hardly a bad record, and should satisfy anyone who has loved Fountains of Wayne before, even if it doesn't quite excite them. (3/5)","torrent":{"xt":"urn:btih:31fbceb417b0f186772fcb529cea89397f1eb9f8","amp;dn":"Fountains+of+Wayne+-+Traffic+and+Weather+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31fbceb417b0f186772fcb529cea89397f1eb9f8","infoHashBuffer":{"type":"Buffer","data":[49,251,206,180,23,176,241,134,119,47,203,82,156,234,137,57,127,30,185,248]},"announce":[],"urlList":[]}}