{"title":"True Interracial Whores #6 - Interracial Porn XXX","uid":9551632,"size":3368119538,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:32592931f461e9527b5975b4b8a478d4c78984ca&amp;dn=True+Interracial+Whores+%236+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"KidAtomic","files":-1,"time":1391277340,"description":"True Interracial Whores #6\n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX&lt;/a&gt;\n\nCompany: Blacks On Blondes\nSeries: True Interracial Whores\nMedia Format: DVD (Fullscreen)\nDirector: N/A\nGenre: Gonzo / Interracial\nLength: 173 Min ( 2 hr 53 min )\n\nFemale Cast: Sophia, Spring Thomas\n\nMale Cast: Jean-Claude Batiste, Jr. King, Mandingo, Richard Mann, Shane Diesel\t\nBig Wet Asses!\n\nPure POV!\n\nClub Julia Bond\t\nCondom use: None\n\nScene 1: Spring Thomas, Richard Mann\nThemes: Interracial, M to F Rimming, Anal\nScene Rating: 7/10\nScene Breakdown: Spring is a very cute girl with medium length blonde hair and natural D cup tits. While lying on a bed, the camera rolls over Spring's body, then she rolls over onto her back and begins playing with a dildo in her pussy. &quot;Would you rather watch me suck and fuck a big black cock and have it cream inside me?&quot;, she asks the camera before Richard comes in. She sucks it to start, giving a very lengthy BJ before climbing up on top of him and stuffing his oversized cock inside her. She spins around for some reverse cowgirl too, then we cut to Spring on her side/back. Over in doggy, Spring takes the meat in her pussy for a bit as Richard really pounds it, then lies on her belly as he tries to work his stick in her ass. Unfortunately though he had a difficult time keeping his cock hard, having to hold it almost the entire time while he's attempting to fuck her ass. Back in missionary, Spring tells us &quot;I'm going to get a black cream pie as you guys watch&quot;. Just before he's about to cum she spouts off &quot;Wanna be my babies daddy?&quot;, at which point Richard gets freaked out (I presume..) and pulls out, giving her pussy a small load on it, versus in it... Probably a good decision though because I'm pretty certain she wouldn't have been able to squeeze any of it out. There was just too little of a load... Regardless, a pretty solid start to the movie. I was impressed with how deep Spring took Richard's meat and she looked to enjoy it. Her calling him the &quot;N word&quot; got distracting at times though...\n\nScene 2: Spring Thomas, Shane Diesel, a guy\nThemes: Interracial, Anal\nScene Rating: 6/10\nScene Breakdown: Spring shows up while Shane and the guy are shooting pool, but soon she's showing them how she can handle their sticks at the same time . Getting up on a pool table, the guy starts fucking her in doggy as she keeps working Shane with her mouth, then she flips over on her back as the guys take turns filling her mouth and pussy with cock. Over on her side, Shane gives her that overly thick cock of his, then we cut to her back in doggy. Apparently Shane's too big for her ass, so the other guy fucks it. &quot;My ass is going to make you cum!&quot;, Spring says, but he never cums from that... So to wrap things up, Spring's on her knees as each guy jerks off onto her face and it was very apparent Spring didn't like cum in her mouth. Outside of a few moments here and there, the scene felt pretty flat. There seemed to be no real connection between Spring and the guys at all.\n\nScene 3: Spring Thomas, Jean-Claude Batiste\nThemes: Deep Throat, Interracial\nScene Rating: 7.5/10\nScene Breakdown: Right from the start Spring and Jean seem to instantly hit it off, doing some very sexy kissing and such and they get acquainted. Eventually she makes it down to her knees to worship his cock, doing some decent deep throat action. Bending her over a stool, Jean takes her from behind, then as her clean his cock off before taking her up to flying cowgirl. Setting her down, he keeps going at Spring's pussy while she's on her back. She stops the action for a bit of break, then takes her try at riding it in regular and reverse cowgirl. Some nice shots were captured along the way, then Jean takes Spring back up in the air, the time in reverse cowgirl. Much like last time, he sets her down (doggy) and pounds her pussy good until he's ready to cum. When he delivers his load, she pushes the cum from her mouth and Jean makes sure we know how good she is, telling the camera, &quot;She's got good white pussy! I still want to fuck her!&quot;. And he does, bending her over and fucking her standing doggy while her face still covered in cum. We watch as he goes at it a minute or two, then the scene fades without a second facial. A solid scene here, and what made it so nice was Spring's apparent connection to Jean.\n\nScene 4: Spring Thomas, Jr. King\nThemes: M to F Rimming, Interracial\nScene Rating: 7/10\nScene Breakdown: Spring is making faces at the camera, being cute, then she shows us her &quot;white boy cage&quot;. She then brings in the occupant (a member of her site, she says) of the cage, verbally degrading him before bringing in Jr. She forces him to watch, as she gets her ass eaten and then sucks on his cock, because she only sucks &quot;black dick&quot;. Oddly, after a cut, Jr. and Spring are on top of the cage with him fucking her in doggy. I wondered why they weren't on the floor to show the guy what Spring was doing and what he wasn't getting? Regardless, there's eventually a cut and the guy's gone, apparently he felt too degraded and was complaining. We never seen any of this and I think it could have been some funny footage. They could have blurred his face out or something. Back up on top of the cage, Jr. gets back to bangin' her in doggy before rolling her to spoon. After a little PTM action Spring rides in reverse and regular cowgirl, which afforded us some great shots of Spring's puffy pussy around Jr's cock. Getting off, Jr. lays on the cage and jerks off as Spring pays attention to his balls, sucking and licking on them, until he cums. He tries to cum in her mouth but it doesn't make it, it just ends up all over his hand. Spring then cleans up the mess and plays with it, never swallowing it, but doing some nice cum play. A big change from the previous scene with her less than enthusiastic appreciation for cum... The whole guy thing at the beginning was a distracting from the first moment, but the scene ended up pretty decent. Spring and Jr. clicked pretty decently.\n\nScene 5: Spring Thomas, Mandingo\nThemes: F to M Rimming, Interracial\nScene Rating: 6.5/10\nScene Breakdown: Spring says she's going to bring in &quot;The Mandingo&quot;, telling us he's measured at a solid 15&quot;! Once in the scene, she starts sucking on his massively long dick, and also eats his ass, then lies back for him to eat and fuck her pussy. He managed to get himself half way in her, then she flipped over to doggy and apparently she opened up some because he got all the way in her! Up in cowgirl, Spring rides nicely, then rides reverse for a bit as well. With her head off the edge of the bed, Mandingo jerks off onto her face, cumming across her mouth and &quot;gluing&quot; her mouth shut. Surprisingly Spring took Mandingo's extremely long cock very well, but she never really seemed to be all that into him. She sure looked good gettin' impaled on that cock though.\n\nScene 6: Spring Thomas, Sophia, Jr. King, , and\nThemes: Interracial, Girl/Girl, Cum Kissing, Foot Play\nScene Rating: 5.5/10\nScene Breakdown: Sophia as a sexy girl with medium length blonde hair and fake D cup tits. So Spring kicks things off with being very upset about not having a black cock inside her. So she calls Jr. to fill her knees. When he shows up she gets his cock in her mouth, then Sophia shows up with a white &quot;bitch boy&quot;. At this point my immediate thought is &quot;I hope this don't turn out like the last scene...&quot;. Anyway, they berate him and measure his cock to Jr's, then both get to working on Jr.s &quot;real dick&quot;. With in doggy, she gets the cock while Sophia and the guy watch, but Sophia does some PTOGM action. Spring flips over and both Sophia and Jr. eat her pussy (I found this really hot!!), then Jr/ gets back in there, pumping her pussy. Moving the action over to the couch, the guy gets a closer look at the action while Jr. fucks Spring while Sophia does more PTOGM and gets fingered. Finally, when it's time to cum, Jr. dumps on Sophia's foot and Spring's mouth at the same time. She laps at the cum, enough to get some on her tongue and mouth, then Sophia gives her some kisses before making the guy jerk off while they berate him some more. He goes on himself and of course gets made fun of, but then to show how much better he is, Jr. comes back into the scene and gives the girls another cumshot to their mouths. Another scene were none of the participants were really into it. When I seen Spring with Jr. again I was hoping for another scene like the other one they were in earlier together, but they brought in Sophia (who wasn't very involved at all) and the guy. Unfortunately all this added up to one big distraction in my opinion. \n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX&lt;/a&gt;","torrent":{"xt":"urn:btih:32592931f461e9527b5975b4b8a478d4c78984ca","amp;dn":"True+Interracial+Whores+%236+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32592931f461e9527b5975b4b8a478d4c78984ca","infoHashBuffer":{"type":"Buffer","data":[50,89,41,49,244,97,233,82,123,89,117,180,184,164,120,212,199,137,132,202]},"announce":[],"urlList":[]}}