{"title":"Chasing Maria Menounos - Complete Season 1 [.mp4]","uid":10198601,"size":1867388775,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:333d367f093e9d60276d03931e71ba91d7f37825&amp;dn=Chasing+Maria+Menounos+-+Complete+Season+1+%5B.mp4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"benbrown1","files":10,"time":1400730503,"description":"The complete first season of Oxygen's Chasing Maria Menounos!\n\nEpisode 1: Tick, Tock Biological Clock - Maria celebrates her birthday with a star-studded bash.\n\nEpisode 2: Mother-In-Law Knows Best - Maria and Keven promote their film, &quot;Serial Buddies&quot;, but Keven's mother feels that Maria is stealing the spotlight.\n\nEpisode 3: A Nice Greek Boy - Costas tries to persuade Keven into converting to Greek Orthodox, but Keven is concerned that the change would be seen as a betrayal by his mother. And Maria deals with a newly-discovered medical matter.\n\nEpisode 4: Back To My Roots - Maria and Keven return to their hometown of Boston and inform Keven's mother that he is converting to Greek Orthodox. And Maria and Keven visit an old friend.\n\nEpisode 5: Overbudget and Underspermed - Keven visits the fertility doctor. Plus Maria and Keven argue when she discovers he's been spending money that she's saved.\n\nEpisode 6: Party Pooper - Keven throws a party and upsets Maria by inviting too many guests.\n\nEpisode 7: Does Maria Not Like Me? - Maria invites Keven's mother Kathie to their home to help strengthen their relationship, but an eruption from Costas and a few wrong moves by Maria threaten to drive her further away. Also, Maria and Keven receive news from the fertility doctor.\n\nEpisode 8: Family Smackdown - Maria is invited to wrestle at SummerSlam, and she jumps at the opportunity; but when her family and boss disagree with the decision, life gets difficult. Also, Keven's refusal to fix their fertility issue takes toll on their relationship.\n\nEpisode 9: Costas Down - When Costas suffers a frightening diabetic attack the family comes together to hold a health intervention.\n\nEpisode 10: It's Good To Be Greek - Costas stirs up drama at Keven's conversion ceremony in the Season 1 finale. Also: Maria and Keven must make a big decision about having children. ","torrent":{"xt":"urn:btih:333d367f093e9d60276d03931e71ba91d7f37825","amp;dn":"Chasing+Maria+Menounos+-+Complete+Season+1+%5B.mp4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"333d367f093e9d60276d03931e71ba91d7f37825","infoHashBuffer":{"type":"Buffer","data":[51,61,54,127,9,62,157,96,39,109,3,147,30,113,186,145,215,243,120,37]},"announce":[],"urlList":[]}}