{"title":"Total War ROME II Update 9 Incl DLC-RELOADED","uid":9570097,"size":550413694,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:34ec0a33dffafab9adda915c44f8034059e25539&amp;dn=Total+War+ROME+II+Update+9+Incl+DLC-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"NewSky005","files":42,"time":1391614133,"description":"nERv\n\nTotal War: Rome II Update 9 Incl DLC (c) Sega\n02/2014: RELEASE.DATE .. PROTECTION: Steam+CEG+Updates: DISC(S) .. GAME.TYPE: Strategy\n\nSpecial note:\n\nWith this update we patch existing files as the updated files take up over\n12GB. For this reason, it's very important that you use it on our untouched\nrelease Total.War.ROME.II.Caesar.in.Gaul-RELOADED or with\nTotal.War.ROME.II.Update.8.1.Incl.DLC-RELOADED applied with crack added to\ninstall dir in both case\n\nThis release includes the following DLC:\nGreek States Culture Pack\nNomadic Tribes Culture Pack\nBaktria Faction Pack\nSeleucid Empire Faction Pack\nBlood &amp; Gore\nCaesar in Gaul\n\nChangelist included in the pack as always. Enjoy!\n\nHow far will you go for Rome?\n\nThe award-winning Total War series returns to Rome, setting a brand new\nquality benchmark for Strategy gaming. Become the world's first superpower\nand command the Ancient world's most incredible war machine. Dominate your\nenemies by military, economic and political means. Your ascension will bring\nboth admiration and jealousy, even from your closest allies\n\nWill you suffer betrayal or will you be the first to turn on old friends?\nWill you fight to save the Republic, or plot to rule alone as Emperor?\n\nKey Features\n\n* Plan your conquest of the known world in a massive sandbox turn-based\ncampaign mode (supporting additional 2-player cooperative &amp; competitive\nmodes). Conspiracies, politics, intrigue, revolts, loyalty, honour\nambition, betrayal. Your decisions will write your own story\n* Build vast armies and take to the battlefield in real-time combat mode\nPut your tactical skills to the test as you directly control tens of\nthousands of men clashing in epic land and sea battles\n* Play for the glory of Rome as one of three families or take command of a\nhuge variety of rival civilisations - each offers a notably different form\nof gameplay experience with hundreds of unique units from siege engines\nand heavy cavalry to steel-plated legionaries and barbarian berserkers\n* See exotic ancient cities and colossal armies rendered in incredible\ndetail, as jaw-dropping battles unfold. Detailed camera perspectives allow\nyou to see your men shout in victory or scream in pain on the frontline\nwhile a new tactical cam allows a god's eye view of the carnage to better\ninform your strategic decisions\n* Extremely scalable experience, with gameplay and graphics performance\noptimised to match low and high-end hardware alike\n------------------------------------\nNotes\n------------------------------------\n1. Unrar\n2. Use the patcher to patch the install dir of\nTotal.War.ROME.II.Caesar.in.Gaul-RELOADED with crack added\nTotal.War.ROME.II.Caesar.in.Gaul/Update.8.1.Incl.DLC-RELOADED with crack\nadded\nCopy the patch into game install dir and run it\nYou will need ~12gb free space to do this\n3. Copy over the cracked content from the /Crack directory to your game\ninstall directory\n4. Play the game\n5. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:34ec0a33dffafab9adda915c44f8034059e25539","amp;dn":"Total+War+ROME+II+Update+9+Incl+DLC-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34ec0a33dffafab9adda915c44f8034059e25539","infoHashBuffer":{"type":"Buffer","data":[52,236,10,51,223,250,250,185,173,218,145,92,68,248,3,64,89,226,85,57]},"announce":[],"urlList":[]}}