{"title":"Jim Sillars - In Place of Fear II.azw","uid":9525497,"size":160104,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37d8dd99487afaef446a2f4f4b816ce2ccb562fd&amp;dn=Jim+Sillars+-+In+Place+of+Fear+II.azw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1390745400,"description":"Jim Sillars argues convincingly that the referendum gives the Scottish people the power to create a better country, helps renew our belief in socialism as the answer to the economic and social crisis facing the country, and challenges the idea in the Yes campaign that independence means &quot;change but no change&quot; and that a Yes voter endorses Alex Salmond and the SNP. There is a far more radical road, with better policies than those Salmond is offering in the first independence elections in 2016. This book demonstrates what the Labour party has been keen to hide: that socialist ideas in Scotland have always been obstructed by the London connection. Independence is not only for Scotland, but for the Labour party too, and for socialists within it. Independence will strengthen the position of working people and their families, and remove fear from their lives. The recession has devastated the lives of thousands of Scots, among them 250,000 children mired in poverty. This book explains how a socialist government in Scotland can make our country a better place for the young, old and disabled in a world of global capitalism. It destroys the argument that nothing can be done against transnational companies, and demonstrates what can be done through the use of state political power to transform the lives of our children and those who have to sell their labour. This book is idealism with its feet on the ground. ","torrent":{"xt":"urn:btih:37d8dd99487afaef446a2f4f4b816ce2ccb562fd","amp;dn":"Jim+Sillars+-+In+Place+of+Fear+II.azw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d8dd99487afaef446a2f4f4b816ce2ccb562fd","infoHashBuffer":{"type":"Buffer","data":[55,216,221,153,72,122,250,239,68,106,47,79,75,129,108,226,204,181,98,253]},"announce":[],"urlList":[]}}