{"title":"Cris Williamson - The Changer and the Changed","uid":10373115,"size":235984573,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3824d3dc68841203ddde263178ed68150b505b3e&amp;dn=Cris+Williamson+-+The+Changer+and+the+Changed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FFlintston","files":12,"time":1402960279,"description":"Cris Williamson's The Changer and the Changed (1975) was one of the best-selling independent releases of all time, and a true surprise hit, selling far beyond the perceived size of the &quot;women's music&quot; market. Reportedly, more than 500,000 copies of the album have been sold, which would make it a gold album, although it has not been certified as such by the RIAA.\n\nMore than simply the best-selling album on the stalwart Olivia Records label and a classic of the women's music subgenre, The Changer and the Changed is a brilliant '70s singer/songwriter album. The simple but rich arrangements set Williamson's glorious voice and piano against strings, flute, and Jacqueline Robbins' jazz-inflected fretless bass, giving the album a timeless sound and putting the focus entirely on the songs and Williamson's elegantly passionate performance of them. All ten songs are sublime, though the opening &quot;Waterfall,&quot; featuring some sterling Fender Rhodes work by Williamson, and the solo piano ballad &quot;One of the Light&quot; are the clear highlights.","torrent":{"xt":"urn:btih:3824d3dc68841203ddde263178ed68150b505b3e","amp;dn":"Cris+Williamson+-+The+Changer+and+the+Changed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3824d3dc68841203ddde263178ed68150b505b3e","infoHashBuffer":{"type":"Buffer","data":[56,36,211,220,104,132,18,3,221,222,38,49,120,237,104,21,11,80,91,62]},"announce":[],"urlList":[]}}