{"title":"Expeditie Poolcirkel Aflevering 9 NL [20140522].mp4","uid":10208467,"size":837002231,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3afe9d55f97c395c7d6e3f65e9df444eefdd81ad&amp;dn=Expeditie+Poolcirkel+Aflevering+9+NL+%5B20140522%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jblenk","files":1,"time":1400885512,"description":"Aflevering 9 2014\n\nIn Expeditie Poolcirkel namen tien Bekende Nederlanders het, onder barre omstandigheden, tegen elkaar, zichzelf en de ijskoude elementen op. \nHet programma speelde zich af in de koudste gebieden langs de poolcirkel en werd gepresenteerd door Lauren Verster.\n \nDe karavaan met de deelnemers trok door Noorwegen, Zweden en Finland. Vertrekpunt was de ruige kust van het mythische Spitsbergen. HeliÎ“Ã‡Ã–s, boten en sneeuwscooters waren transportmiddelen die werden gebruikt, maar de hoge bergen, adembenemende gletsjers, ijskoude grotten en kolkende rivieren vroegen constant het uiterste van de Bekende Nederlanders.\n\nNiet alleen fysieke kracht was van belang, ook psychologie en strategie speelden een belangrijke rol. Naast individuele proeven, vaak gerelateerd aan de lokale gebruiken en cultuur van Lapland, waren er ook groepsopdrachten. Zowel de individuele prestaties als het teamspel bepaalden elke week de positie van de kandidaten op de ranglijst. Die ranglijst kon in elke aflevering flink wijzigen. Elke aflevering moesten de twee laagst gepositioneerde deelnemers tegen elkaar uitmaken wie de avonturenreeks moest verlaten. Uiteindelijk bereikten slechts twee kandidaten na een barre tocht van twintig dagen het eindpunt en slechts een van hen won uiteindelijk Expeditie Poolcirkel.\n","torrent":{"xt":"urn:btih:3afe9d55f97c395c7d6e3f65e9df444eefdd81ad","amp;dn":"Expeditie+Poolcirkel+Aflevering+9+NL+%5B20140522%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3afe9d55f97c395c7d6e3f65e9df444eefdd81ad","infoHashBuffer":{"type":"Buffer","data":[58,254,157,85,249,124,57,92,125,110,63,101,233,223,68,78,239,221,129,173]},"announce":[],"urlList":[]}}