{"title":"Alice Adams (1935) DVD5 - Katherine Hepburn-Fred MacMurray [DDR]","uid":9593405,"size":4318988288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3c80a94e517dd76d0074f93c7c38d08974306135&amp;dn=Alice+Adams+%281935%29+DVD5+-+Katherine+Hepburn-Fred+MacMurray+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1391960499,"description":"Alice Adams (1935) DVD5 - Katherine Hepburn-Fred MacMurray [DDR]\n\nAlice Adams is a 1935 romantic film made by RKO. It was directed by George Stevens and produced by Pandro S. Berman. The screenplay was by Dorothy Yost, Mortimer Offner, and Jane Murfin. The film was adapted from the novel Alice Adams, by Booth Tarkington. The music score was by Max Steiner and Roy Webb, and the cinematography by Robert De Grasse.\n\nThe film is about a young woman in a medium-sized town in the United States in the early 1900s, and her pretentious attempts to appear upper-class and wed a wealthy man while concealing her poverty. It stars Katharine Hepburn, Fred MacMurray, Fred Stone and Evelyn Venable. Hepburn's popularity had declined after her Oscar-winning performance in 1933's Morning Glory; her performance in Alice Adams made her a public favorite again\n\n    CAST:-\n    Katharine Hepburn as Alice Adams\n    Fred MacMurray as Arthur Russell\n    Fred Stone as Mr. Adams\n    Evelyn Venable as Mildred Palmer\n    Frank Albertson as Walter Adams\n    Ann Shoemaker as Mrs. Adams\n    Charles Grapewin as Mr. Lamb\n    Grady Sutton as Frank Dowling\n    Hedda Hopper as Mrs. Palmer\n    Hattie McDaniel as Malena\n    Jonathan Hale as Mr. Palmer\n    Janet McLeod as Henrietta Lamb\n    Virginia Howell as Mrs. Dowling\n    Zeffie Tilbury as Mrs. Dresser\n    Ella McKenzie as Ella Dowling\n\nDirected by George Stevens\nProduced by Pandro S. Berman\nWritten by Dorothy Yost, Mortimer Offner, and Jane Murfin\nMusic by Max Steiner and Roy Webb\nRunning time 99 minutes\n\nMOVIE REVIEW:- Alice Adams (1935)\nAlice Adams (Katharine Hepburn) is the youngest daughter of the Adams family. Her father (Fred Stone) is an invalid who used to work in Mr. Lamb's factory as a clerk. Her mother (Ann Shoemaker) is embittered by her husband's lack of ambition and upset by the snubs her daughter endures because of their poverty. Alice's older brother, Walter (Frank Albertson), is a gambler who cannot hold a job and who associates with African Americans (which, given the time period in which the film is set, is considered a major social embarrassment). As the film begins, Alice attends a dance given by the wealthy Henrietta Lamb (Janet McLeod). She has no date, and is escorted to the occasion by Walter. Alice is a social climber like her mother, and engages in socially inappropriate behavior and conversation in an attempt to impress others. At the dance, Alice meets wealthy Arthur Russell (Fred MacMurray), who is charmed by her despite her poverty.\n\nAlice's father is employed as a clerk in a factory owned by Mr. Lamb (Charles Grapewin), who has kept Adams on salary for years despite his lengthy illness. Alice's mother nags her husband into quitting his job and pouring his life savings into a glue factory. Mr. Lamb ostracizes Mr. Adams from society, believing that Adams stole the glue formula from him. Alice is the subject of cruel town gossip, which Russell ignores.\n\nAlice invites Russell to the Adams home for a fancy meal. She and her mother put on airs, the entire family dresses inappropriately in formal wear despite the hot summer night, and the Adamses pretend that they eat caviar and fancy, rich-tasting food all the time. The dinner is ruined by the slovenly behavior and poor cooking skills of the maid the Adamses have hired for the occasion, Malena (Hattie McDaniel). Mr. Adams unwittingly embarrasses Alice by exposing the many lies she has told Russell. When Walter shows up with bad financial news, Alice gently expels Russell from the house now that everything is &quot;ruined&quot;.\n\nWalter reveals that &quot;a friend&quot; has gambling debts, and that he stole $150 from Mr. Lamb to cover them. Mr. Adams decides to take out a loan against his new factory to save Walter from jail. Just then, Mr. Lamb appears at the Adams house. He accuses Adams of stealing the glue formula from him, and declares his intention to ruin Adams by building a glue factory directly across the street from the Adams plant. The men argue violently, but their friendship is saved when Alice confesses that her parents took the glue formula only so she could have a better life and some social status. Lamb and Adams reconcile, and Lamb indicates he will not prosecute Walter.\n\nAlice wanders out onto the porch, where Russell has been waiting for her. He confesses his love for her, despite her poverty and family problems.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 99 mins\nSubtitles: Francais, Espanol\nRipped by: Trinidad [DDR]\nDuration: 99 mins","torrent":{"xt":"urn:btih:3c80a94e517dd76d0074f93c7c38d08974306135","amp;dn":"Alice+Adams+%281935%29+DVD5+-+Katherine+Hepburn-Fred+MacMurray+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c80a94e517dd76d0074f93c7c38d08974306135","infoHashBuffer":{"type":"Buffer","data":[60,128,169,78,81,125,215,109,0,116,249,60,124,56,208,137,116,48,97,53]},"announce":[],"urlList":[]}}