{"title":"James.Deens.Sex.Tapes.James.House.XXX.DVDRip.x264-CiCXXX","uid":10107697,"size":2014257884,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3da7c4f0482ade28ba3753b935fb811698c490e0&amp;dn=James.Deens.Sex.Tapes.James.House.XXX.DVDRip.x264-CiCXXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":5,"time":1399478759,"description":"&quot;Handsome porn stud James Deen has become a crossover hit with mainstream ladies that don t even watch porn. But the adult industry s savvy girls know that the real action is over at this creative young director s home, where they can let their inner freak go wild. In James Deen s Sex Tapes: James House, six insatiable sluts visit his L.A. estate and treat his famous cock to their special talents. Shot on the fly without any elaborate sets or special lighting, this is real-life eroticism no acting allowed. Super-sexy blonde Jasmine Tame visits James, and as soon as he gets her alone, the petite and busty cutie is at his mercy. Jasmine slurps his rock-hard cock and gets on all fours for a passionate doggie-style fucking. Eighteen-year-old brunette Janice Griffith is nervous about her first porn shoot. The director soothes her pre-scene jitters by sodomizing her, and by the time co-star Toni Ribas shows up, Janice is ready for some fierce throat fucking and a double-penetration. Auburn-haired cutie Hope has a surprise under her coat she drops it to reveal an all-natural body in only a lacy bra and panties. Hope rides James shaft in every position. Pierced, tattooed tart Scarlett Pain, blonde supermodel slut Anikka Albrite and tiny temptress Lexi Love each enjoy memorable visits. The two-disc DVD includes a bonus one-on-one scene with the fresh Ms. Griffith. As his private Sex Tapes reveal, there s always room for raw lust when James Deen is in the house!&quot;\n\nScarlett Pain, Jasmine Tame, Janice Griffith, Hope, Lexi Love, Anikka Albrite, James Deen, Toni Ribas\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=63120204823332397714.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=63120204823332397714.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=53937020599355130132.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=53937020599355130132.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:3da7c4f0482ade28ba3753b935fb811698c490e0","amp;dn":"James.Deens.Sex.Tapes.James.House.XXX.DVDRip.x264-CiCXXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3da7c4f0482ade28ba3753b935fb811698c490e0","infoHashBuffer":{"type":"Buffer","data":[61,167,196,240,72,42,222,40,186,55,83,185,53,251,129,22,152,196,144,224]},"announce":[],"urlList":[]}}