{"title":"OpTimuS_DE_V1.2 (ROM) ( LS980)","uid":9438670,"size":1659565253,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:412cae8fa991c81cfa2f2405d1c654b31c17cda6&amp;dn=OpTimuS_DE_V1.2+%28ROM%29+%28+LS980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kingism","files":2,"time":1388952540,"description":"PLEASE READ\n\nTo install:\n\nMake sure you do a full wipe on this one, there are a lot of implementations and its very important you start fresh, enjoy OpTimuS DE V1.2!\n\n\n\n\n\n\n\n\nThis Rom is based on the new ZV8 update, OpTimuS is a stock rom for the performance oriented but with battery in mind users, who like me like to get more speed, performance and responsiveness out of this quad core beast that is the LG G2, I hope you enjoy it as much as I do... Well enough said, lets move on to goodies.\n\n\n\n\nInstallation:\n\nMake sure you have wifi available, you gonna need to Update PROFILE and PRLthat way you can pick up data right away without waiting.\n\n\n1-Download Rom (obviously) \n2- If coming from another rom Do a full wipe, If you have OpTimuS then wipe cache, dalvik and system, I'll let you know if any steps are needed for future versions.\n3-Reboot\n4-Update your PROFILE and PRL ( go to; menu, system settings, system updates) you can also Activate Device (this is in; menu, system settings, activate device) activating will ensure you good to go.\n\nCongratulations you are now OpTimuS ready!\n\nThanks to:\nVeNuM\n\n\n\n\nFeatures:\n\nStock odex (for now)\nRooted\nbuildpro tweaks.\ninit.d support with scripts for better performance.\nSysctl support for kernel performance and battery.\nAll apps have been zipaling and optimized.\nXposed framework (rovo89)\nXposedG2 app (BlackDino)\nGravityBox (C3C076)\nFurnace kernel (Savoca)\nLG Flex split view (Bigfau)\nWifi Hotspot (Metalboy94-Ascertion)\n\n\n\n\nChange log:\n\n\nV1.2\n\n1-Added Furnace kernel V05 ( its crazy how updates are coming up, but we'll take the improvements)\n2-Added the XposedG2 app that goes along Xposed, that app is made for the G2 exclusively, so is a nice add on, thanks to BlackDino for allowing us to include it in this version.\n3-All apps zipaligned and optimized as usual.\n\n\nV1.1\n\n1-Added Furnace kernel v04 (thanks to Savoca for this awesome kernel) This kernel makes OpTimuS way better and faster, enjoy!\n2-Added LG Flex split view (Thanks bigfau) to activate just long press on the back buttom, choose the apps u want to split use.\n3-Activated the trace on the keyboard. \n4-Added battery percentage mod from the OpTimuS G Rom, you'll see the battery numbers From 1 to 100 incremental as well as charging animations.\n5-Ported the Original OpTimuS status bar icons from OpTimuS G, also added the wallpaper as well.\n6-Removed some more bloatware.\n7-Updated Xposed framework, Gravity box and Viper4android.\n8-Added Wifi hotspot. (Metalboy94-Ascertion)\n9-Removed wifi tether app since wifi mod has been implemented.\n10-Added Zipalign script to make sure all apps are zipalign in every boot so system stays optimized.\n11-All apps have been optimized and zipalign for better ram and performance.\n\n\n\n\n\n\n\nFor mods and themes:\n\n\n\n\nViper4Android sound mod Thanks to Viper520 and zhuhang , also Thanks to droidmk for introducing it to us, this mod is the best sound mod I've tested so far\nHere's the main thread\n\nTo Activate viper audio:\n\n1-Find the viperaudio app\n2-Open it, is gonna ask you to install the audio driver, click yes.\n3-Install CortexA8 with NEON.\n\n4-Reboot, enjoy!\n\n\nviper4Android thread\n\n\n\nXposed framework thanks to rovo89, Gravitybox thanks to C3C076 and BonezMontana for introducing it to us.\n\nXposed framework gives you the ability of modifying and theming without the need to modify the apps in the rom, so it goes on top of the rom sort of speak, its very easy to use and there are tons of modules with all kinds of modifications, simply awesome!\n\nTo activate Xposed:\n\n1-Find the Xposed installer app in your app drawer\n2-Open it and go to framework\n3- Choose Install/Update, the system will install the drivers and files needed\n4-Go to modules and select gravity box\n5-Reboot and enjoy! after reboot, find the gravity box app and start having fun! \n6-Why stop with gravity? go ahead and find more modules of your liking, don't forget to thank the guys responsible for all of this!\n\n\n\nIf you have any questions or any suggestions or maybe you just wanna thank the devs ,  come check us out at:\n\n\n &lt;a href=&quot; http://forum.xda-developers.com/showthread.php?t=2590234&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.xda-developers.com/showthread.php?t=2590234&lt;/a&gt;\n\n\n\n\n","torrent":{"xt":"urn:btih:412cae8fa991c81cfa2f2405d1c654b31c17cda6","amp;dn":"OpTimuS_DE_V1.2+%28ROM%29+%28+LS980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"412cae8fa991c81cfa2f2405d1c654b31c17cda6","infoHashBuffer":{"type":"Buffer","data":[65,44,174,143,169,145,200,28,250,47,36,5,209,198,84,179,28,23,205,166]},"announce":[],"urlList":[]}}