{"title":"Make Her Pursue You - The Advanced Bad Boy Training Course","uid":9474873,"size":4199567475,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:42b3f18fd921ca93ac2c929dc3b3c1b9ef425e1a&amp;dn=Make+Her+Pursue+You+-+The+Advanced+Bad+Boy+Training+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"SexualityBR","files":-1,"time":1389665934,"description":"\n\nRon Louis and David Copeland - Make Her Pursue You: The Advanced Bad Boy Training Course\nEnglish | 15 DVDRips (MP4) | 15files x 45 mins | Size: 3.91 GB\nCategory: Seduction\n\n\nThe DVD program Make Her Pursue You is an Advanced Bad Boy Training Course from Ron Louis and David Copeland of the dating company How to Succeed with Women.\n\nClassroom DVDs:\n\n- Exactly what Disconnecting with a woman is, and why you must do it, or be stuck alone.\n- The different types of Disconnection, and when to use each one.\n- How to use Disconnections in approaches with women, step by step.\n- How being a Hard to Get/Disconnecting Man is the secret to bad boy success...\n- How to use Disconnecting, hard to get bad boy actions to make women work for YOUR approval.\n- How to break the beauty trance, once and for all.\n- How to use intensity to seduce women. If you've ever been criticized by a woman for being too intense, you'll be very interested in this way to use intensity to your seductive advantage.\n- Most normal guys smooth themselves out around women. That is, they try to be all things to all women, and to not put a woman off in any way.\n- How to turn interactions into events.\n- How to have a conflict with a woman in a way that makes her think she can't have you, and thus want to pursue you,\n- What to keep in mind while having a conflict so you don't lose your cool, and\n- How to ride through a conflict with a woman and get to the make up that happens on the other side of it.\n\nDemonstration DVDs\n\n- You'll start to see interactions between men and women around you.\n- You'll see the things other men could do to be more &quot;hard to get&quot; with women, and to be better &quot;bad boys&quot; in their seductions.\n- You'll start to see interactions between men and women on TV and in movies differently; because you've seen so many examples of &quot;bad boy&quot; seduction, you'll start to see how men could behave differently with the women the are interacting with.\n- You'll see men working for Connection with women, and you'll know exactly what Disconnections they should use with those women.\n\n","torrent":{"xt":"urn:btih:42b3f18fd921ca93ac2c929dc3b3c1b9ef425e1a","amp;dn":"Make+Her+Pursue+You+-+The+Advanced+Bad+Boy+Training+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b3f18fd921ca93ac2c929dc3b3c1b9ef425e1a","infoHashBuffer":{"type":"Buffer","data":[66,179,241,143,217,33,202,147,172,44,146,157,195,179,193,185,239,66,94,26]},"announce":[],"urlList":[]}}