{"title":"Skyrim Epic Graphics and Gameplay Overhaul Compilation - ADULT -","uid":10173290,"size":15627131662,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4300d39ec4ef9d27c74682a97c3d703e0362a516&amp;dn=Skyrim+Epic+Graphics+and+Gameplay+Overhaul+Compilation+-+ADULT+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Vendayn","files":1,"time":1400435898,"description":"Some of you may remember version 1 of my compilation for Skyrim (Winter Overhaul)...while great for a hardcore experience it lacked the fun factor. I also did not like white and blizzards everywhere. It also came with bugs that had to be fixed after uploading. Mistakes were made there.\n\nIn this...I do warn, there is a lot of adult content here (hentai style). I did a different approach in this version. However, to be honest...I've laughed so much from it. It is more hilarious than anything else...so...I consider it adult humor. Never have laughed so much over a game.\n\nOnly bug is a Skyrim bug. If using TLC during animation, your character won't attack and mouse buttons don't work except in exit menu.\n\nI will post a fix tomorrow or Sunday. No additional download, its fixed in game. Either don't use tfc till I post a fix or just reload the game.\n\nBut, there is more to it than that.\n\nA total complete rework of the graphics that look freakin amazing. And, yes...you need a high end PC. My PC gets 30 FPS on average, so it is okay...not the greatest. Drops to 20...goes to 40-50 in interiors.\n\nscreenshots here: http://s4.photobucket.com/user/Vendayn/library/Skyrim/Epic%20Skyrim%20of%20Ultra%20Graphics\n\nSystem specs:\nGeforce 660GTX 2 GB\n8gig DDR3 ram\ni5 3.3 Ghz CPU\nWindows 7 64bit\nNo SSD drive\n\nI need to upgrade :P\n\nAny crashing is solely because of your PC and not mod related. I crash often...but only because my system underperforms for this. Again, not mod related.\n\nThe armors are invisible to let you guys know (not all of them)...if your body is invisible when creating a character, take off the clothes and then open console (~) and do &quot;showracemenu&quot; and start making it. This is because the new body is made for custom armors (should have an LB in the beginning or lady body...but some may not have that). The character body for male is vastly improved. And the females have the most realistic look along with the highest quality textures, by far the best body for females.\n\nNow the biggest aspect I focused on was gameplay...as much as I did for the graphics. Total overhauls of in-game economy. Now prices vary depending where you are...for example...riverwood may have more expensive ore due to lack of any good mine near there. But buy ore for a bigger price. Or a place with a high quality mine may have very cheap ores.\n\n4 new non-dlc epic new lands\n\nYou can also build a massive custom city, with many NPCs. This is a big new feature of this compilation.\n\nYou can build your own fort, which may go well with your city.\n\nYou can make your own guild and level it up with perks.\n\nYou can build your own house (hearthfire, but a custom mod allows a even better custom house)\n\nYou can also buy inns/shops/houses etc and rent them out and supply inns/shops with resources for a weekly income.\n\nTons of secret treasures to find as well, and lots of secrets added.\n\nLots of gold added to the economy, however TONS more gold you have to spend on all the shops/businesses/trade etc ;)\n\nOh...and a Risk style aspect was added...more about economy/trade than combat. You will however need to conquer places...which...doesn't really show in the actual game, so its more like a Risk game board. Its a nice feature/gameplay aspect.\n\nMuch tougher gameplay (Requiem mod), which makes Skyrim very hard. Along with tons of new spells, new horrifying monsters, new animals and animal behavior.\n\nThere are tons of many new changes and additions, more than I can list here. I'm sure I forgot lots...but those are the key features that pop out in mind.\n\nTo sort the mod list, use LOOT found in the Skyrim folder. This finds every mod in this compilation and organizes it appropriately. I do warn however, a few additional changes may need to be made with Wrye Bash as some masters are re-ordered and show up as orange (green is best, orange is medium, red means its missing important files that will cause a CTD at startup).\n\nI wouldn't worry too much about re-ordering unless you want to do that. LOOT is good at what it does.\n\nActivate the mods of course, using nexusclient (don't update it cause its lame and destroys load order and breaks mods when it updates) or Wrye Bash.\n\nOther than that...mod comes bug free. Any bugs come from Skyrim itself (as said above with the camera (tfc) during animations...and any crashes is PC related as this mod takes a very high end PC to run. A lot better than mine anyway.\n\nWith that said...hope you guys enjoy Version 3 of the Compilation. This is the final version, and I won't be doing any additional ones. This is 100% what I wanted Skyrim to be.\n\nHorror, comedy, kinky, adventure, tycoon, sims style game all in one. :)\n\nEnjoy guys.\n","torrent":{"xt":"urn:btih:4300d39ec4ef9d27c74682a97c3d703e0362a516","amp;dn":"Skyrim+Epic+Graphics+and+Gameplay+Overhaul+Compilation+-+ADULT+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4300d39ec4ef9d27c74682a97c3d703e0362a516","infoHashBuffer":{"type":"Buffer","data":[67,0,211,158,196,239,157,39,199,70,130,169,124,61,112,62,3,98,165,22]},"announce":[],"urlList":[]}}