{"title":"Flow of Grace - Krishna Das - Chanting the Hanuman Chalisa","uid":10196268,"size":1069007553,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4386266eed6e7fbcca67d4f867be4290d8c897f8&amp;dn=Flow+of+Grace+-+Krishna+Das+-+Chanting+the+Hanuman+Chalisa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abajanga2","files":30,"time":1400694776,"description":"The Hindus consider Goswami Tulsidas one of their greatest poets, and of his large body of works, Hanuman Chalisa is his most famous: 40 lyrical verses of praise to Hanuman the monkey god, the deity known as the pinnacle of bhakti (devotion) and the remover of fears. It is said that just by chanting these powerful Sanskrit words, you will gain strength and confidence, and be filled with divine energy.\n\nNow with Flow of Grace, Krishna Das offers us the rare opportunity to chant these transformative verses along with him, and to experience the devotional power of kirtan (sacred chant) at its best. Krishna Das is known for his ability to transport listeners to other worlds with the eloquence of his deep, hypnotic voice and the soothing sounds of the harmonium.\n\nOn Flow of Grace, we arrive at the feet of Hanuman, who grants ease in the removal of obstacles and the solving of problems. Known for his unwavering commitment to righteousness, he is also the devoted teacher who graciously offers help to one's soul in realizing the Divine. Through the music of Krishna Das, you can now experience the healing powers of one of Hinduism's most important pieces of musical literature.","torrent":{"xt":"urn:btih:4386266eed6e7fbcca67d4f867be4290d8c897f8","amp;dn":"Flow+of+Grace+-+Krishna+Das+-+Chanting+the+Hanuman+Chalisa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4386266eed6e7fbcca67d4f867be4290d8c897f8","infoHashBuffer":{"type":"Buffer","data":[67,134,38,110,237,110,127,188,202,103,212,248,103,190,66,144,216,200,151,248]},"announce":[],"urlList":[]}}