{"title":"Hose Monster XXX DVDRip XviD-Jiggly","uid":9517721,"size":1463413599,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:45aec85411c35da13226412450d40f6826c87999&amp;dn=Hose+Monster+XXX+DVDRip+XviD-Jiggly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"xxxlavalxxx","files":4,"time":1390560483,"description":"Veteran stud David Perry is a seasoned director and XXX star. The big-dicked stud's Evil Angel directing debut is &quot;Hose Monster,&quot; a term defined on the back of the DVD package: Hose Monster (hoz' mn'-ster) n [San Fernando Valley slang, c. 1980] 1: a person, usually a rampantly promiscuous female, who engages in sex acts with multiple penises at once. 2: one who can't be sexually satisfied without the service of multiple cocks, often in all orifices. Indeed, David's slutty cuties love taking on three or more cocks at a time!\nBrown-haired dick hound Debbie White strips, teases, masturbates with anal toys and fucks stud Toni Ribas. Enter David and three more merry men; five cocks invade all of the whore's holes, double-penetrating her and glazing the cock-crazed girl with a messy bukkake facial.\nNext, slender, black-haired Aliz teases the camera, inserting a clear, wide butt plug in her bottom, then licking it clean. She's quickly surrounded by four horny cocksmen who give Aliz an airtight pounding! When the brutish boys have finished reaming her various inputs (and her ass gapes from nonstop use), Aliz swallows several creamy loads.\nLastly, modelesque blonde slattern Aleska Diamond wiggles her curves poolside in a skimpy swimsuit and spike heels. Inside, no slot goes unstuffed as perverted David, Toni and Steve Holmes have their way with this all-natural cock slut. Aleska's left cum-drenched and fully satisfied.\nIf you're into sluts who devour three, four or five cocks at once, this movie is a monster!\n\nCast: Debbie White, Aliz, Aleska Diamond, Bruno SX, Bob Terminator, Sabby, Mugur, Steve Holmes, Toni Ribas, David Perry, Choky Ice, Leslie Taylor\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=46045791386436272431.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=46045791386436272431.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=82496687924678854956.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=82496687924678854956.jpeg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:45aec85411c35da13226412450d40f6826c87999","amp;dn":"Hose+Monster+XXX+DVDRip+XviD-Jiggly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45aec85411c35da13226412450d40f6826c87999","infoHashBuffer":{"type":"Buffer","data":[69,174,200,84,17,195,93,161,50,38,65,36,80,212,15,104,38,200,121,153]},"announce":[],"urlList":[]}}