{"title":"BlacksOnBlondes - Penny Pax - Double penetrated by two black coc","uid":9605059,"size":702716147,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:475c7a12ff6a560f963ad205d0c0fc82629e023b&amp;dn=BlacksOnBlondes+-+Penny+Pax+-+Double+penetrated+by+two+black+coc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HardFuck","files":1,"time":1392163324,"description":"Scene Pictures:\n &lt;a href=&quot;\nhttp://www.picshowroom.com/?v=09.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picshowroom.com/?v=09.jpg&lt;/a&gt;\n\nBlacksOnBlonde - Penny Pax\n\nSin City has never seen debauchery quite like what we just shot. Beautiful Penny Pax is in dream land when Charlie Mac and Richard Mann enter the picture. What happens next borders on perversion and creepiness. Penny is felt up, while sleeping, and Charlie and Richard treat her to an awesome morning call the minute she wakes up. Penny welcomes a double dose of black morning wood by sucking on each one until her mouth can dish out no further spit. The phenomenal rack on Penny Pax gets felt up while her amazing ass gets palmed like a basket ball. The foreplay ends the very second Penny Pax feasts on both big black cocks. The busty blonde gets a mouth full of black cock and her moans can be heard in every casino within the state of Nevada. Penny gives her throat a rest and it's now time to test the limits of her ass and pussy. Charlie and Richard take turns slamming into her holes, and,of course, it's now time for an interracial d.p. Penny braces herself as two block cocks fuck her ass and pussy at the same time. The sleeping beauty is now fully awake and taking big black cocks like a champ. Penny doesn't gamble, but she knows that the black house wins when it comes to draining their loads all over her.","torrent":{"xt":"urn:btih:475c7a12ff6a560f963ad205d0c0fc82629e023b","amp;dn":"BlacksOnBlondes+-+Penny+Pax+-+Double+penetrated+by+two+black+coc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475c7a12ff6a560f963ad205d0c0fc82629e023b","infoHashBuffer":{"type":"Buffer","data":[71,92,122,18,255,106,86,15,150,58,210,5,208,192,252,130,98,158,2,59]},"announce":[],"urlList":[]}}