{"title":"The West Memphis Three","uid":10226587,"size":5774005101,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48712092f1d7d81c4e84e94366977bb312d80d19&amp;dn=The+West+Memphis+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TFG92","files":-1,"time":1401091425,"description":"The West Memphis Three are three men who were tried and convicted as teenagers in 1994 of the 1993 murders of three boys in West Memphis, Arkansas. Damien Echols was sentenced to death, Jessie Misskelley, Jr. was sentenced to life imprisonment plus two 20-year sentences, and Jason Baldwin was sentenced to life imprisonment. During the trial, the prosecution asserted that the children were killed as part of a Satanic ritual.\n\nIn July 2007, new forensic evidence was presented in the case and a status report jointly issued by the state and the defense team stated, &quot;Although most of the genetic material recovered from the scene was attributable to the victims of the offenses, some of it cannot be attributed to either the victims or the defendants.&quot; On October 29, 2007, the defense filed a Second Amended Writ of Habeas Corpus, outlining the new evidence.\n\nFollowing a successful decision in 2010 by the Arkansas Supreme Court regarding newly produced DNA evidence,[5] the West Memphis Three reached a deal with prosecutors. On August 19, 2011, they entered Alford pleas, which allow them to assert their innocence while acknowledging that prosecutors have enough evidence to convict them. Judge David Laser accepted the pleas and sentenced the three to time served. They were released with ten-year suspended sentences, having served 18 years and 78 days in prison.\n\n\nPackaged here are three HBO documentaries chronicling the case:\n-Paradise Lost: The Child Murders at Robin Hood Hills (706MB, 240x320, 2:31:51)\n-Paradise Lost 2: Revelations (698MB, 480x624, 2:12:34)\n-Paradise Lost 3: Purgatory (1.36GB, 416x720, 2:01:06)\n\nAmy J. Berg's documentary:\n-West of Memphis (1.38GB, 480x720, 2:27:17)\n\nAtom Egoyan's 2013 dramatization:\n-Devil's Knot (1.25GB, 718x1280, 1:54:13)","torrent":{"xt":"urn:btih:48712092f1d7d81c4e84e94366977bb312d80d19","amp;dn":"The+West+Memphis+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48712092f1d7d81c4e84e94366977bb312d80d19","infoHashBuffer":{"type":"Buffer","data":[72,113,32,146,241,215,216,28,78,132,233,67,102,151,123,179,18,216,13,25]},"announce":[],"urlList":[]}}