{"title":"A Zeptospace Odyssey","uid":10198590,"size":5016564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48fda28f8d7d7f5aeacc610223f836478b223c84&amp;dn=A+Zeptospace+Odyssey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mguima.geo","files":1,"time":1400729961,"description":"A Zeptospace Odyssey\n\nA Journey into the Physics of the LHC\n\nby Gian Francesco Giudice\n\n\nThis book provides a simple and understandable guide for appreciating the discoveries that are about to take place at the Large Hadron Collider (LHC) at CERN, the world's largest particle accelerator. A CERN physicist leads the lay reader into the world of particle physics, from the astonishing technological innovations that were necessary to build the LHC, through the speculative theories invented to describe the ultimate laws governing the universe. The result is an extraordinary journey inside the fabric of matter, an exciting adventure inside a strange and bewildering space, through which one can appreciate the scale of the intellectual revolution that is about to happen. Does the mysterious Higgs boson exist? Does space hide supersymmetry or extend into extra dimensions? How can colliding protons at the LHC unlock the secrets of the origin of our universe? These questions are all framed and then addressed by an expert in the field. While making no compromises in accuracy, this cutting-edge material is presented in a friendly, accessible style. The book's aim is not just to inform, but to give the reader the physicist's sense of awe and excitement, as we stand on the brink of a new era in understanding the world in which we all live.","torrent":{"xt":"urn:btih:48fda28f8d7d7f5aeacc610223f836478b223c84","amp;dn":"A+Zeptospace+Odyssey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48fda28f8d7d7f5aeacc610223f836478b223c84","infoHashBuffer":{"type":"Buffer","data":[72,253,162,143,141,125,127,90,234,204,97,2,35,248,54,71,139,34,60,132]},"announce":[],"urlList":[]}}