{"title":"Alex Jones Show - 2014 Feb 13 TH [sebaygo1]","uid":9611959,"size":64918290,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4cd3d97f175af67ad432440e8154f869235f286a&amp;dn=Alex+Jones+Show+-+2014+Feb+13+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":11,"time":1392336341,"description":"\nThe Alex Jones Show \nThursday, 13 February 2014\n\n\n[sebaygo1]\n\nNOTE: Today's show was an unusual broadcast. Although there is no acknowledgement of it in the official show description or elsewhere on the Infowars web site, today's show consisted entirely of recycled, previously aired material.\nThe Ventura interview is from Feb. 3, Estulin from Jan. 29 and Skousen from Jan. 31.\n\n\nShow Description\n................\nFrom the Infowars web site :: On this Thursday, February 13 edition of The Alex Jones Show, in the first hour Alex talks with former governor and actor Jesse Ventura about his new book, They Killed Our President, and the current explosion in alternative media and the real news behind current events. Ventura's book is the ultimate compendium covering every angle of the JFK assassination.\n\nIn the second hour, Alex also talks with author and the editor of World Affairs Brief, Joel Skousen, about the communist takeover of America. \n\nAnd in the third hour, veteran Bilderberg investigator and author Daniel Estulin joins the transmission to discuss the dangers of transhumanism and the elite's drive for total control. Estulin is the author of TransEvolution: The Coming Age of Human Deconstruction.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:4cd3d97f175af67ad432440e8154f869235f286a","amp;dn":"Alex+Jones+Show+-+2014+Feb+13+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd3d97f175af67ad432440e8154f869235f286a","infoHashBuffer":{"type":"Buffer","data":[76,211,217,127,23,90,246,122,212,50,68,14,129,84,248,105,35,95,40,106]},"announce":[],"urlList":[]}}