{"title":"Dare.Dorm.19.XXX.DVDRip.x264-XCiTE","uid":9536855,"size":2337746316,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:50320e9de248d1f67920bb8cc85aa58a99823810&amp;dn=Dare.Dorm.19.XXX.DVDRip.x264-XCiTE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xxxlavalxxx","files":5,"time":1390949744,"description":"Category\tAll Sex, Legal Teen, Amateur, Threesomes &amp; More, Reality, College Girls, Orgies, Dare Dorm's Dare Dorm Series\n\nReal Submitted Dorm Room Footage!\n\nJoin The Party That Never Ends! More Booze, Boobs, &amp; Babes!\n\nBubble Wrap - We have in our hands another great bubble wrap party. The girls in this party are more than hot, they are horny as hell too. As the night went along, more and more bubble wrapped people kept showing up. The party was only when you notice one girl getting double teamed on the bed, that the party became a classic. This chick took it like a champ. Multitasking like a boss with one dick in her mouth and the other in her pussy. A true valedictorian!\n\nGuess That Titty - When girls decide to have a girls night out, they came up with the weirdest, and coolest games to play. You get your classics like, spin the bottle, truth or dare, and every once in a while you get gems like, guess that titty. These college girls are hot as hell, and they have the perfect titties to play the game, but even guessing that titty wasn't enough. As the night progressed, the dildos came out, and then they went in, their pussies that is. Girls really know how to have fun, and it was very apparent with this hotties. They dildo each other up, and loved every minute of it, so I'm very confident you will too!\n\nValentines Dick - Everyone should have girlfriends like these. A very hot group of girls are planning out the night in the dorm room, but lovely Farrah says she has a date, and everybody should leave when she gets back from the gate. Great opportunity to hide in the closet and film everything. Farrah eventually caught them, but she never stopped getting her pussy eaten. Everyone is back now, and that's when the party really took off. Farrah's date began fucking her, while the two girls that filmed started eating each other out, and it just got better from there. A Def must watch!\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=80506666607707438050.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=80506666607707438050.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=34084876307057080674.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=34084876307057080674.jpg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=26700262087582477806.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=26700262087582477806.jpg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:50320e9de248d1f67920bb8cc85aa58a99823810","amp;dn":"Dare.Dorm.19.XXX.DVDRip.x264-XCiTE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50320e9de248d1f67920bb8cc85aa58a99823810","infoHashBuffer":{"type":"Buffer","data":[80,50,14,157,226,72,209,246,121,32,187,140,200,90,165,138,153,130,56,16]},"announce":[],"urlList":[]}}