{"title":"Alex Jones Show - 2014 Jan 10 FR [sebaygo1]","uid":9463469,"size":66685919,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:53b74b23a9e64d6340541651454d88488924f78d&amp;dn=Alex+Jones+Show+-+2014+Jan+10+FR+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1389395837,"description":"\nThe Alex Jones Show \nFriday, 10 January 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Friday, January 10 edition of The Alex Jones Show, Alex uncovers the latest in government hypocrisy and cover-ups. The State of California is now downplaying the radiation discovered on beaches in California, which are 12 to 14 times above safe levels, as &quot;normal&quot; and not being a threat to public health. Jakari Jackson and the Infowars crew continue their investigation into the radiation in Oregon as Fukushima's dangerous plume begins to reach the American west coast. \n\nAmerican legal theorist Elizabeth Price Foley also joins the show to specifically break down how Obama is violating the Constitution and to reveal Rep. Tom Rice's proposed resolution to bring the executive branch to court.\n\nNOTE: Though not mentioned in the official show description, Alex's guest for most of the second hour and the first segment of the third hourd is Dr. Group -- the developer of the Survival Shieldâ„¢ iodine that Alex sells at InfowarsLife.com. Group's appearances on the show could be regarded as an &quot;infomercial&quot; for the various products available on that web site (today particularly Super Male Vitalityâ„¢. It's virtually impossible to edit out &quot;commercials&quot; when they're about an hour long.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:53b74b23a9e64d6340541651454d88488924f78d","amp;dn":"Alex+Jones+Show+-+2014+Jan+10+FR+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b74b23a9e64d6340541651454d88488924f78d","infoHashBuffer":{"type":"Buffer","data":[83,183,75,35,169,230,77,99,64,84,22,81,69,77,136,72,137,36,247,141]},"announce":[],"urlList":[]}}