{"title":"O&amp;O Defrag Professional 17.5 Build 559 (x86-x64)","uid":10195799,"size":55544632,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:574e46a823cc190cc552ca2094849e0600780ab5&amp;dn=O%26amp%3BO+Defrag+Professional+17.5+Build+559+%28x86-x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nikita200","files":-1,"time":1400690588,"description":"Do not wait too long! If you work on computers a lot, then slow system and program starts, endless rendering and memory processes, or even system crashes when playing can quickly ruin your enjoyment. Defragmenting your PC can hugely accelerate the speed you can work on your PC. When you defragment, those files fragmented across the hard disk are logically rearranged so that files can be quickly recognized and processed by the hardware. Performance gains of up to 100% are not uncommon! In the new version of O&amp;O Defrag, you can now see what the program does for your system thanks to graphics and statistics, which give you a before-and-after Defrag contrast!\n\nIf you work on computers a lot, then slow system and program starts, endless rendering and memory processes, or even system crashes when playing can quickly ruin your enjoyment. Defragmenting your PC can hugely accelerate the speed you can work on your PC. When you defragment, those files fragmented across the hard disk are logically rearranged so that files can be quickly recognized and processed by the hardware. Performance gains of up to 100% are not uncommon!\n\nSuitable for Windows 8.1, Windows 8, Windows 7, Vista and XP\n\nHome Page: www.oo-software.com","torrent":{"xt":"urn:btih:574e46a823cc190cc552ca2094849e0600780ab5","amp;dn":"O%26amp%3BO+Defrag+Professional+17.5+Build+559+%28x86-x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"574e46a823cc190cc552ca2094849e0600780ab5","infoHashBuffer":{"type":"Buffer","data":[87,78,70,168,35,204,25,12,197,82,202,32,148,132,158,6,0,120,10,181]},"announce":[],"urlList":[]}}