{"title":"Real Anal Booty Calls (Evil Angel) XXX DVDRip NEW (2013)","uid":9462598,"size":3181032733,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:587ed031aafc49a6d69827b387e5cdd27b7cfca5&amp;dn=Real+Anal+Booty+Calls+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xuluhulu","files":1,"time":1389381094,"description":"Concealed within the quiet suburban home of husband-and-wife porn duo Francesca Le and Mark Wood, the most perverse and nasty sex acts take place. The LeWood partnership is a true swingers' arrangement, and the ass-obsessed pair's kinky compulsions are best served with a constant parade of fresh, new girls. The new &quot;LeWood's Real Anal Booty Calls&quot; captures over four hours of filthy threesomes; it showcases Porn Valley's hottest babes dropping in to be dominated and overwhelmed by the kinky couple. When it comes to raunchy butt sex, American Latina MILF goddess Francesca and big-dicked Mark are limited only by their hard-core imaginations! Stunning, all natural Italian beauty Valentina Nappi is barely in the door before she's worshiping Francesca's pussy and sucking on her sexy toes. The older couple even double-penetrates the young slut with the help of Francesca's strap-on dildo! Kinky brunette Dana DeArmond gets thoroughly sodomized with lots of ass-to-mouth cocksucking fun; she orally swaps Mark's jizz with Francesca. Tattooed black vixen Skin Diamond joins the couple by the pool, strips down to her skimpy bikini and enjoys lesbian lust with Francesca before getting her asshole royally fucked. Fresh-faced American Latina Vicki Chase helps Francesca service Mark's thick cock with a wet, POV-style double-blow job. He gives Vicki a wild backdoor boning and watches her share his creamy load with his wife. The DVD version is a deluxe, double-disc package including 36 minutes of bonus tease, interviews and behind-the-scenes footage. &quot;LeWood's Real Anal Booty Calls&quot; is pure three-way butt-banging mayhem!\n\nCOVERS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=36873321759682011972.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=36873321759682011972.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=25134723832042116046.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=25134723832042116046.jpg&lt;/a&gt;\n\n\nCAST:\n\nDana DeArmond, Francesca Le, Mark Wood, Skin Diamond, Valentina Nappi, Vicki Chase\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:587ed031aafc49a6d69827b387e5cdd27b7cfca5","amp;dn":"Real+Anal+Booty+Calls+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587ed031aafc49a6d69827b387e5cdd27b7cfca5","infoHashBuffer":{"type":"Buffer","data":[88,126,208,49,170,252,73,166,214,152,39,179,135,229,205,210,123,124,252,165]},"announce":[],"urlList":[]}}