{"title":"Nora Jean Bruso - 2004 - Going Back To Mississippi FLAC","uid":10211309,"size":418812123,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:58dc43a018b3776936e6f1b3d95a0ea1aa12c3a0&amp;dn=Nora+Jean+Bruso+-+2004+-+Going+Back+To+Mississippi+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eika256","files":-1,"time":1400913435,"description":"Nora Jean Bruso - 2004 - Going Back To Mississippi\n\nVocalist Nora Jean Bruso has been an up-and-comer in the blues world, but go and see her perform live at a club or a festival, and you'll quickly discover she's a polished professional, a stone cold pro. Bruso, or Elnora Wallace, was born and raised in Greenwood, Mississippi, a town famous for producing a variety of blues and gospel greats. Her father was Bobby Lee Wallace, a blues singer and sharecropper; her mother was Ida Lee Wallace, a gospel singer.\nIn high scool, Nora Jean won the West Tallahatchie High School Talent Show grand prize for singing, and she began to perform in other area schools with small groups. Realizing her opportunities for recognition and recording were limited in Mississippi, Bruso moved to Chicago in 1976 and began her professional singing career with Scottie and the Oasis. Six years later, Scottie passed away and the band broke up, but Nora Jean began singing with other West Side bands she had already developed relationships with, including Little Johnnie Christian.\nBy 1985, she joined Jimmie Dawkins' band and recorded her first single, &quot;Untrue Lover&quot; for Dawkins' own record company, the Leric Label. (Some of Dawkins' Leric sides were reissued by Delmark Records.) She also sang on Can't Shake These Blues, an anthology released by Earwig Records.\nIn 1991, she recorded with Dawkins on his album for the British JSP label, Feel the Blues, which was later re-released in 2003 with a bonus track from Bruso.\nIn 1992, she retired from the rigors of regional touring to concentrate on raising her two sons, but by 2001, she was called back into the studio by fellow Jimmie Dawkins band alumnus Billy Flynn. She provided four vocal tracks on Blues and Love, a 2002 release, and later that year, she resumed her blues career, such as it was, appearing on the main stage at the Chicago Blues Festival with Dawkins' band.\nLater in 2002, she recorded her first album, Nora Jean Sings the Blues, and was awarded a &quot;Keeping the Blues Alive&quot; citation by the Black History Association in Chicago. In 2003, she released Sings the Blues on the Red Hurricane Records label and the album garnered critical praise from radio programmers around the U.S. and Canada. She performed again at the 2003 Chicago Blues Festival and headed to Europe that summer for a tour.\nBy 2004, Bruso was nominated for two W.C. Handy Awards, one for Best New Artist and one for Best Traditional Female Artist. Later that year, she signed a deal with Maryland-based Severn Records and released Going Back to Mississippi, which debuted at number five on the Living Blues magazine radio charts and climbed to number one on XM satellite radio. In June, 2004, she performed again on the main stage at the Chicago Blues Festival, with her own band, and in 2005 she made a slew of other festival performances around the U.S. and Canada, including the Cape May Jazz Festival and the Pocono Blues Festival.\nDuring the 2000s, the Nora Jean Bruso band included Carl Weathersby on guitar, James Carter, drums, Bruce Belgin, bass and Brian Lupo, guitar. When they weren't on the road, Nora Jean was based in LaPorte, Indiana. (AllMusic)\n\nTrack list:\n01 -  Telling Me What to Do.flac\n02 -  Miss Mae's Juke Joint.flac\n03 -  All My Life.flac\n04 -  Going Back to Mississippi.flac\n05 -  Broken Heart.flac\n06 -  I've Got Two Men.flac\n07 -  Don't You Remember.flac\n08 -  What I Been Through.flac\n09 -  Tearful Blues.flac\n10 -  Things Done Changed.flac\n11 -  Another Part of You.flac\n12 -  If You're Looking for Someone.flac\n\nPersonnel:\nNora Jean Bruso - Vocals; \nMark Bruso - Background vocals; \nMarty Binder - Drums; \nRon Graham - Saxophone; \nJimmie Jacobs - Guitar; \nBrian Lupo - Guitar; \nDave Specter - Guitar; \nHarlan Terson - Bass; \nRob Waters - Hammond B-3 organ, piano, background vocals; \nCarl Weathersby - Guitar.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:58dc43a018b3776936e6f1b3d95a0ea1aa12c3a0","amp;dn":"Nora+Jean+Bruso+-+2004+-+Going+Back+To+Mississippi+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58dc43a018b3776936e6f1b3d95a0ea1aa12c3a0","infoHashBuffer":{"type":"Buffer","data":[88,220,67,160,24,179,119,105,54,230,241,179,217,90,14,161,170,18,195,160]},"announce":[],"urlList":[]}}