{"title":"The Coming Storm - Paul Russell.mobi","uid":9213350,"size":808649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59e3a64cd90422d9b9470a7d4ade28861a8b00ef&amp;dn=The+Coming+Storm+-+Paul+Russell.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":1,"time":1384824645,"description":"Overview: Disaster looms over the characters in Russell's (Sea of Tranquillity) accomplished fourth novel, as repressed and expressed sexualities clash on the sedate campus of a modern-day boys' prep school in upstate New York. Tracy Parker, a handsome, affable 25-year-old, is hired as an English instructor by prim, opera-loving headmaster Louis Tremper. Louis sees Tracy as a protege, and masks his growing physical attraction as intellectual excitement. His friendship with Tracy inspires him to resume work on his long-abandoned doctoral thesis on the writings of Thomas Mann. Tracy, meanwhile, is drawn into an ill-advised, illegal love affair with Noah Lathrop III, a troubled 15-year-old student. Louis's wife, Claire, is in many ways the calm eye of this tempest. She becomes Tracy's confidant, and understands Louis's deeply closeted homosexuality. But she worries that her passivity and outward composure has dulled her soul, &quot;allowed the flame to burn so low it was in danger of extinction.&quot; Russell is adept at elucidating the emotional desert that comes from denying passion (&quot;Sometimes a clear conscience was the worst of all&quot;). By alternating points of view among Louis, Tracy, Claire and Noah, Russell ambitiously demonstrates the longings and repudiations of desire between people who love each other. The storm of the title never hits with full fury, but as Louis believes, &quot;some people, consciously or not, called the storm to themselves.&quot; Russell generously, and to melancholy effect, endows his characters with the power to temporally fend off the tempest while suffering the psychic erosion such self-protection entails.[/b]\n","torrent":{"xt":"urn:btih:59e3a64cd90422d9b9470a7d4ade28861a8b00ef","amp;dn":"The+Coming+Storm+-+Paul+Russell.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e3a64cd90422d9b9470a7d4ade28861a8b00ef","infoHashBuffer":{"type":"Buffer","data":[89,227,166,76,217,4,34,217,185,71,10,125,74,222,40,134,26,139,0,239]},"announce":[],"urlList":[]}}