{"title":"One-more-time-SexStories [DT123].pdf","uid":10188023,"size":374982,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ca6182542b1741114ce2fd9afe9bb185dd918a9&amp;dn=One-more-time-SexStories+%5BDT123%5D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Munish83","files":1,"time":1400608027,"description":"One More Time Erotic Romance Short Stories This book contains sexual content that is suitable for mature audience only. Published by Smashwords.com and Copyright 2013 by Kat VonWild 2013 republished with new cover and added stories for new readers to this author.  This book has a free version that can be found on your ereader with price match or going to Smashwords.com and utilizing Drop Box.  If you purchased this book, I know you will find it is worth the price.  This book is used for promotion by the author however cannot be resold without the author's permission.  This eBook is licensed for your personal enjoyment only and strictly fictional.  All persons, places or incidences are creative endeavors of the author. Erotic Romance Short Stories that will tantalize your steamy reading needs.  Several stories of hot sexual desire, fulfilling you with yearning and fantasy.  Each sensual story is written to entice your need for a romantic story that leads only to fulfillment with a romantic notion of sexual fantasy and tantalizing description of each steamy scene.  Leave your worries behind and let the sensual reading begin.\n","torrent":{"xt":"urn:btih:5ca6182542b1741114ce2fd9afe9bb185dd918a9","amp;dn":"One-more-time-SexStories+%5BDT123%5D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca6182542b1741114ce2fd9afe9bb185dd918a9","infoHashBuffer":{"type":"Buffer","data":[92,166,24,37,66,177,116,17,20,206,47,217,175,233,187,24,93,217,24,169]},"announce":[],"urlList":[]}}