{"title":"Silent Command System by Rick &amp; Ron Smith - Vol 1 &amp; 2","uid":9447585,"size":2691031259,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5dca66a30d57853744ea87bfe401b28ee3eed4c3&amp;dn=Silent+Command+System+by+Rick+%26amp%3B+Ron+Smith+-+Vol+1+%26amp%3B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Obesius","files":2,"time":1389118785,"description":"Vol 1: Rick Smith and Ron Smith are the products of bird dog training and knowledge. Bird dogs have been a Smith family tradition for almost a century. Rick and Ron bring to you a lifetime of experience, including everything from operating their own their own public training kennels to guiding quail hunts in South Texas; training numerous National and International Champion Field trial winners, and helping thousands of people all over the world train their gun dogs via their highly popular seminars. Running Time: 55 minutes. DVD \n\nVol 2: This DVD is the next step (intermediate level) in the Silent Command System Series.\n\nRick and Ronnie Smith will show you how to use the point of contact on the neck as a remote command with the e-collar and how to transition from the command lead to the e-collar. Also shown is point of contact on the flank area and how to place an e-collar to use the whoa command and other commands.\n\nFrom a simple whoa command to backing another dog on point in the field, the purpose is to have a dog that is under control and accepting commands at all times. By using he Silent Command System your dog will learn more easily because it doesn't have to learn our language. This eliminates the frustration that can result when dogs are pushed to fast and too hard. ","torrent":{"xt":"urn:btih:5dca66a30d57853744ea87bfe401b28ee3eed4c3","amp;dn":"Silent+Command+System+by+Rick+%26amp%3B+Ron+Smith+-+Vol+1+%26amp%3B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dca66a30d57853744ea87bfe401b28ee3eed4c3","infoHashBuffer":{"type":"Buffer","data":[93,202,102,163,13,87,133,55,68,234,135,191,228,1,178,142,227,238,212,195]},"announce":[],"urlList":[]}}