{"title":"CreativeLIVE - Intro to Photo Painting: A Creative Approach Usin","uid":9220747,"size":7062246835,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5edba8236f7f39ea028ea47143c490f5055b18cf&amp;dn=CreativeLIVE+-+Intro+to+Photo+Painting%3A+A+Creative+Approach+Usin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kr33","files":3,"time":1384931277,"description":"Intro to Photo Painting: A Creative Approach Using Corel Painter X3 with Jeremy Sutton\n\nReady to explore the software program that's changing the way photo art is created? Join creativeLIVE instructor Jeremy Sutton for an exploration of Corel Painter X3, a sophisticated tool for transforming photographs into fine art paintings. Drawing on his experience as a professional Painter artist, Jeremy will guide you step-by-step through the CorelPainter X3 interface and share his approach to painting from photo reference. Along the way, you'll learn practical tips and shortcuts for using this powerful creative tool to its full potential in an efficient and empowering way. You'll learn tips for choosing which of your images are best suited for photo painting and why. Jeremy will cover prepping images for painting, organizational systems that free you up to be creative, abstracting from the source, and resolving and refining your paintings. You'll work with Painter's brushes, paper textures, the new clone source and reference image panels, and more. By the end of this course, you'll be able to enjoy painting with Corel Painter X3 and transforming your photographs into painterly artworks. All artwork samples shown are copyright 2013 Jeremy Sutton.\n","torrent":{"xt":"urn:btih:5edba8236f7f39ea028ea47143c490f5055b18cf","amp;dn":"CreativeLIVE+-+Intro+to+Photo+Painting%3A+A+Creative+Approach+Usin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edba8236f7f39ea028ea47143c490f5055b18cf","infoHashBuffer":{"type":"Buffer","data":[94,219,168,35,111,127,57,234,2,142,164,113,67,196,144,245,5,91,24,207]},"announce":[],"urlList":[]}}