{"title":"Reynolds Price - Kate Vaiden (pdf)","uid":10144851,"size":3440101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62e2798c39b790a626c2141ed586f6ed77035553&amp;dn=Reynolds+Price+-+Kate+Vaiden+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1400039814,"description":"Reynolds Price - Kate Vaiden (Ballantine, 1986). 376 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nReynolds Price seems to have vanished from public awareness in recent years. He's about due for rediscovery, don't you think?\n\n\ndescription:\n\nFamilial dysfunction defines this Price effort--his first experiment with a first-person narrator in a full-length novel. Kate Vaiden is left parentless as a child when her father fatally shoots her mother and then himself. As an adult, Kate attests, &quot;I'd caused their deaths.&quot; She isn't the only one in such a predicament: her mother's mother died in childbirth, and the father of her child was raised an orphan. Trapped in a self-defeating cycle, Kate forever seeks stability, only to flee when it gravitates within her reach. This rich Southern tale, which won a National Book Critics Award in 1986, is slathered with Christian themes of guilt, salvation, shame and, occasionally, triumph.In middle age, Kate Vaiden begins to yearn to see the son she abandoned when she was seventeen. But if she decides to seek him, will he understand her or even want to see her? As Kate questions herself and remembers her history, a story unfolds as tragic, comic and compelling as life itself.","torrent":{"xt":"urn:btih:62e2798c39b790a626c2141ed586f6ed77035553","amp;dn":"Reynolds+Price+-+Kate+Vaiden+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62e2798c39b790a626c2141ed586f6ed77035553","infoHashBuffer":{"type":"Buffer","data":[98,226,121,140,57,183,144,166,38,194,20,30,213,134,246,237,119,3,85,83]},"announce":[],"urlList":[]}}