{"title":"Robin Roberts - Everybody's Got Something- A Memoir (epub).epub","uid":10188409,"size":2598808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:633f9373dfa7730f33c6ad6cd893f2ffc3bb12f4&amp;dn=Robin+Roberts+-+Everybody%27s+Got+Something-+A+Memoir+%28epub%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"09rms","files":1,"time":1400609884,"description":"&quot;Regardless of how much money you have, your race, where you live, what religion you follow, you are going through something. Or you already have or you will. As momma always said, &quot;Everybody's got something.&quot; \n\nSo begins beloved Good Morning America anchor Robin Roberts's new memoir in which she recounts the incredible journey that's been her life so far, and the lessons she's learned along the way. With grace, heart, and humor, she writes about overcoming breast cancer only to learn five years later that she will need a bone marrow transplant to combat a rare blood disorder, the grief and heartbreak she suffered when her mother passed away, her triumphant return to GMA after her medical leave, and the tremendous support and love of her family and friends that saw her through her difficult times. \n\nFollowing her mother's advice to &quot;make your mess your message,&quot; Robin taught a nation of viewers that while it is true that we've all got something -- a medical crisis to face, aging parents to care for, heartbreak in all its many forms --- we've also all got something to give: hope, encouragement, a life-saving transplant or a spirit-saving embrace. As Robin has learned, and what readers of her remarkable story will come to believe as well, it's all about faith, family and friends. And finding out that you are stronger, much stronger, than you think.\n\nEpub format","torrent":{"xt":"urn:btih:633f9373dfa7730f33c6ad6cd893f2ffc3bb12f4","amp;dn":"Robin+Roberts+-+Everybody%27s+Got+Something-+A+Memoir+%28epub%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"633f9373dfa7730f33c6ad6cd893f2ffc3bb12f4","infoHashBuffer":{"type":"Buffer","data":[99,63,147,115,223,167,115,15,51,198,173,108,216,147,242,255,195,187,18,244]},"announce":[],"urlList":[]}}