{"title":"Stossel.2014.05.22.[The Good New Days].Fox Business.CF.avi","uid":10211562,"size":351983464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63d813c0500cb4ddb77231697a399f39e47aed83&amp;dn=Stossel.2014.05.22.%5BThe+Good+New+Days%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1400919432,"description":"----------\n\nSTOSSEL - [The Good NEW Days] - Fox Business Network\n2014, May 22, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nDOOM AND GLOOM MEDIA: The media tell you about problems-like poverty, climate change, an energy &quot;crisis.&quot; But &quot;The Rational Optimist&quot; Author Matt Ridley says &quot;actually, things have been getting better, much better.&quot;\n\nLIFE GETS BETTER: Author Robert Bryce says most everything today is &quot;Smaller Faster Lighter Denser Cheaper.&quot;\n\nFREE MARKETS: Vox.com writer Zack Beauchamp understands things are better. He says, &quot;markets are a big part of the story... because they spark innovation.&quot; But he's also a lefty who believes is plenty of government regulation. I'll push him on that...\n\nFRACKING FEARS: Is fracking dangerous? People tell us it is. My state has banned it. But FrackNation creator Ann Mcelhinney says fracking is &quot;a marvelous thing&quot; and &quot;we need more of it, not less.&quot;\n\nMEDICAL MARVELS: Today is one of the most exciting times in history for technology and medicine. Cardiologist Dr. Kevin Campbell explains that doctors now can provide things for patients, like 3D Printer produced organs, that we never imagined were possible.\n\nHOW FAR WE'VE COME: Chris Cheng is a gay and Asian male-a twofer in terms of historic discrimination. But now he works with the NRA and makes speeches about guns. That almost certainly would not have happened in the &quot;good old days.&quot;\n\nMY TAKE: Politicians will destroy our future if they continue to ban innovation with regulation. But despite our irresponsible politicians, life has gotten better. Google will inform us about most anything within seconds. Facebook, Instagram, Skype, and email allow us to share all kinds of things. And all of it's free. If innovators can just keep creating new things faster than politicians and regulators can kill them, our future will indeed be the good NEW days.\n\n9PM ET on Fox Business Network","torrent":{"xt":"urn:btih:63d813c0500cb4ddb77231697a399f39e47aed83","amp;dn":"Stossel.2014.05.22.%5BThe+Good+New+Days%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d813c0500cb4ddb77231697a399f39e47aed83","infoHashBuffer":{"type":"Buffer","data":[99,216,19,192,80,12,180,221,183,114,49,105,122,57,159,57,228,122,237,131]},"announce":[],"urlList":[]}}