{"title":"Alex Jones Show - 2014 June 16 MO [sebaygo1]","uid":10373634,"size":69967789,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:63eac03015eea6f78e4fa027a41eb9217ff1efa1&amp;dn=Alex+Jones+Show+-+2014+June+16+MO+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sebaygo1","files":12,"time":1402964135,"description":"\nThe Alex Jones Show \nMonday, 16 June 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\nFrom the Infowars web site :: Alex covers the deteriorating situation in Iraq on this Monday, June 16 edition of The Alex Jones Show. \n\nAlex talks about the false flag unfolding in the Middle East as the U.S. embassy in Iraq is evacuated and another town falls to radical and murderous jihadist terrorists created by the CIA and the Saudis and who have captured a large swath of the country over the last week. \n\nThe Infowars crew reports from South Texas on the immigration situation as DHS detainment facilities are flooded with illegals and church groups welcome them with open arms. \n\nOn today's broadcast Alex talks with radio host, author and retired orthopedic surgeon Stan Monteith about the situation in Iraq. Dr. Monteith is the author of Iraq: The Untold Story. \n\nAlex also talks with Bruce Fein, a lawyer who specializes in constitutional and international law. Fein served as an associate deputy attorney general from 1981 to 1982 and as general counsel to the Federal Communications Commission during the Reagan administration. He talks with Alex about an article he wrote defending Kentucky Senator Rand Paul's foreign policy against an onslaught by the liberal establishment as it promotes &quot;objectless wars that promise to culminate in self-ruination.&quot;\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:63eac03015eea6f78e4fa027a41eb9217ff1efa1","amp;dn":"Alex+Jones+Show+-+2014+June+16+MO+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63eac03015eea6f78e4fa027a41eb9217ff1efa1","infoHashBuffer":{"type":"Buffer","data":[99,234,192,48,21,238,166,247,142,79,160,39,164,30,185,33,127,241,239,161]},"announce":[],"urlList":[]}}