{"title":"The Federal Zone","uid":10208639,"size":3376425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64237a15e420ee00d97bf57b6e8f681a93fde2e1&amp;dn=The+Federal+Zone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xcc394","files":42,"time":1400889479,"description":"From this guy's actual webpage.\n\n\n\n\n&quot;Founder Paul Andrew Mitchell, an advanced systems development consultant for 35 years, has spent the past sixteen years since 1990 A.D. doing a detailed investigation of the United States Constitution, federal statute laws, and the important court cases.\n\nWriting under several pen names, Mitchell's work has reached all the way into the U.S. Supreme Court, which adopted &quot;the federal zone&quot; as a household word in their sweeping 1995 decision in U.S. v. Lopez.\n\nHis massive book entitled &quot;The Federal Zone: Cracking the Code of Internal Revenue&quot; was first published in 1992, and became an instant underground success for its lucid language and indisputable legal authority.  The Appendices are available, for free, right here.\n\nMitchell has litigated important cases in State and federal courts, including the case of People v. Boxer, which established that the so-called Sixteenth Amendment was a massive fraud upon the American People.  U.S. Senator Barbara Boxer fell totally silent in the face of Mitchell's pleadings in that case.\n\nHe has also worked as Vice President for Legal Affairs and Counsel to an Arizona Trust, in a major confrontation with the federal government over tax administration policy, and as Counsel to a trespass and piracy victim whose legal strategy has attracted nationwide attention on the Internet.\n\nMitchell is also the Private Attorney General in the case of People v. United States et al., filed in the Article III District Court of the United States (&quot;DCUS&quot;) in Billings, Montana state.\n\nMitchell's work blazed a courageous new trail, on first impression, in Gilbertson's OPENING BRIEF to the Eighth Circuit Court of Appeals in St. Louis, Missouri.  This masterpiece, in 50 pages, has now withstood the test of time and remains unchallenged, and without any known errors.\n\nMitchell most recently re-focused his research on Title 28 -- the laws which govern the entire federal court system. His Press Release is an excellent introduction to this topic.\n\nIn his copyright and trademark infringement case against AOL Time Warner, Inc. et al., Mitchell has forged a comprehensive foundation and nationwide strategy for lawfully restoring the Article III District Courts of the United States. His findings are fully documented in his OPENING BRIEF, delivered to the Ninth Circuit Court of Appeals in San Francisco on March 27, 2002 A.D. and his REPLY briefs.\nHis PETITION FOR WRIT OF CERTIORARI in that case was delivered to the Supreme Court of the United States on June 6, 2003 A.D.  See also the companion PETITION FOR WRITS OF MANDAMUS in that case.\n\nJudging from the many compliments and positive comments we have received from numerous Internet users, we have every reason to expect that the Supreme Law Library will easily become an essential resource in your list of favorite digital libraries.&quot;\n\n\nThis is the guy who tried to sue Jason Scott, the operator of textfiles.org, for 2.8 billion dollars (Yes, that's billion with a B.) over copyright infringement of the entire internet (because Jason Scott runs the entire internet) and racketteering (which has fuck all to do with copyright infringement, unless you're the Russian mafia or some organized crime element.)\n\nAt any rate, here's his batshit insane book. From what I hear, (I haven't actually read it because there are actual important things to read) the main thesis is that Federal Law only applies to certain specific areas like Washington D.C. and other federal zones. This is due to his batshit crazy interpretation of the US Constitution.","torrent":{"xt":"urn:btih:64237a15e420ee00d97bf57b6e8f681a93fde2e1","amp;dn":"The+Federal+Zone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64237a15e420ee00d97bf57b6e8f681a93fde2e1","infoHashBuffer":{"type":"Buffer","data":[100,35,122,21,228,32,238,0,217,123,245,123,110,143,104,26,147,253,226,225]},"announce":[],"urlList":[]}}