{"title":"The Ostrich Factor: Our Population Myopia by Garrett Hardin","uid":10194914,"size":8075347,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64f3948720b661c14dc184e2c85072ca65a598fc&amp;dn=The+Ostrich+Factor%3A+Our+Population+Myopia+by+Garrett+Hardin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1400682749,"description":"The Ostrich Factor - Our Population Myopia (1999) by Garrett James Hardin.pdf\n\nGarrett Hardin, one of our leading thinkers on problems of human overpopulation, here assails the recklessness and basic ecological ignorance of economists and others who champion the idea of unbounded growth.\n\nHardin delivers an uncompromising critique of mainstream economic thinking. Science has long understood the limits of our environment, he notes, and yet economists consistently turn a blind eye to one feature we share with all of our planet's inhabitants--the potential for irreversible environmental damage through overcrowding. And as humankind draws ever closer to its goal of conquering our final natural enemy--disease--the fallacy of sustainable unchecked population growth becomes more and more dangerous. Moreover, Hardin argues, rampant growth will soon force us to face many issues that we will find quite unpalatable--most notably, that since volunteer population control will not work, we will have to turn to &quot;democratic coercion&quot; or &quot;mutual coercion, mutually agreed upon&quot; to limit growth, a policy that directly threatens long cherished personal rights. Challenging an array of powerful taboos, Hardin takes aim at sacred cows on both sides of the political fence--affirmative action, multiculturalism, current immigration policies, and the greed and excess of big business and &quot;growth intoxicated industrialists.&quot;\n\nHardin's forceful and cogent argument for the union of ecology and economics is a must for anyone concerned with the goal of a bountiful, yet sustainable world. Sure to spark controversy, this book underscores the urgency of our situation and reveals practical steps we must take to ensure the long term survival of humankind.\n\n176 pages\nPublisher: Oxford University Press (April 15, 1999)\nLanguage: English\nISBN-10: 0195122747\nISBN-13: 978-0195122749","torrent":{"xt":"urn:btih:64f3948720b661c14dc184e2c85072ca65a598fc","amp;dn":"The+Ostrich+Factor%3A+Our+Population+Myopia+by+Garrett+Hardin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f3948720b661c14dc184e2c85072ca65a598fc","infoHashBuffer":{"type":"Buffer","data":[100,243,148,135,32,182,97,193,77,193,132,226,200,80,114,202,101,165,152,252]},"announce":[],"urlList":[]}}