{"title":"Novak Djokovic - Serve to Win","uid":9594456,"size":3143194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:666ba12892fe23547f01275055de94425b05ae5a&amp;dn=Novak+Djokovic+-+Serve+to+Win&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ebooksports","files":3,"time":1391980092,"description":"                             Book Description\n\n\n\nIn 2011, Novak Djokovic had what has been called the greatest single season ever by a professional tennis player. He won ten titles, three Grand Slams and 43 consecutive matches. Remarkably, less than two years earlier, this champion could barely complete a tournament. How did a player once plagued by aches, breathing difficulties and injuries on court suddenly become the number-one tennis player in the world? The answer is astonishing: he changed what he ate.\n\n\nIn Serve to Win, Djokovic recounts how he survived the bombing of Belgrade, rising from a war-torn childhood to the top tier of his sport. He reveals the diet that transformed his health and pushed him to the pinnacle. While Djokovic loved and craved bread, pasta and, of course, the pizza from his family's restaurant, he found his body couldn't process wheat. Eliminating gluten made him feel instantly better, clearer, lighter and quicker. His new physical health and mental focus enabled him to achieve his two childhood dreams: to win Wimbledon and to be ranked the world's number-one tennis player.\n\n\nDjokovic challenges you to try his way of eating for just 14 days. He provides weekly menus and easy-to-prepare recipes that will help you lose weight and find your way to a better you. You don't need to be a professional athlete to start living and feeling better. A trimmer, stronger, healthier you is just two weeks away!","torrent":{"xt":"urn:btih:666ba12892fe23547f01275055de94425b05ae5a","amp;dn":"Novak+Djokovic+-+Serve+to+Win","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"666ba12892fe23547f01275055de94425b05ae5a","infoHashBuffer":{"type":"Buffer","data":[102,107,161,40,146,254,35,84,127,1,39,80,85,222,148,66,91,5,174,90]},"announce":[],"urlList":[]}}