{"title":"BornOFWar.2013.PL.HD","uid":10228244,"size":733941760,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:68143b09d06e5941fb5e65fd356862a9679c94ca&amp;dn=BornOFWar.2013.PL.HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seeass","files":1,"time":1401114428,"description":"The mountainous and remote Wakhan corridor 1988. Daphne, a young English rose finds herself in over her head. Accused of the murder of a young boy from a tribal family at a time of war between the local people and foreign invaders, she must flee for her life and take a new identity. 2011.The halls of Oxford University in England. Mina, a female student, is a beautiful misfit, living at home as she can't afford campus fees. One night her everyday life is turned upside down and all that she has assumed about who she is is destroyed in a violent invasion on her family home. Her parents are murdered and only herself and her 10 year old sister survive. They are then taken into protection, and the real truth is revealed: Mina's mother had a dark secret. Daphne was not only accused of murder back in 1988, but had an illicit and dangerous affair with the leader of the tribal family with whom she stayed. Mina is his daughter, and he wants her back. Mina is repulsed by her true identity. She tries to understand if her natural instinct to defend herself against her attackers was due to an inherited violent ability. This man, her father, is in hiding, running a rebel group in a far off place and in the process slaughtering many people, now including her family. The only way to protect her sister, all she has left, is to face him and embark upon a deadly journey into the unknown. She must now decide if it is time to fight or flee.","torrent":{"xt":"urn:btih:68143b09d06e5941fb5e65fd356862a9679c94ca","amp;dn":"BornOFWar.2013.PL.HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68143b09d06e5941fb5e65fd356862a9679c94ca","infoHashBuffer":{"type":"Buffer","data":[104,20,59,9,208,110,89,65,251,94,101,253,53,104,98,169,103,156,148,202]},"announce":[],"urlList":[]}}