{"title":"[ExploitedCollegeGirls] Cali (19 Years Old / 06.06.2014)","uid":10306427,"size":1075244280,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6a6fba7bc415ff48e8520192d9350fc5594dc9a5&amp;dn=%5BExploitedCollegeGirls%5D+Cali+%2819+Years+Old+%2F+06.06.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1402136374,"description":"[ExploitedCollegeGirls] Cali (19 Years Old / 06.06.2014)\n\nTry to ignore Cali's horrible bleach job and focus on her positive qualities: her free spirit, her nearly perfect round ass, her perky B cup tits, and her incredible cocksucking skills. As Jay interviews Cali we learn a few things: she's 19, she can squirt, she's a cam girl, she can squirt, she has amazing 34B tits, and she can squirt. Yes there is a lot of hot squirting talk from Cali, but don't believe the hype: she doesn't manage to make it happen in this update. Don't think that you are missing anything here, though. This update is great for another reason; Cali's blowjob skills.\nIn history there have been a number of people who deserve the title 'genius' for their skill at something. Beethoven in music, Basquiat in art, Von Clausewitz at war; this update allows us to add a new name to that canon of genius. Cali: genius at blowjobs. Her technique is so natural and accomplished that we can imagine other girls watching this update and realizing that they'd spent their entire sex life doing it wrong. Watch as she teases Jay with her tongue, then swallows his entire cock, and then parks the head of his dick in her throat. It's truly artistic.\nWe're as surprised as anyone that Jay didn't lose it in her mouth, but that's why he's the star he is. Eventually he gets Cali on her face on the bed and gives her a trademark ECG fucking: face down, ass up; then cowgirl, then on her back. Watch as she rubs her clit while getting fucked. When Jay notices, he hands her the vibrator and she ends up achieving a monster, body shaking orgasm.\nWhen she finally climaxes, it might have been squirtable, but at the same time Jay was filling her pussy with cum for his planned creampie and it doesn't happen. Sorry for the tease, but Cali's resulting orgasm and Jay's creampie is a very satisfactory finish to a very hot update.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7a1l7b9w8dpzx5wjszjj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7a1l7b9w8dpzx5wjszjj.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=s9wzosdzgk7bkfrj05p8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=s9wzosdzgk7bkfrj05p8.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6a6fba7bc415ff48e8520192d9350fc5594dc9a5","amp;dn":"%5BExploitedCollegeGirls%5D+Cali+%2819+Years+Old+%2F+06.06.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a6fba7bc415ff48e8520192d9350fc5594dc9a5","infoHashBuffer":{"type":"Buffer","data":[106,111,186,123,196,21,255,72,232,82,1,146,217,53,15,197,89,77,201,165]},"announce":[],"urlList":[]}}