{"title":"Adrienne Mayor - The Poison King. The Life and Legend of Mithrad","uid":10220438,"size":24900488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b06317516577e198d1fc4cc55832bdb2076b55b&amp;dn=Adrienne+Mayor+-+The+Poison+King.+The+Life+and+Legend+of+Mithrad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401035326,"description":"Description\nProduct Details\nBook Title: The Poison King: The Life and Legend of Mithradates, Rome's Deadliest Enemy\t\nBook Author: Adrienne Mayor (Author)\nHardcover: 480 pages\nPublisher: Princeton University Press (September 28, 2009)\nLanguage: English\nISBN-10: 0691126836\nISBN-13: 978-0691126838\n\n===================================================================================\nBook Description\nMachiavelli praised his military genius. European royalty sought out his secret elixir against poison. His life inspired Mozart's first opera, while for centuries poets and playwrights recited bloody, romantic tales of his victories, defeats, intrigues, concubines, and mysterious death. But until now no modern historian has recounted the full story of Mithradates, the ruthless king and visionary rebel who challenged the power of Rome in the first century BC. In this richly illustrated book--the first biography of Mithradates in fifty years--Adrienne Mayor combines a storyteller's gifts with the most recent archaeological and scientific discoveries to tell the tale of Mithradates as it has never been told before.\nThe Poison King describes a life brimming with spectacle and excitement. Claiming Alexander the Great and Darius of Persia as ancestors, Mithradates inherited a wealthy Black Sea kingdom at age fourteen after his mother poisoned his father. He fled into exile and returned in triumph to become a ruler of superb intelligence and fierce ambition. Hailed as a savior by his followers and feared as a second Hannibal by his enemies, he envisioned a grand Eastern empire to rival Rome. After massacring eighty thousand Roman citizens in 88 BC, he seized Greece and modern-day Turkey. Fighting some of the most spectacular battles in ancient history, he dragged Rome into a long round of wars and threatened to invade Italy itself. His uncanny ability to elude capture and surge back after devastating losses unnerved the Romans, while his mastery of poisons allowed him to foil assassination attempts and eliminate rivals.\nThe Poison King is a gripping account of one of Rome's most relentless but least understood foes.\n\n===================================================================================\nReviews\nFinalist for the 2009 National Book Award, Nonfiction\nWinner of the 2010 Gold Medal in Biography, Independent Publisher Book Awards\nOne of The Washington Post critics' Holiday Guide's &quot;Best Books of 2009&quot;\nHonorable Mention for the 2010 PROSE Award in Biography &amp; Autobiography, Association of American Publishers\n\n&quot;I can say without reservation that it's a wonderful reading experience, as bracing as a tonic, the perfect holiday gift for adventure-loving men and women. A finalist for [the 2009] National Book Award, it's drenched in imaginative violence and disaster, but it also wears the blameless vestments of culture and antiquity. You can have all the fun of reading about a greedy villain being put to death by being made to 'drink' molten gold, but still hide safe behind the excuse that you're just brushing up on your classics.&quot;--Carolyn See, Washington Post\n\n&quot;Mayor gives us a more nuanced view of the so-called Poison King, placing him in his proper context as a Greco-Persian ruler following in the footsteps of his purported ancestor Alexander the Great. The most compelling aspect of this story is Mayor's engaging style. A true storyteller, she makes Mithradates's world come alive. This distinctive and compelling book is sure to fascinate all readers interested in the ancient world or in understanding the historical politics of the Caucasus region.&quot;--Library Journal\n\n&quot;Thanks be to Adrienne Mayor for a definitive biography, blazing with color, presenting a magnificent cast headed by a hero who caused Rome to tremble for a quarter-century. . . . [H]is splendidly produced book is a cavalcade of intrigue, action, and slaughter. Danger, hope, fear, and love and lust are never absent.&quot;--ForeWord Reviews\n\n&quot;Mayor has specialized in writing well-researched, readable scholarship in the history of ancient science and technology, including the pre-eminent work on ancient chemical and biological warfare. It is fitting, therefore, that her first major biography tackles the life of Mithridates VI of Pontus, known for his knowledge of poisons. It is difficult to weave personal anecdotes (the lifeblood of good biography) with the technical tidbits of science, but Mayor carries it off brilliantly, as evidenced by sections describing Mithridates' youth and early scientific education in Sinope, and his extraordinary chemical knowledge at the peark of his reign. . . . The work is a marvel: part biography, part campaign history, and part scientific exploration, written in a style that makes the book a true page-turner.&quot;--Choice\n\n&quot;Mayor has done an extraordinary job of filling many gaps in the history of this contentious and foggy period. Rightly so, The Poison King was a finalist for the prestigious National Book Award and is an effort worthy of any student of history.&quot;--Lee Scott, Florida Times-Union\n\n&quot;Mayor has solid research credentials, and her command of the ancient and modern sources is extensive and impressive. The digressions offered in footnotes are enjoyable and valuable, as are the appendices offering a modern checklist for evaluating Mithradates' psychological condition. Good maps at key points in the narrative are very helpful, and the text is well written and organized chronologically. The author's interest in ancient poisons, chemicals, explosives technology, geography and regional flora and fauna allow her to expound on these subjects while telling her story. . . . Mayor's approach to the material blurs the line between history and historical fiction; one can easily imagine the narrative being turned into a television or movie script.&quot;--Richard Gabriel, Military History\n\n&quot;This is a highly coloured portrait and a very readable account of a complex individual with whom Mayor plainly has considerable empathy. The book therefore should find a wide audience and serve as an attractive introduction to its subject. . . . [Mayor] herself says, 'Mithridates' incredible saga is a rollicking good story' and she has narrated it with verve, panache and scholarly skill.&quot;--Arthur Keaveney, Bryn Mawr Classical Review\n\n&quot;Newcomers to the field will fall in love with Mayor's Mithradates. For more sober-if less compelling-accounts, they will turn to the recent studies listed in the very good, up-to-date bibliography included in The Poison King.&quot;--Laurence Totelin, Isis\n\n&quot;The prose is brilliant. . . . [W]e must regard this work as representing an important step in encouraging interest in the history of this Pontic king.&quot;--Luis Ballesteros Pastor, Ancient West &amp; East\n\n===================================================================================\nFrom the Back Cover\n&quot;Mithradates should be a household name alongside his fellow rebels Hannibal, Cleopatra, Spartacus, and Attila. This detailed, juicy, entertaining, yet painstaking work of superb scholarship should finally give Mithradates the recognition he deserves.&quot;--Margaret George, author of Helen of Troy: A Novel\n\n&quot;Meticulous in its research, exciting in its narration, ambitious in its conception, The Poison King re-creates an era when much of the Mediterranean world rebelled against Rome. At the center of it all is the fascinating and frightening king who rallied the resistance: Mithradates. Mayor has written a terrific book.&quot;--Barry Strauss, author of The Spartacus War\n\n&quot;A fascination with the byways of ancient science, a wonderful eye for the telling detail, and a relish for floating theories that is almost buccaneering: these have always been the trademarks of Adrienne Mayor. Now, with this stirring biography of the toxicologist's favorite tyrant, she parades her gift for narrative as well. Thanks to Mayor, Mithradates has emerged from the shadows at last as one of Rome's most potent and remarkable enemies.&quot;--Tom Holland, author of Rubicon: The Last Years of the Roman Republic\n\n&quot;'He died old'--so A. E. Housman refers to the subject of Adrienne Mayor's latest enthralling book, Mithradates VI, king of Pontus. Pursuing her interest in deadly chemical and biological substances, she focuses here on the life and times of the hammer of the mighty Romans in the last century of the Republic, the hellenized oriental ruler finally nailed by Pompey the Great. Ruthless, aggressive, charming, manipulative, callous--was Mithradates a textbook sociopath? Read this exhilarating and penetrating biography to find out.&quot;--Paul Cartledge, author of Alexander the Great\n\n&quot;Adrienne Mayor's The Poison King is an intriguing and highly readable new biography of one of the most controversial figures of antiquity, Mithradates--ruthless Hellenistic king, genocidaire, terrorist, alchemist, implacable enemy of Rome. It is an important contribution to our understanding of the desperate measures some rulers were prepared to take to resist Rome's iron-fisted pursuit of empire.&quot;--R. Bruce Hitchner, Tufts University\n\n===================================================================================\nAbout the Author\nAdrienne Mayor is the author of &quot;Greek Fire, Poison Arrows, and Scorpion Bombs: Biological and Chemical Warfare in the Ancient World&quot; (Overlook) and &quot;The First Fossil Hunters: Paleontology in Greek and Roman Times&quot; (Princeton). She is a research scholar in classics and history of science at Stanford University.\n\n===================================================================================\nFrom The Washington Post\nReviewed by Carolyn See\n&quot;The Poison King&quot; is, as its subtitle makes clear, the story of the life of Mithradates, leader of the ancient Black Sea kingdom of Pontus, who, in the 1st century B.C., did everything he could to overthrow the Roman Empire. I read this biography as a layperson, not a scholar, but I can say without reservation that it's a wonderful reading experience, as bracing as a tonic, the perfect holiday gift for adventure-loving men and women. A finalist for this week's National Book Award, it's drenched in imaginative violence and disaster, but it also wears the blameless vestments of culture and antiquity. You can have all the fun of reading about a greedy villain being put to death by being made to &quot;drink&quot; molten gold, but still hide safe behind the excuse that you're just brushing up on your classics. Mithradates, as the royal heir of Pontus, was trained in all the manly sports and modeled his life on heroes of yore like Alexander the Great and Hannibal. Perhaps because of his suspicious, murderous mother, he took a lively interest from his earliest years in poisons and their antidotes. Quite a few of his relatives had been or would be poisoned, so this was a sensible precaution. When his father died and he ascended the throne, he married his own sister, who imprudently cheated on him when he went away on a trip. She was done away with; his siblings, either killed or imprisoned. Along the way, he developed an all-consuming hatred of the Roman Empire, which ruled its colonies and client states mercilessly, taxing even the wealthiest families into crippling debt, then selling the debtors into slavery. And so it was that in 88 B.C., by the order of Mithradates, &quot;at least 80,000 -- perhaps as many as 150,000 -- Roman and Italian residents of Anatolia and [the] Aegean islands were massacred,&quot; reportedly in one day. It was the closest thing to genocide recorded in the Western world up to that time. Mithradates' reputation rested on that historic massacre -- and upon his extraordinary knowledge of poisons. He wasn't a very savory person, unless, perhaps, you hated the Roman Empire with all your heart. That's why this book seems so terrific to me. What would it even mean to hate the Roman Empire with all your heart? The passion here is breathtaking. The author tells us that Mithradates was portrayed as a monster by Roman historians, but to the people of what is now Turkey and surrounding areas, he was, at times, seen as a beloved hero. &quot;The Poison King&quot; provides us with both calm and distance. The author indirectly compares Mithradates to Osama bin Laden, and later, more surprisingly, to Christ. (Mithradates was also born under an auspicious star of the East and visited by wise men. And Christ himself, lest we forget, was executed by the Romans as a seditious troublemaker.) Mithradates' universal antidote, a substance he worked on for years so that he would never be poisoned, is a dream that lingers on in the modern world. A complicated potion called Mithridatium &quot;became the most popular and longest-lived prescription in history, available in Rome as recently as 1984.&quot; The past is always with us. So reading about all the corpses and catastrophes, the flocks of poisoned ducks and the hives of poisoned honey, the monarch's botched sacrifice of a virgin (stymied by bursts of supernatural laughter), the meteors and omens, and most of all the wretched death that finally caught up with this headstrong despot, can be as peaceful as it is thrilling. Things haven't improved all that much in 2,100 years, but they haven't gotten much worse, either. If you're still in a position to read &quot;The Poison King,&quot; that means you're alive and well, here on this perplexing, horrifying and beautiful Earth.\nCopyright 2009, The Washington Post. All Rights Reserved.\n===================================================================================","torrent":{"xt":"urn:btih:6b06317516577e198d1fc4cc55832bdb2076b55b","amp;dn":"Adrienne+Mayor+-+The+Poison+King.+The+Life+and+Legend+of+Mithrad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b06317516577e198d1fc4cc55832bdb2076b55b","infoHashBuffer":{"type":"Buffer","data":[107,6,49,117,22,87,126,25,141,31,196,204,85,131,43,219,32,118,181,91]},"announce":[],"urlList":[]}}