{"title":"POtHS - Creation - 82 - Drama in the Rocks and Forbidden Secrets","uid":9503574,"size":10189638195,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6cf71872475c4d60d6fdb4aed5faed635014fb48&amp;dn=POtHS+-+Creation+-+82+-+Drama+in+the+Rocks+and+Forbidden+Secrets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"POtHS11","files":94,"time":1390270980,"description":"\nPOtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\nreligious-christian-icons-337.gif\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Creation - 82 - Drama in the Rocks and Forbidden Secrets\n\n\n\nPOtHS Comment: You won't believe what they are doing in The Public Schools NOW!!!\n\nDescription:\n\nDrama in the Rocks:\nGeology - Stratification - How is Sedimentary Layering Formed?\nRocks seem innocent enough until one realises that, since the days of geologist James Hutton in 1795, the rock strata have been used to date the history of life on earth. The ages of all the fossilised remains of animals and plants featured in Natural History museums and school text books have been based on their positions in the strata. But now recent laboratory experiments have invalidated the basic principles upon which the geological time scale is founded, so putting these ages under threat.\n\nThe 30 min. episode Drama in the Rocks, included in full in this latest video, brings to the screen both the scientists and the experiments involved. Evidence is shown that the strata in which creatures were buried form sideways, and not one on top of the other as had always been thought. Fossils in lower strata could, therefore, be younger than fossils in higher strata. The level at which fossils are found is the result of wave direction, speed of current and other factors at the time of burial.\n\nThese experiments also confirm field evidence that burial must have been very rapid, as would be consistent with a great flood. Fossil sequences in successive strata are therefore more apparent than real, and cannot be used to infer evolutionary relationships.\n\nThis section also incorporates the technical film Fundamental Experiments in Stratification presented to the Lille National, and Recife International, Congresses of Sedimentology in 1993, which has received worldwide acclaim by scientists.\n\nThis video presents one of the most dramatic situations ever to confront man's thinking. It triggers off questions such as Is the earth really old? Could the supposed millions of years ages ascribed to the fossils be completely wrong ? Did dinosaurs become extinct 65 million years ago, or might they have been contemporary with mankind?\n\nThis documentary is for all the atheists and evolutionists out there that say a worldwide flood could not have created the geological layering of rocks or the fossil record. Here is scientific experiments that say you're wrong. Where is your experiments that prove your point?\n----------------------------------------------------------------------------------------------------------------\n\nPhenomenon - The Lost Archives: Science Fraud - Is the Tail Wagging the Dog:\nEpisode 6 in a documentary series that takes an in-depth look at the topics found in recently de-classified government documents.  It explores well-known issues with new information that has been sequestered from the public for over sixty years.\n\nThis episode deals with the ever-increasing scientific fraud that plagues society.  It discusses many documented incidences, various motives, and etc. which have occurred in most major fields of science and the influence of corporations and governments.  Quite disturbing, indeed.\n---------------------------------------------------------------------------------------------------------------\nEarthquakes 2012 Update:\nThis is the second study of its kind as an update to the original produced in 2010. This update applies very valuable information learned from the 2011 Japanese earthquake. This video teaching was given at Calvary Chapel Costa Mesa during the 2012 Creation Science Investigation conference which featured Dr. Walt Brown's Hydroplate Theory. www.Creationscience.com\n---------------------------------------------------------------------------------------------------------------\n\nFootprints In Stone - Forbidden History II:\nLearn of the first dinosaur fossil footprints dicovered and their historical documentary evidence.  Does the fossil record give us evidence of man and dinosaur living contemporaneously?  If there was evidence, what would be done with it and how would today's academia respond?  Journey on an adventure, digging into the past, exploring the present, and uncovering the truth about dinosaurs, man, and their footprints in stone.\nwww.footprintsinstone.com\n\nPersonal note...\nHow could any sane individual go to such lengths to blatantly lie about and destroy the evidence of our history?  How could any religion or scientist support such endeavors?  Maybe more disturbing, this is the reality in which we live!\n---------------------------------------------------------------------------------------------------------------\n\nForbbiden Pictures Revealed - Did Ron Wyatt tell the truth?\nDavid Gates interviews Dr. David Kim, who made 12 trips behind military fences in Saudi Arabia and climbed Mt. Sinai to collect evidence of a Red Sea crossing. Amazing photos and artifacts that rconfirm Ron Wyatt's initial discoveries.\n\nA Korean physician, Dr. Kim was the personal physician for the Prince of Saudi Arabia for 16 years. During this time Dr. Kim made his repeated trips down into Midian to search for traces of the Exodus and Mount Sinai which he had heard about from materials published by Ron Wyatt.\n\nBecause he was fluent in Arabic and had a personal recommendation from the Prince, with the help of local Bedoins, Dr. Kim was able to get behind the fences protected by the military. He climbed Mt. Sinai and discovered many Hebrew petroglyphs previously unknown by the public. He took thousands of pictures and collected artifacts.\n\nHere is his outstanding testimony and photographs which confirm the location of the Red Sea crossing during the Exodus. His research is an important part of the new documentary to be released called &quot;The Exodus Conspiracy&quot;\n-----------------------------------------------------------------------------------------------------------------\n\nFossils Evidence for Biblical creation:\nFossils provide remarkable support for the Bible's account of history, beginning with creation and including a global flood. This week we focus on some fossils that are very difficult to fit into the 'millions of years' timescale, but fit wonderfully with the Bible.\n\nThe Creation Magazine LIVE! TV program is a ministry of Creation Ministries International. With offices in seven countries and more PhD scientists than any Christian organization this program features cutting edge science that supports the Bible delivered in a non-technical, visually-rich, discussion-based format.\n\nRelated Articles:\nDid God create over billions of years? (http://creation.com/billions)\nA fossil is a fossil is a fossil. Right? (http://creation.com/fossil)\nThe Amazing Stone Bears of Yorkshire (http://creation.com/teddy)\nDead whales: telling tales? (http://creation.com/fossil-whales)\nWhere are all the human fossils? (http://creation.com/human-fossils)\nWhy should science make it difficult to believe the Bible? (http://creation.com/difficult)\n----------------------------------------------------------------------------------------------------------------\n\nMystery of the Sphinx:\nThe Mystery of the Sphinx, introduced American viewers to the discovery by John Anthony West and Robert Schoch that the Great Sphinx of Giza might be thousands of years older than its assumed date of 2500 BC. Narrated by Charlton Heston, the documentary provides evidence that the ancient Egyptians possessed scientific knowledge unknown to us and carried on the wisdom tradition of an earlier lost civilization.\n-------------------------------------------------------------------------------------------------------------\n\nPhenomenon The Lost Archives - Noahs Ark Found:\nThis must-see documentary is from the Phenomenon: The Lost Archives series and narrated by Dean Stockwell.  It's a documentary series that takes an in-depth look at the topics found in recently de-classified government documents and explores well-known issues with new information that has been sequestered from the public for over sixty years.  In this episode, we learn that a profound amount of obscured Top Secret government data and empirical evidence on Ron Wyatt's discovery of Noah's Ark has been intentionally hidden from the public.  Very interesting indeed.\n\nFor instance, how many knew that this site had already been identified and well-documented prior to Ron's findings?  How many knew that the former chief of staff of the United States Los Alamos National Lab and Nuclear Facility tried to steal Ron Wyatt's findings for himself?  Amazingly, he was caught buglarizing Ron's office while rummaging through his paperwork on the discovery!  Much, much more is provided in this documentary with many details never publicly announced before.\n--------------------------------------------------------------------------------------------------------------\n\nThousands...Not Billions:\nDr. Larry Vardiman of the R.A.T.E. Project discusses their 8 year intensive study and findings. Radioisotope dating has become the standard method for estimating the age of the Earth. Yet, the millions and billions of years estimated by this method conflicts with the thousands of years that the Bible indicates to be the age of the Earth. An eight-year research project designed to explore the claims of radioisotope dating for an old earth and to offer a young-earth alternative will be completed by the Institute for Creation Research and the Creation Research Society in 2005. The RATE project has found several major pieces of evidence that radioisotope dating is in error by a factor of many orders of magnitude and rocks commonly thought to be billions of years old may only be thousands of years old. This talk summarizes the project and discusses its major findings.\nTopics Include:\n\nThe Age Issue\nAssumptions of Radioisotope Dating\nRATE Hypothesis\nFindings of the RATE Group &lt;a href=&quot;\nhttp://www.nwcreation.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nwcreation.net&lt;/a&gt;\n\nNorthwest Creation Network\n23208 55th Ave W.\nMountlake Terrace, WA 98043\n206-465-1635\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;40232f2e34212334002e372332252134292f2e6e2e2534&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fbd6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6d6&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;----------------------------------------------\n\nTriceratops Horn Unearthed at Hell's Creek by Dr Don Clark:\nMark H. Armitage earned a BS in Education from Liberty University and an MS in Biology (parasitology), under Richard Lumsden (Ph.D. Rice and Dean of Tulane University's graduate program) at the Institute for Creation Research in San Diego, CA. He later graduated Ed.S. in Science Education from Liberty University and is a doctoral candidate there.\n\nMark grew up in a military family and lived in Venezuela and Puerto Rico for 15 years. He became a Christian when he was a college senior, studying plant pathology at the University of Florida, and his family withdrew support from him. http://creation.com/the-things-that-are-not\n\nHis experience in the business sector includes Olympus Corporation of America and Carl Zeiss. In 1984 he founded a microscope sales and service company and has been in business for 29 years. He was awarded a US patent for an optical inspection device in 1993.\n\n------------------------------------------------------------\n\nAlso includes the following videos...\nArchaeologists Proves God Exist\nChromosomal Fusion Zombie This is Genesis Week, episode 9, season 3\nVarious Creation short clips\n\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:6cf71872475c4d60d6fdb4aed5faed635014fb48","amp;dn":"POtHS+-+Creation+-+82+-+Drama+in+the+Rocks+and+Forbidden+Secrets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cf71872475c4d60d6fdb4aed5faed635014fb48","infoHashBuffer":{"type":"Buffer","data":[108,247,24,114,71,92,77,96,214,253,180,174,213,250,237,99,80,20,251,72]},"announce":[],"urlList":[]}}