{"title":"Free Market Fairness (2012) epub","uid":10212094,"size":505539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e70b4b9de665d5a50ea4e8ba8700a82f0e82f2d&amp;dn=Free+Market+Fairness+%282012%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookzilla","files":1,"time":1400930680,"description":"Can libertarians care about social justice? In Free Market Fairness, John Tomasi argues that they can and should. Drawing simultaneously on moral insights from defenders of economic liberty such as F. A. Hayek and advocates of social justice such as John Rawls, Tomasi presents a new theory of liberal justice. \n\n This theory, free market fairness, is committed to both limited government and the material betterment of the poor. Unlike traditional libertarians, Tomasi argues that property rights are best defended not in terms of self-ownership or economic efficiency but as requirements of democratic legitimacy. At the same time, he encourages egalitarians concerned about social justice to listen more sympathetically to the claims ordinary citizens make about the importance of private economic liberty in their daily lives. In place of the familiar social democratic interpretations of social justice, Tomasi offers a &quot;market democratic&quot; conception of social justice: free market fairness. Tomasi argues that free market fairness, with its twin commitment to economic liberty and a fair distribution of goods and opportunities, is a morally superior account of liberal justice. Free market fairness is also a distinctively American ideal. It extends the notion, prominent in America's founding period, that protection of property and promotion of real opportunity are indivisible goals. Indeed, according to Tomasi, free market fairness is social justice, American style.\n\n Provocative and vigorously argued, Free Market Fairness offers a bold new way of thinking about politics, economics, and justice--one that will challenge readers on both the left and right.","torrent":{"xt":"urn:btih:6e70b4b9de665d5a50ea4e8ba8700a82f0e82f2d","amp;dn":"Free+Market+Fairness+%282012%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e70b4b9de665d5a50ea4e8ba8700a82f0e82f2d","infoHashBuffer":{"type":"Buffer","data":[110,112,180,185,222,102,93,90,80,234,78,139,168,112,10,130,240,232,47,45]},"announce":[],"urlList":[]}}