{"title":"Cradle of Filth - Random albums for your discoragphy","uid":10186625,"size":586865221,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f2db6cd55ade8cc9b5599af296d9d0ca1c8e0c2&amp;dn=Cradle+of+Filth+-+Random+albums+for+your+discoragphy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cybr_blly","files":52,"time":1400547205,"description":"Cradle's portion of the split tape A Pungent and Sexual Miasma. (Not sure if that's spelled correctly?) APASM has a rehearsal version of Dawn of Eternity (among others) from 1993. The only thing is, it sounds like garbage. I think APASM is where the TBGR demo was originally dreamt up.\nA few songs on APASM were demos from Invoking and Orgiastic and aren't included.\n\nTotal Fucking Darkness is the 2014 remastered version, minus the instrumental. Pony up $.99 and go on Amazon if you need Fraternally Yours that bad. \nThe rare 1993 Rehearsal Tape are the extra songs on the TFD official release. Die-hard's may notice that Devil Mayfair is This Fetid Dank Oasis.\n\nThe fabled demos for Nocturnal Supremacy and A Gotic Romance do exist, they are from a 1994 Promo. They are the only 2 songs on the promo and the songs sound like they're great but the recording is horrible. \n\nPeace Through Superior Firepower was put together with youtube rips. It doesn't sound too bad, you can make the call on that one.\n\nVenus Diversa is a rip of the concert DVD that came with Evermore Darkly. \n\nManticore Extended Claws which is pretty much an entire demo album for Manticore, minus the instrumentals of course. I bought it on Amazon because I didn't see Extended Claws in a torrent on the internet anywhere and it's one of the reasons I am uploading this, my first torrent.\n\nAdest Rosa Secreta Eros from the limited fan edition of DDVA. I believe I got this and the DVD rip from Evermore from the same person's torrent. I'm too lazy to look and give you a shout but thanks buddy.\n\nHoney and Sulphur demo that I ripped from youtube because I can't find it anywhere. It was a free fanclub song or something. If anyone has the actual mp3, how about sharing?\n\nNocturnal Supremacy from Dusk and Her Embrace. It was on the Japanese CD or something. Anyway thanks to whoever I got it from. Maybe it was the DVD, Adest Rosa guy? If you want a full discography I suggest you find his torrent and DL it.  \n\nSorry it's missing a few instrumental's but I really don't have them. \n\nFeel free to leave a comment of thanks or just to talk shit, that's always fun. \n\n\n","torrent":{"xt":"urn:btih:6f2db6cd55ade8cc9b5599af296d9d0ca1c8e0c2","amp;dn":"Cradle+of+Filth+-+Random+albums+for+your+discoragphy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f2db6cd55ade8cc9b5599af296d9d0ca1c8e0c2","infoHashBuffer":{"type":"Buffer","data":[111,45,182,205,85,173,232,204,155,85,153,175,41,109,157,12,161,200,224,194]},"announce":[],"urlList":[]}}