{"title":"Sex.Pistols.The.Filth.and.The.Fury.DOCU.(MKV)sammyboblammy","uid":9508203,"size":1829549951,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6fb9551db98553dc4f00c67d996d202e944f485e&amp;dn=Sex.Pistols.The.Filth.and.The.Fury.DOCU.%28MKV%29sammyboblammy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sammyboblammy","files":-1,"time":1390354343,"description":"Title: The Filth and The Fury - A Sex Pistols Documentary\n\nRuntime: 1:47:49\n\nFile Type: .mkv\n\nSize: 1.69gb\n\nSubtitles: English\n\nVideo: H264\n\nAudio: AC3\n\nResolution: 720x388\n\nSource: The Sex Pistols: The Filth And The Fury 2000 NTSC DVD9 (thanks HorsePower)\n\n\n*Info:*\n\nA film about the career of the notorious punk rock band, the Sex Pistols.\n\n&quot;Ever get the feeling you've been cheated?&quot; sneers Johnny Rotten at the Sex Pistols' farewell performance. After seeing this picture you'll understand his disgust, but Julian Temple's sharp portrait of the ragged, raw band of working-class Brits won't leave you disappointed. The Sex Pistols left their legacy in a whirlwind 26-month reign, spitting out a caustic, confrontational brand of rock &amp; roll that became the rallying cry for angry, disaffected youths in late 1970s England and defined the punk movement.\n\nTheir story was first told two decades ago in the cynical The Great Rock and Roll Swindle, also directed by Temple but produced by the Sex Pistols' smarmy manager, Malcolm McLaren, who stage-managed the film into a self-promoting vanity project. For The Filth and the Fury, Temple turns to the four surviving band members to tell their own stories. His vibrant, vigorous direction captures the period of social unrest and alienated youth without turning into a history lesson, and shows the Pistols in all their insolent glory: spewing obscenities and gesturing lewdly to audiences and press alike, screaming out lyrics, overcoming musical limitations with pure passion and attitude. Rare, raw concert footage (including their final performance, which is appropriately enough the song &quot;No Fun&quot;) and previously unseen interviews with the deceased Sid Vicious further energize the portrait. There's even footage of the smiling band cutting cake for kids at a fundraiser with nary a nasty gesture or sneering comment. Now there's a side of the Pistols you don't see everyday.\n\n\nDirectors: Julien Temple\nProducers: Anita Camarata, Eric Gardner, Amanda Temple, Paul Webster, Jonathan Weisgal\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0236216/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0236216/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Filth_and_the_Fury&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Filth_and_the_Fury&lt;/a&gt;\n\n\n*Reviews:*\n\n&quot;Best music documentary I've ever seen!&quot;\n\nAuthor: INFOFREAKO from Perth, Australia - 4 September 2001\n\n&quot;'The Filth And The Fury' isn't only the best music-related documentary I've ever seen, but one of the best documentaries ever made on ANY subject. Julian Temple succeeds in blending archival footage of the band, various ads, rock videos, news reports, TV comedians, Olivier's 'Richard III', and recent interviews, and by this manages to put the Sex Pistols in a musical, political and CULTURAL context. If that sounds pretentious, the movie is anything but. It is fabulously entertaining but at the same time is a fascinating, insightful HONEST portrait that should appeal to both die hard fans and novices.\n\nSo few movies or TV shows treat music seriously, or show that it can be much more than mass-produced trivialized entertainment. 'The Filth And The Fury' does exactly that and is all the more powerful for it. A revelatory piece of film! I hope every rock'n'roll fan turns off MTV and watches this instead. If they did the music world would be a much better place..&quot;\n\n\n~~~~~~~~~~~~~~~~~~~~~~~\n\n\n\n&quot;The Best Rock-Doc of all Time&quot;\n\n10/10 - Author: Laurence Schwartz (lschwartz106) from NYC, US OF A - 17 December 2004\n\n&quot;Watching the first ten minutes of F &amp; T F, I can honestly say that I experienced the only true religious experience I've ever felt in the matrix of a movie theatre. I had an out-of-body experience, so completely was a swept into the world of Julian Temple's interpretation of what The Sex Pistols were, how they came to be, when they came to be, and the madness of Great Britain that allowed them to come to be. It was probably the only time cheek irony ever really worked, that is, playing majestically classical music during the opening credits. And then that marvelous segue from the lower-income housing courtyard to Johnny's blistering presence. As ferociously brilliant a film as the band itself.\n\nBut the film is more than just about the band; it's also about the fear of the establishment when its status quo is threatened, the media, and British society. The hypocrisy of the British government is ever evident when we see a public official denouncing the band as a disgusting bunch sub-human runts that are &quot;the antithesis to human-kind&quot; and then later see this and play a benefit concert and host an x-mas party for the children of striking firefighters. THAT WAS THE POINT OF THE PISTOLS in some respects. Their anger was grounded in the mistreatment of working people. Maybe it was a publicity booster, but I've seldom seen any American bands get their hands dirty and link up with Labor issues.\n\nThe film is also about Language. It seems that using racial epithets are accepted in some British circles, but airing some traditional four letter words on public television, is still taboo. Anti-drug? Certainly. Johnny Rotten comes right out and extols the evils of Heroin and we see what it can do to a human being in Sid and his ultimate demise. SEE THIS MOVIE!&quot;\n\n***I took the original DVD-9 source and fixed it up a bit brought it down to a decent size then converted into a .mkv high quality format so that everyone can enjoy it.  This DOES NOT include the prologue nor the interviews just the original documentary***\n\nthanks again to HorsePower and original ripper/encoder.  Seed back 1:1\n","torrent":{"xt":"urn:btih:6fb9551db98553dc4f00c67d996d202e944f485e","amp;dn":"Sex.Pistols.The.Filth.and.The.Fury.DOCU.%28MKV%29sammyboblammy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fb9551db98553dc4f00c67d996d202e944f485e","infoHashBuffer":{"type":"Buffer","data":[111,185,85,29,185,133,83,220,79,0,198,125,153,109,32,46,148,79,72,94]},"announce":[],"urlList":[]}}