{"title":"Battlestar Galactica fanedit Daybreak chronological v2 1080p","uid":10216311,"size":4017609577,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7202e47701607b4365f9458c7bb7651daf12d619&amp;dn=Battlestar+Galactica+fanedit+Daybreak+chronological+v2+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bsg4you","files":5,"time":1400971847,"description":"Battlestar.Galactica.fanedit.Daybreak.chronological.v2.1080p\n\nBattlestar.Galactica.fanedit.Daybreak1.Before.The.Fall.v2.1080p.mkv\nBattlestar.Galactica.fanedit.Daybreak2.Battle.Of.The.Colony.v2.1080p.mkv\n\nTHIS IS THE SAME CONTENT AS VERSION1 JUST SMALLER WITH THE SAME QUALITY\n\nBattlestar Galactica fanedit Daybreak1 Before The Fall with Blu-Ray source\nBattlestar Galactica fanedit Daybreak2 Battle Of The Colony with Blu-Ray source\nversion2 Handbrake0.9.9\n50min3sec 1,272,437,714bytes and 1hour47min56sec 2,745,085,921bytes\nV: 2-Pass Encoding (Turbo first pass) Preset = 09 (very slow) 3000Kbps AVC\nA: 5.1 384Kbps AAC\n\nThis is a new encode of the final MPEG-2/AC3 chronological fanedits of the Battlestar Galactica finale s4e19 Daybreak (150 minute extended Blu-Ray version). The original fanedits were:\nversion1 Handbrake0.9.8\n3,163,715,674bytes and 7,490,193,649bytes CRF21.5 7811-8619Kbps AVC, 5.1 448Kbps AC3\n\nThis new version2 was 2-pass encoded instead of using constant quality and the results are much smaller files with no discernible visual or audible differences. Stills and video sections were carefully evaluated during the review but if *any* issue is detected please leave a comment with the timecode describing the issue so it can be addressed as soon as possible.\n\nThe 2 parts of the fanedit are Daybreak1 Before The Fall and Daybreak2 Battle Of The Colony. Before The Fall has all the flashbacks in s4e19 Daybreak (150 minute extended Blu-Ray version) from about 2 years before the fall of the Twelve Colonies right up to the mini-series Night. The Battle Of The Colony is made up from the non-flashback portions of s4e19.\n\nDaybreak1 Before The Fall:\n* s4e19 Daybreak (150 minute extended Blu-Ray version), flashbacks\n* s4e19 Daybreak, 360p deleted scene flashbacks\n* s0e01 Night1 mini-series, 360p deleted scenes before the fall of the Twelve Colonies\n* s5e00 The Plan, one scene that was supposed to be a Daybreak flashback\n\nDaybreak1 Before The Fall scenes are collected and ordered by character:\n\n00.00-10.05 Laura Roslin\n\n10.06-20.40 Kara &quot;Starbuck&quot; Thrace and Lee &quot;Apollo&quot; Adama\n\n20.41-22.11 Sam Anders\n\n22.12-29.39 William Adama, Saul Tigh and Ellen Tigh\n* the scene with Ellen arriving at the bar was last in the broadcast but is placed when it happened\n\n29.40-30.22 Tory Foster and John Cavil with Boomer very briefly at the start\n\n30.23-38.47 Sharon &quot;Boomer&quot; Valerii, Galen Tyrol, Karl &quot;Helo&quot; Agathon and Cally Henderson\n* the Boomer and Gina Six clip is from the movie The Plan though it was originally shot as a flashback for s4e19 Daybreak\n* Boomer landing hard is a deleted scene from the mini-series, s0e01 Night; some blue screen is visible though unfinished special effects were removed\n* The Boomer and Chief &quot;I'm a very bad pilot&quot; scene is also from the mini-series and was included since it occurred during the s4e19 Daybreak flashbacks\n\n38.48-50.03 Gaius Baltar and Caprica Six\n* the last scene has the last 25 seconds of &quot;The Shape Of Things To Come&quot; added on at the end\n\nDaybreak2 Battle Of The Colony:\n* There are no s4e19 Daybreak deleted scenes that are not flashbacks so Battle Of The Colony is all 1080p. Other than removing the flashbacks, 3 changes were made for Battle Of The Colony:\n\n1) Removed 3 pieces of Starbuck dialog just before and during the climactic confrontation between Athena and Boomer:\n* &quot;Company let's move!&quot; 2.5 seconds\n* &quot;All right, this is really touching, can we get the hell out of here?&quot; 2.5 seconds\n* &quot;Eh, can we not tell her the plan?&quot; 1.5 seconds\n\n2) Removed the following 3 clips from the very end of s4e19 Daybreak:\n* The robot montage with Jimi's Watchtower playing, 35 seconds\n* HeadSix and HeadBaltar walking away on the busy city side walk, 12.5 seconds\n* The credits, 4.25 minutes\n\n3) Added a new ending that starts just after HeadBaltar says &quot;silly me ... silly, silly me&quot;:\n* A 7 minute montage of upbeat clips set to Jimi Hendrix's version of All Along the Watchtower\n\nPlease check out other Battlestar Galactica posts plus Rifftrax, Star Trek Enterprise, DC Comics, documentaries and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:7202e47701607b4365f9458c7bb7651daf12d619","amp;dn":"Battlestar+Galactica+fanedit+Daybreak+chronological+v2+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7202e47701607b4365f9458c7bb7651daf12d619","infoHashBuffer":{"type":"Buffer","data":[114,2,228,119,1,96,123,67,101,249,69,140,123,183,101,29,175,18,214,25]},"announce":[],"urlList":[]}}