{"title":"Saga v1 (2012) (Digital TPB) (Zone-Empire)","uid":10203334,"size":340079512,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:73bb140bcc3c7f3b60ed7fe9f9766636f68c3acd&amp;dn=Saga+v1+%282012%29+%28Digital+TPB%29+%28Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1400806663,"description":"Brian K. Vaughan's brilliant epic comes to life with gorgeous art by Fiona Staples. Promotional info - &quot;Winner of the 2013 Hugo award for Best Graphic Story! When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. From New York Times bestselling writer Brian K. Vaughan (Y: The Last Man, Ex Machina) and critically acclaimed artist Fiona Staples (Mystery Society, North 40), Saga is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive drama for adults. This specially priced volume collects the first six issues of the smash-hit series The Onion A.V. Club calls &quot;the emotional epic Hollywood wishes it could make.&quot; Voted one of the top graphic novels of the year by the NYT, IGN, the Examiner, and SF Weekly. Voted Best Comic of the year by MTV Geek and Best New Series by Paradox Comics. Voted a finalist in the GoodReads Best GN of 2012 contest. Named one of Time Magazine's top 10 graphic novels for 2013.&quot;\n\nThis is the digital copy of the first collected volume done by Zone-Empire. Thanks to them for their work; please seed, and enjoy! :-)\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;\t","torrent":{"xt":"urn:btih:73bb140bcc3c7f3b60ed7fe9f9766636f68c3acd","amp;dn":"Saga+v1+%282012%29+%28Digital+TPB%29+%28Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73bb140bcc3c7f3b60ed7fe9f9766636f68c3acd","infoHashBuffer":{"type":"Buffer","data":[115,187,20,11,204,60,127,59,96,237,127,233,249,118,102,54,246,140,58,205]},"announce":[],"urlList":[]}}