{"title":"Battlestar.Galactica.1980.Dvd2.e04.e05.e06.[NL].[FR].[ENG].Sub","uid":10154052,"size":4477714432,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:74b94b6d0c2b7640c2658cc52100cecd3476e34e&amp;dn=Battlestar.Galactica.1980.Dvd2.e04.e05.e06.%5BNL%5D.%5BFR%5D.%5BENG%5D.Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hendriknld","files":29,"time":1400136053,"description":"Galactica 1980 maakt gebruik van een vrijwel geheel nieuwe rolbezetting. Alle oude crewleden van de vloot zijn &quot;overleden&quot; behalve Commander Adama en Boomer die de positie als tweede in commando overneemt van Kolonel Tigh.\n\nDe serie zelf speelt zich af een generatie na de originele serie. De Galactica en zijn vloot van 220 civiele schepen hebben de aarde ontdekt. Maar ze zijn erachter gekomen dat deze geenszins in staat is zichzelf te verdedigen tegen de Cylons, iets waarop men wel gerekend had. Er wordt hierop besloten om teams van koloniale soldaten (colonial warriors) naar de aarde te sturen om incognito verschillende leden van de wetenschappelijke gemeenschap bij te staan in de hoop zo de technologische vooruitgang te versnellen.\n\nIn de serie vervangen de personages Kapitein Troy en Luitenant Dillon de populaire Kapitein Apollo en Luitenant Starbuck uit de eerdere Battlestar Galactica serie. Troy is wel de geadopteerde zoon van Apollo die Boxey werd genoemd in de originele serie. Het personage Jamie Hamilton is een journalist op de aarde.\n\nDe eerste drie afleveringen draaiden om een terugkeer in de tijd naar nazi-Duitsland waar Troy, Dillon en Jamie proberen de wetenschapper dokter Xavier te vangen en terug te brengen naar de Galactica. Deze wetenschapper is gevlucht van de Galactica omdat hij ervan overtuigd is dat de Galactica en de kolonialen het best geholpen zijn door de ontwikkeling van de nazi-technologie te versnellen. Hij ontsnapt aan het eind van de derde aflevering.\n\nNa deze drie afleveringen die door de meeste fans nog wel als goed beschouwd worden, werden de scripts zwakker en voornamelijk kinderlijker van aard, Hierdoor verliest de serie die aanvankelijk een hoog kijkcijfer had snel haar publiek. In de laatste aflevering voor de serie gestopt werd keert Starbuck, gespeeld door Dirk Benedict, weer terug naar de Galactica in een episode die een flashback is. Alhoewel deze aflevering ook door de fans hoog gewaardeerd werd en hogere kijkcijfers had dan de voorgaande afleveringen was dit niet genoeg om de serie te redden.\t\t","torrent":{"xt":"urn:btih:74b94b6d0c2b7640c2658cc52100cecd3476e34e","amp;dn":"Battlestar.Galactica.1980.Dvd2.e04.e05.e06.%5BNL%5D.%5BFR%5D.%5BENG%5D.Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74b94b6d0c2b7640c2658cc52100cecd3476e34e","infoHashBuffer":{"type":"Buffer","data":[116,185,75,109,12,43,118,64,194,101,140,197,33,0,206,205,52,118,227,78]},"announce":[],"urlList":[]}}