{"title":"POV Jugg Fuckers_4_XXX_DVDRip","uid":9457591,"size":1462319900,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:76f792b45658be60e347230e6a1633408c7e7f30&amp;dn=POV+Jugg+Fuckers_4_XXX_DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":"m21wolf","files":4,"time":1389297204,"description":"POV Jugg Fuckers_4_XXX_DVDRip\n\nStarring: Liza Del Sierra, Katie Kox, Haley Cummings, Kianna Dior, Penelope Piper, Adriana Luna, Lexington Steele, Bill Bailey, Jonni Darkko, Eva Notty, Chloe Reece Ryder, Maserati\n\nDescription: The king of first-person boob banging, director Jonni Darkko, delivers the fourth installment of the series that puts you right in the cleavage. &quot;POV Juggfuckers 4&quot; is a bodacious smorgasbord of big-breasted fun starring nine voluptuous, super-stacked vixens who utilize their forward assets, all framed by Jonni's camera with tit men in mind. That mega-buxom Asian MILF with the seductive presence, Kianna Dior, treats the director to a top-shelf dick-squeezing between her immense knockers. Kianna sucks and strokes Jonni's meat until he delivers a massive, creamy cum facial. Next is Adrianna Luna, a stunning, up-and-cumming Latina with all-natural D-cups. The exotic, bikini-clad temptress uses her sweet mouth and oiled fun bags to make Jonni's dick explode. Maserati XXX is a comely black cutie with insanely huge, brown jugs. The Nubian slut buries black stud Lex Steele in her plush whoppers, smothering his face with tit meat before wrapping her greasy, glistening balloons around his imposing shaft and getting her chest and face splashed with semen. Nasty blonde Katie Kox frees her giant hooters, coats them in oil and gets two cocks off. Katie eats cum from her tits with a spoon! The rest of the bangin' cast thick brunette slut Chloe Reece Ryder, giggly blonde bimbo Haley Cummings, pale, naturally buxom Eva Notty, Latina hottie Liza del Sierra and sultry, mysterious and busty Penelope Piper all use their physical splendor and special feminine charms to provide the very finest onscreen &quot;jugg fucking.&quot; With bra-bursting babes like these, who needs pussy?\n\nCover:\n &lt;a href=&quot;\nhttp://www.flickimg.com/TLg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/TLg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.flickimg.com/TLo&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/TLo&lt;/a&gt;\n\nThumbnail Screenshot:\n &lt;a href=&quot;\nhttp://www.flickimg.com/TLk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/TLk&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.flickimg.com/TLm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickimg.com/TLm&lt;/a&gt;\n\nDownload, Seed &amp; Enjoy :)","torrent":{"xt":"urn:btih:76f792b45658be60e347230e6a1633408c7e7f30","amp;dn":"POV+Jugg+Fuckers_4_XXX_DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76f792b45658be60e347230e6a1633408c7e7f30","infoHashBuffer":{"type":"Buffer","data":[118,247,146,180,86,88,190,96,227,71,35,14,106,22,51,64,140,126,127,48]},"announce":[],"urlList":[]}}