{"title":"[ExploitedCollegeGirls] Gia (05.22.2014)","uid":10204377,"size":883420465,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:779afa1f102d9082b15a697b32213c74e5990d1c&amp;dn=%5BExploitedCollegeGirls%5D+Gia+%2805.22.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chkm8te","files":1,"time":1400824328,"description":"[ExploitedCollegeGirls] Gia (05.22.2014)\n\nThis week a little change of pace, courtesy of Gia. She's a little curvier and a whole lot more Arab than recent girls and really adds some spice to the site. By spice I mostly mean a huge, messy creampie ending. There aren't many things in this world as nice as a slutty18 year old with D cups and Gia proves that rule once again. You can tell Jay is a fan, before he even gets the interview started he has Gia on her knees on the balcony with her amazing tits out, sucking him off until they are nearly caught by passerby.\nAfter nearly getting busted, Jay wisely steers things inside where we can get a better look at Gia, her big round ass, her perky D cups and her meaty young pussy. During the intro, she explains everything in one short sentence, &quot;Well..I'm a very horny person.&quot; These are words we've heard before and they usually mean a great update. Jay gets things off to a great start with his fingers and a pocket rocket and it only gets better. Gia drops to her knees and shows off blowjob skills that are well beyond the average 18 year old.\nWhile the trademark ECG sexual position has, for ages, been the Pin Down where Jay presses a girl into the bed and tries to fuck start her pussy from behind; we've got something new these days. Apparently our man Jay has been reading the Kama Sutra (well, there's probably an app or something) and is working out the kinks in a new position we're tentatively calling 'The Sideshow.' This is where Jay gets a girl, Gia in this case, on her side with a leg in the air and fucks her from the side. It provides a great visual for fans and great access for Jay. He can rub her pussy or slap her titties as he fucks her.\nAfter Jay manages to fuck her to a few orgasms, he loses it and fills her pussy with more cream than a Twinkie. This update turned out to be fantastic: a young slut, big naturals, great sex, The Sideshow(!) and a creampie finish!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bf6cqyv052fb5o8p4hk2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bf6cqyv052fb5o8p4hk2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=6km12bjt3q3kkh2uu9q0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=6km12bjt3q3kkh2uu9q0.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:779afa1f102d9082b15a697b32213c74e5990d1c","amp;dn":"%5BExploitedCollegeGirls%5D+Gia+%2805.22.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"779afa1f102d9082b15a697b32213c74e5990d1c","infoHashBuffer":{"type":"Buffer","data":[119,154,250,31,16,45,144,130,177,90,105,123,50,33,60,116,229,153,13,28]},"announce":[],"urlList":[]}}