{"title":"Mathematica 9","uid":10300049,"size":4839710720,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7934db043c10e545f93d4670385b9d5abe797cc3&amp;dn=Mathematica+9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1401951260,"description":"*** This is a pre-built Arch Linux 64-bit package for Mathematica 9.0, nothing else is required to install. ***\n\n\n\nFeatures\nDini's surface plotted with adjustable parameters\n\nFeatures of Mathematica include:[7]\n\n    Automatic translation of English sentences into Mathematica code[8]\n    Elementary mathematical function library\n    Special mathematical function library\n    Matrix and data manipulation tools including support for sparse arrays\n    Support for complex number, arbitrary precision, interval arithmetic and symbolic computation\n    2D and 3D data and function visualization and animation tools\n    Solvers for systems of equations, diophantine equations, ODEs, PDEs, DAEs, DDEs, SDEs and recurrence relations\n    Numeric and symbolic tools for discrete and continuous calculus\n    Multivariate statistics libraries including fitting, hypothesis testing, and probability and expectation calculations on over 140 distributions.\n    Support for censored data temporal data and unit based data\n    Calculations and simulations on random processes and queues\n    Constrained and unconstrained local and global optimization\n    Programming language supporting procedural, functional and object oriented constructs\n    Toolkit for adding user interfaces to calculations and applications\n    Tools for 2D and 3D image processing[9] and morphological image processing including image recognition\n    Tools for visualizing and analysing graphs\n    Tools for combinatoric problems\n    Tools for text mining including regular expressions and semantic analysis\n    Data mining tools such as cluster analysis, sequence alignment and pattern matching\n    Number theory function library\n    Tools for financial calculations including bonds, annuities, derivatives, options etc.\n    Group theory and symbolic tensor functions\n    Libraries for signal processing including wavelet analysis on sounds, images and data\n    Control systems libraries\n    Continuous and discrete integral transforms\n    Import and export filters for data, images, video, sound, CAD, GIS,[10] document and biomedical formats\n    Database collection for mathematical, scientific, and socio-economic information and access to WolframAlpha data and computations\n    Technical word processing including formula editing and automated report generating\n    Tools for connecting to DLLs. SQL, Java, .NET, C++, Fortran, CUDA, OpenCL and http based systems\n    Tools for parallel programming\n    Using both &quot;free-form linguistic input&quot; (a natural language user interface) [11] and Mathematica language in notebook when connected to the Internet\n","torrent":{"xt":"urn:btih:7934db043c10e545f93d4670385b9d5abe797cc3","amp;dn":"Mathematica+9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7934db043c10e545f93d4670385b9d5abe797cc3","infoHashBuffer":{"type":"Buffer","data":[121,52,219,4,60,16,229,69,249,61,70,112,56,91,157,90,190,121,124,195]},"announce":[],"urlList":[]}}