{"title":"Mint Royale - On the Ropes [1999]","uid":9518669,"size":409418201,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e0064c6d079c92989910a43d4e9d524e6237083&amp;dn=Mint+Royale+-+On+the+Ropes+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1390585085,"description":"Review by Dean Carlson  [-]\nThe decision of Manchester duo Neil Claxton and Chris Baker to try and replicate the large, loopy smirks of populist big beat was never going to be a revered move. But here are Mint Royale, spinning off of a trapeze (ooh), putting their heads in the lion's mouth (ahhh), and yes, walking that nefarious tightrope between overjoyed good times and drunken annoyance. This clown parade of being &quot;partied up&quot; does have its limits, but it's created by musicians with at least an ear for prolific rhythms and bubblegum pop. For every dire &quot;Shake It&quot; -- a gimmick-strewn, Ecstasy-fueled Motown record -- there is the Lauren Laverne-starring &quot;Don't Falter,&quot; one of the most addictive and joyously carefree summer songs ever released in the dead of winter. One often wonders if the album's timing was just off. How would a song like &quot;From Rusholme With Love&quot; fare if it came out before the big beat tide went out? As it mixes the pounding of Fatboy Slim's &quot;Build It Up, Tear It Down,&quot; the keyboard plinks from Trio's &quot;Da Da Da,&quot; and a barrage of undisputedly inventive effects, one could have pictured many a rose being thrown in the band's direction if only the album came out years before it did. For now, though, everything only seems fine if the brain is put on hold. Because On the Ropes is outdated, yes, but it's also an album that sounds simultaneously both derivative and quite fun. (3.5/5)","torrent":{"xt":"urn:btih:7e0064c6d079c92989910a43d4e9d524e6237083","amp;dn":"Mint+Royale+-+On+the+Ropes+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0064c6d079c92989910a43d4e9d524e6237083","infoHashBuffer":{"type":"Buffer","data":[126,0,100,198,208,121,201,41,137,145,10,67,212,233,213,36,230,35,112,131]},"announce":[],"urlList":[]}}