{"title":"[StrapOnxxx] Brenda, Silvia - Country Girl (04.06.14) 1080p","uid":10292958,"size":1580198550,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:82673430c411a13766676538483afa839fa238d8&amp;dn=%5BStrapOnxxx%5D+Brenda%2C+Silvia+-+Country+Girl+%2804.06.14%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Zbeast","files":-1,"time":1401882491,"description":"Brenda is a very pretty girl who I thought was going to be a tough cookie to crack but I knew that when I did, the hard work would be worth it. She came to the agency looking for work, she was already working with her partner from their home doing a web cam show but was looking to break into the industry working exclusively with her partner. Unfortunately he wasn't with her and I wasn't going to let her leave before I had sampled her wares. When I asked her about girl/girl work she was adamant that she would have to talk to her partner about it, so I tried a different approach. I found out that she had never kissed a girl or even touched another girls breast so I used that as my angle in. I got her to undress for some casting photos then started touching her boobs and saying I thought that they were very nice and then she surprised me. I must have awoken some long dormant spark of lesbian desire as she asked to see mine and I soon had both her hands clutched on my breasts. I could see curiosity mingling with desire in her eyes so after getting a kiss out of her it wasn't long before I had convinced her to do a girl/girl video also. The next thing I knew I was gliding in and out of her pussy with my strap on dildo, speeding up my tempo until if I had balls they would have been making a noise like thunder against her butt cheeks. She soon orgasmed and then it was my turn. For an inexperienced girl she devoured my pussy like a carnivore and I was soon clutching the back of her head as my orgasm engulfed me. An amazing casting with a very sexy girl, I wonder what she'll tell her partner about how her casting went?\n\nDuration: 00:32:57\nVideo: AVC (AVC) 1920x1080 25.00fps 6075Kbps\nAudio: AAC (AAC LC) 320 kb/s 48.0KHz (2 chnls)\n\nScreens:\n======== &lt;a href=&quot;\nhttp://postimg.org/image/z4q6st9xl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/z4q6st9xl/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/3ma3c55l5/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/3ma3c55l5/&lt;/a&gt;","torrent":{"xt":"urn:btih:82673430c411a13766676538483afa839fa238d8","amp;dn":"%5BStrapOnxxx%5D+Brenda%2C+Silvia+-+Country+Girl+%2804.06.14%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82673430c411a13766676538483afa839fa238d8","infoHashBuffer":{"type":"Buffer","data":[130,103,52,48,196,17,161,55,102,103,101,56,72,58,250,131,159,162,56,216]},"announce":[],"urlList":[]}}