{"title":"Winter City (001 - 006) (2013 - 2014) (Digital-Empire)","uid":10172470,"size":307294984,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:846bd113376467ba1985747a5106a9f367f25279&amp;dn=Winter+City+%28001+-+006%29+%282013+-+2014%29+%28Digital-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nemesis43","files":6,"time":1400424012,"description":"Winter City (001 - 006) (2013 - 2014) (Digital-Empire) \n\nIssue #1 - Alan McLean, a wealthy businessman, is brutally murdered in his own home. It quickly becomes clear to Detectives Daniels and Harvey that things are not what they seem when a witness claims she saw the Grim Reaper at the murder scene.\n\nIssue #2 - Another murder; this time rich playboy Franklin Skyles. Again witnesses claim to have seen the Grim Reaper. Detectives Daniels and Harvey suspect a serial killer. The trail leads the Detectives to Edward Smittz, founder and chairman of Smittzen Holdings.\n\nIssue #3 - Greedy pigs pay in flesh\n\nTwo nights and several brutal murders; the primary targets being members of the city's business elite. Eye witnesses blame the Grim Reaper, the media speculates hired hits, Detective Daniels still hasn't found any conclusive evidence. Donald Swanson becomes victim number three.\n\nIssue #4 - Slaughter in the Tower of Sloth\n\nWith no solid leads and a third murder involving a wealthy fat cat, pressure is building for Daniels and Harvey to find the killer. Edward Smittz meets in secret with some old business colleagues. Edward fears that theirs pasts are coming back to haunt them.\n\nIssue #5 - A discourse with death\n\nVernon Paul comes face-to-face with the Grim Reaper serial killer. As Vernon meets his bloody demise at the hands of Death, Detective Daniels uncovers the connection between the Reaper murder victims; a real estate investment fund called &quot;Typhoon&quot;\n\nIssue #6 - Child of heaven, forged in hell\n\nDetectives Daniels and Harvey believe they have the mysterious and violent Grim Reaper serial killer trapped inside a lavish downtown apartment building. A squad of heavily armed special tactics police are dispatched and sent into the building to apprehend the deranged murderer.","torrent":{"xt":"urn:btih:846bd113376467ba1985747a5106a9f367f25279","amp;dn":"Winter+City+%28001+-+006%29+%282013+-+2014%29+%28Digital-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846bd113376467ba1985747a5106a9f367f25279","infoHashBuffer":{"type":"Buffer","data":[132,107,209,19,55,100,103,186,25,133,116,122,81,6,169,243,103,242,82,121]},"announce":[],"urlList":[]}}