{"title":"TSR2: The Story of Britain's Most Controversial Warplane","uid":10228407,"size":70155635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:894844d6c7fb5357e657548e8eaee0157b9928bd&amp;dn=TSR2%3A+The+Story+of+Britain%27s+Most+Controversial+Warplane&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1401115673,"description":"TSR2: The Story of Britain's Most Controversial Warplane\n(Aeroplane Icons by Aeroplane Monthly)\n\nDESCRIPTION:\n\nTSR2 is an infamous acronym that has earned an important place in Britain's aviation history. It describes a project that was first established in the late 1950s, to create a new aircraft to replace the legendary Canberra jet bomber. The RAF was aware of how Soviet military capability was rapidly improving, and a new bomber was needed to fly tactical strike missions, should a war with the Soviet Union become likely. At the time it was believed that there was a very real risk of East-West conflict (this was just a few years before the Cuban Missile Crisis) and Britain had already developed a tactical atomic bomb for possible use in any European war. Although only a tactical weapon, the bomb was in fact much more powerful than the two weapons dropped on Japan more than a decade earlier. Initially, this bomb was to be carried by the Canberra, but the RAF wanted to marry the weapon to a new aircraft that could fl y at low level, hiding from Soviet radar defences, acting as both a nuclear bomber and also as a reconnaissance platform for cameras and other sensors. The RAF also wanted to have a tremendously fast aircraft that would be invulnerable to attack by Soviet aircraft and missiles, so that it would be sure of reaching its target. This was the basis for TSR2. Almost from the point of inception, TSR2 quickly became embroiled in a long saga of bad management, political indecision and confused strategic thinking. The Government backed the programme, but its projected cost was expected to be astronomical. Designing and manufacturing an aircraft that could fl y at tree top height at twice the speed of sound would be a challenge even today, but in 1960 it was a challenge that would call upon the latest advances in technological prowess. The Government's handling of the project was inept.","torrent":{"xt":"urn:btih:894844d6c7fb5357e657548e8eaee0157b9928bd","amp;dn":"TSR2%3A+The+Story+of+Britain%27s+Most+Controversial+Warplane","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894844d6c7fb5357e657548e8eaee0157b9928bd","infoHashBuffer":{"type":"Buffer","data":[137,72,68,214,199,251,83,87,230,87,84,142,142,174,224,21,123,153,40,189]},"announce":[],"urlList":[]}}