{"title":"Always Sometimes Monsters (DRM Free)","uid":10210273,"size":400797113,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8b5669a35c3d6fb999581159762c3d85ef34e15c&amp;dn=Always+Sometimes+Monsters+%28DRM+Free%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sola1212","files":1,"time":1400901340,"description":"Out of money and out of luck you find yourself heart broken and on the verge of collapse. Your landlord's taken the key back, you can't finish your manuscript, and your beloved is marrying someone else. With no choice but to handle whatever life throws at you, you set out on the open road on a mission to win back the love of your life. The story from there is up to you. Can your life be salvaged, or are we always sometimes monsters? \n\nChoice \nA story-driven experience focusing on relationships and emotional bonds rather than traditional RPG combat and adventuring. Indecision is your enemy and empathy is your weapon in a quest to earn one last chance to win back the love of your life. \n\nCircumstance \nChoose from characters of different gender, race, and sexual preference and live through the common experiences and unique hardships of each based on your selection. NPCs may treat you differently based on your gender, race, or sexual preference opening and closing different paths along the way. \n\nConsequence \nEach playthrough is filled with a staggering number of diverging paths that can be discovered through both overt actions and subtle choices in conversation. The journey you experience will be tailored to your personal ethical compass as your decisions both conscious and subconscious change your fate. \n\nAlways Sometimes Monsters is an RPG made by Vagabond Dog.  If you like it, buy it.  If not delete it.","torrent":{"xt":"urn:btih:8b5669a35c3d6fb999581159762c3d85ef34e15c","amp;dn":"Always+Sometimes+Monsters+%28DRM+Free%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b5669a35c3d6fb999581159762c3d85ef34e15c","infoHashBuffer":{"type":"Buffer","data":[139,86,105,163,92,61,111,185,153,88,17,89,118,44,61,133,239,52,225,92]},"announce":[],"urlList":[]}}