{"title":"Kansas(1974-86) 9 LP's+ 1 Live 24bit-96&amp;192khz","uid":10180326,"size":14650086660,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8bacd6a40f4b20310b7918d1f938f9da754955ce&amp;dn=%5CKansas%281974-86%29+9+LP%27s%2B+1+Live+24bit-96%26amp%3B192khz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sidmal","files":-1,"time":1400519857,"description":"Albumlist:\n\n1974 - Kansas  [Kirshner  PZ 32817 24-192}\n1975 - Song For America  [Kirshner  PZ 33385 24-192]\n1976 - Leftoverture [Kirshner  KZ 34224 24-96]\n1977 - Kansas - Providence Civic Center, 1977-12-13(24-96)\n1977 - Point Of Know Return [Kirshner KIR 82234 UK A1-B1 24-192]\n1979 - Monolith [US Kirshner, FZ 36008 24-192]\n1980 - Audio-Visions (Kirshner, KIR 84500, Holland, 24-96)\n1980 Kerry Livgren(ex. Kansas) - Seeds Of Change (Kirshner NJZ 36567 24-192)\n1982 - Vinyl confessions (Kirshner KIR 85714, 24-96)\n1986 - Power (MCA-5838, Canada, 24-96)\n\nAllmusic.com\n\nArtist Biography by Jason Ankeny \n\nFusing the complexity of British prog rock with an American heartland sound representative of their name, Kansas were among the most popular bands of the late '70s; though typically dismissed by critics, many of the group's hits remain staples of AOR radio play lists to this day. Formed in Topeka in 1970, the founding members of the group -- guitarist Kerry Livgren, bassist Dave Hope, and drummer Phil Ehart -- first played together while in high school; with the 1971 addition of classically trained violinist Robbie Steinhardt, they changed their name to White Clover, reverting back to the Kansas moniker for good upon the 1972 arrivals of vocalist/keyboardist Steve Walsh and guitarist Richard Williams. The group spent the early part of the decade touring relentlessly and struggling for recognition; initially, their mix of boogie and prog rock baffled club patrons, but in due time they established a strong enough following to win a record deal with the Kirshner label. \nKansas' self-titled debut LP appeared in 1974; while only mildly successful, the group toured behind it tirelessly, and their fan base grew to the point that their third effort, 1975's Masque, sold a quarter of a million copies. In 1976, Leftoverture truly catapulted Kansas to stardom. On the strength of the smash hit &quot;Carry on Wayward Son,&quot; the album reached the Top Five and sold over three million copies. Released in 1977, Point of Know Return was even more successful, spawning the monster hit &quot;Dust in the Wind.&quot; While the 1978 live LP Two for the Show struggled to break the Top 40, its studio follow-up, Monolith, the band's first self-produced effort, reached the Top Ten. That same year, Walsh issued a solo record, Schemer-Dreamer. \n In the wake of 1980's Audio-Visions, Kansas began to splinter; both Hope and Livgren became born-again Christians, the latter issuing the solo venture Seeds of Change, and their newfound spirituality caused divisions within the band's ranks. Walsh soon quit to form a new band, Streets; the remaining members forged on without him, tapping vocalist John Elefante as his replacement. The first Kansas LP without Walsh, 1982's Vinyl Confessions, launched the hit &quot;Play the Game Tonight,&quot; but after only one more album, 1983's Drastic Measures, they disbanded. In 1986, however, Kansas re-formed around Ehart, Williams, and Walsh; adding the famed guitarist Steve Morse as well as bassist Billy Greer, the refurbished band debuted with the album Power, scoring a Top 20 hit with &quot;All I Wanted.&quot; When the follow-up, 1988's In the Spirit of Things, failed to hit, seven years passed before the release of their next effort, Freaks of Nature. Always Never the Same followed in 1998. Seeing the return of founder singer/songwriter Kerry Livgren, Somewhere to Elsewhere was released in 2000.\nBackground information\n\n\nActive\n\n1970s - 2010s\n\n\nFormed \n\n1970 in Topeka, KS \n\n\nGenre\n\n\nPop/Rock\n\n\nStyles\n\n\nArena Rock\n\nArt Rock\n\nProg-Rock\n\nContemporary Pop/Rock\n\nAlbum Rock\n\n\nGroup Members\n\n\n Billy Greer  \n\n Dave Hope  \n\n David Ragsdale  \n\n John Elefante  \n\n Kerry Livgren  \n\n Phil Ehart  \n\n Rich Williams  \n\n Robbie Steinhardt  \n\n Steve Morse  \n\n Steve Walsh ","torrent":{"xt":"urn:btih:8bacd6a40f4b20310b7918d1f938f9da754955ce","amp;dn":"%5CKansas%281974-86%29+9+LP%27s%2B+1+Live+24bit-96%26amp%3B192khz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bacd6a40f4b20310b7918d1f938f9da754955ce","infoHashBuffer":{"type":"Buffer","data":[139,172,214,164,15,75,32,49,11,121,24,209,249,56,249,218,117,73,85,206]},"announce":[],"urlList":[]}}