{"title":"Stephen Beachy - Whistling Song (pdf)","uid":10291312,"size":2942532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cf95621c3852d86c2d896e5e0550c811dd557fc&amp;dn=Stephen+Beachy+-+Whistling+Song+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pharmakate","files":-1,"time":1401862576,"description":"Stephen Beachy - Whistling Song (Norton, 1991). 411 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThe author uses quotes from both Julio Cortazar and the Meat Puppets as epigraphs to this book, and Jim Carroll has a back cover blurb. Seems worth investigating, no?\n\n\ndescription:\n\n&quot;Writing like a possessed angel, first-novelist Beachy dreams up the adventures of a male Alice who encounters a 1980s America every bit as darkly bizarre and hilarious as Lewis Carroll's Victorian wonderland... A hypnotic, unshakable, painfully funny vision of America by a word-drunk writer.&quot; -- Kirkus Reviews\n\n\nIn this electric on-the-road novel, orphan-hero Matt hitchhikes across the surreal landscape of America in the '80s. Searching for the lost bliss of childhood he falls in with -- and longs for -- the dangerously beautiful but amoral Jimmy, a fellow orphan. As they crisscross the country, encountering homeless rock stars, suicidal teenagers, Jesus freaks, and other souls on the edge, Matt moves toward adulthood and his own sexual identity. Stephen Beachy, awarded a James Michener Grant from the Iowa Writers Workshop, now lives in San Francisco and is at work on another novel.\n","torrent":{"xt":"urn:btih:8cf95621c3852d86c2d896e5e0550c811dd557fc","amp;dn":"Stephen+Beachy+-+Whistling+Song+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf95621c3852d86c2d896e5e0550c811dd557fc","infoHashBuffer":{"type":"Buffer","data":[140,249,86,33,195,133,45,134,194,216,150,229,224,85,12,129,29,213,87,252]},"announce":[],"urlList":[]}}