{"title":"The Pursuit of Happyness - Chris Gardner read by Andre Blake.","uid":10199487,"size":331036224,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:90a74f625d9b5a700e9f56492cf01ca776e8445b&amp;dn=The+Pursuit+of+Happyness+-+Chris+Gardner+read+by+Andre+Blake.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SectorVector","files":-1,"time":1400752484,"description":"\nThe Pursuit of Happyness By Chris Gardner with Quincy Troupe, read by Andre Blake\n\n\n# ISBN-13: 9780060897888 \n# Publisher: HarperCollins Publishers\n\n# Abridged edition 2006 \n# 5 hour and 45 mins \n# ISBN: 0060897880 \n# MP3 128 kbps\n\n\n\n\nThe astounding yet true rags-to-riches saga of a homeless father who raised and cared for his son on the mean streets of San Francisco and went on to become a crown prince of Wall Street\n\n\nAt the age of twenty, Milwaukee native Chris Gardner, just out of the Navy, arrived in San Francisco to pursue a promising career in medicine. Considered a prodigy in scientific research, he surprised everyone and himself by setting his sights on the competitive world of high finance.\n\nYet no sooner had he landed an entry-level position at a prestigious firm than Gardner found himself caught in a web of incredibly challenging circumstances that left him as part of the city's working homeless and with a toddler son. Motivated by the promise he made to himself as a fatherless child to never abandon his own children, the two spent almost a year moving among shelters, &quot;HO-tels,&quot; soup lines, and even sleeping in the public restroom of a subway station. \n\n\nNever giving in to despair, Gardner made an astonishing transformation from being part of the city's invisible poor to being a powerful player in its financial district. \n\n\nMore than a memoir of Gardner's financial success, this is the story of a man who breaks his own family's cycle of men abandoning their children. Mythic, triumphant, and unstintingly honest, The Pursuit of Happyness conjures heroes like Horatio Alger and Antwone Fisher, and appeals to the very essence of the American Dream.\n\n\n\nChris Gardner,\n-------------\nis the chief executive officer of Gardner Rich &amp; Company, a multimillion-dollar brokerage with offices in New York, Chicago, and San Francisco. An avid philanthropist and motivational speaker, Gardner is a recipient of the Father of the Year Award from the National Fatherhood Initiative. He has two children and resides in Chicago and New York.\n\n-_-","torrent":{"xt":"urn:btih:90a74f625d9b5a700e9f56492cf01ca776e8445b","amp;dn":"The+Pursuit+of+Happyness+-+Chris+Gardner+read+by+Andre+Blake.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90a74f625d9b5a700e9f56492cf01ca776e8445b","infoHashBuffer":{"type":"Buffer","data":[144,167,79,98,93,155,90,112,14,159,86,73,44,240,28,167,118,232,68,91]},"announce":[],"urlList":[]}}