{"title":"Lord of the Rings Conquest (j-TAG/RGH ONLY) XBOX360","uid":10303885,"size":5691164892,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:90eb4dd867250d98c5c4f0b874e945b418dcf507&amp;dn=Lord+of+the+Rings+Conquest+%28j-TAG%2FRGH+ONLY%29+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"exdous69","files":-1,"time":1402009949,"description":"This game is for j-TAG/RGH ONLY! The file is a game rip, it does not contain an iso. this is ready to move to external and play. it has already been fixed. i also tested the rar. this file also includes a recovery record, so if there is data corruption, it can be fixed. \n\nThe Lord of the Rings: Conquest puts players into the thick of the tremendous battle over The One Ring, playing out battles from both sides of the confrontation! Conquest will let players take control of many of the characters and creatures from the series and pit them on any of the franchise's famous battlefields. From Cave-trolls to Oliphaunts to the Balrog and even Sauron, practically the entire universe will be available for battle with up to 150 characters on-screen at any one time. Up to 16 players will be able to clash online, with four players able to play cooperatively through the main campaign either online or via four-player split-screen. And with two distinct campaigns to play through, including an original take on what would happen if Sauron regained control of the One Ring, the game promises plenty of scenarios to wage battle through.","torrent":{"xt":"urn:btih:90eb4dd867250d98c5c4f0b874e945b418dcf507","amp;dn":"Lord+of+the+Rings+Conquest+%28j-TAG%2FRGH+ONLY%29+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90eb4dd867250d98c5c4f0b874e945b418dcf507","infoHashBuffer":{"type":"Buffer","data":[144,235,77,216,103,37,13,152,197,196,240,184,116,233,69,180,24,220,245,7]},"announce":[],"urlList":[]}}