{"title":"The Photograph - Oxford History of Art (Art Ebook).pdf","uid":10174613,"size":42887846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:911b4675a9fdfac5540c923c8b29b52ac612dd55&amp;dn=The+Photograph+-+Oxford+History+of+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1400450470,"description":"OUP / Pdf / 247 pag / 1997 / English / ISBN-10: 0192842005 / 40.9 MB\n\nClarke (literary and image studies, Univ. of Kent, Canterbury) contributes one of the first entries in a series of short texts now being published by Oxford that treat aspects of art history. A vast amount has been written about photography, its history, its practitioners and processes, its influences as an art medium, and its power as a documentary medium, and anyone hoping to write a succinct book on the subject is bound to come up short in one or more of these areas. This high-speed, wholly inadequate survey of photography's early years leaves out a sense of the process of discovering and extending photography's capabilities. The bulk of the subject-oriented chapters deal with photography of landscapes, cities, human forms, and events. Throughout, Clarke attempts to focus the discourse on how photographs convey their meaning. The reproduction quality is good, and the images selected from the 20th century are often quite provocative and memorable. An introductory text for large history of photography and general art history collections.?Kathleen Collins, New York Transit Museum Archives, Brooklyn\n\n&quot;For more than 170 years, photographs have redefined the way people see themselves and the world they inhabit. The story of how this happened is revealed in insightful words, but most of all, marvellous pictures, in The Photograph&quot; Kitchener-Waterloo Record\n","torrent":{"xt":"urn:btih:911b4675a9fdfac5540c923c8b29b52ac612dd55","amp;dn":"The+Photograph+-+Oxford+History+of+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911b4675a9fdfac5540c923c8b29b52ac612dd55","infoHashBuffer":{"type":"Buffer","data":[145,27,70,117,169,253,250,197,84,12,146,60,139,41,181,42,198,18,221,85]},"announce":[],"urlList":[]}}