{"title":"Cinnamon - The Courier [1997]","uid":9544433,"size":273593310,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9354e90f9e064fc7a695f50eb13b597ce6f20d19&amp;dn=Cinnamon+-+The+Courier+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391102565,"description":"Review by Stewart Mason  [-]\nAn overlooked gem from the Swedish pop explosion of the mid-'90s, Cinnamon's first U.S. release builds on the promise of their Scandinavian-only debut, Summer Meditation. A gentle, largely acoustic pop record, the album nonetheless stays on the right side of twee, with songwriting guitarist Jiri Novak providing strong, inviting melodies for singer Frida Diesen to wrap her wispy little girl voice around. A couple of songs stray into the same retro Bacharach-Spector-Morricone territory as the early Cardigans, most notably the &quot;ba-ba-ba&quot;-heavy &quot;Missing Persons File,&quot; but even that song balances the cuteness with some tougher-than-usual guitar and Stereolab by vintage synth whirs. The songs tend towards either slightness or opacity lyrically, but Novak's memorable melodies and note-perfect arrangements (with just enough vibes and muted trumpets to echo his '60s forebears, but not so many they become tiresome), along with Diesen's silkily alluring voice, makes that complaint almost besides the point. When a song has a chorus as achingly lovely as that of this album's highlight, &quot;Me As Helen of Troy,&quot; it's churlish to point out that the lyrics don't really make much sense. The Courier made almost no waves upon its release, but it's a wonderfully appealing album well worth seeking out. (4.5/5)","torrent":{"xt":"urn:btih:9354e90f9e064fc7a695f50eb13b597ce6f20d19","amp;dn":"Cinnamon+-+The+Courier+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9354e90f9e064fc7a695f50eb13b597ce6f20d19","infoHashBuffer":{"type":"Buffer","data":[147,84,233,15,158,6,79,199,166,149,245,14,177,59,89,124,230,242,13,25]},"announce":[],"urlList":[]}}