{"title":"Blank Realm - Grassed Inn (2014) [FLAC]","uid":9497168,"size":321711333,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:93f36abadd4a38d70a819bf6399826d7617ed61b&amp;dn=Blank+Realm+-+Grassed+Inn+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"politux","files":-1,"time":1390142165,"description":"\n  Blank Realm - Grassed Inn (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative, Lo-Fi, Noise\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Back to the Flood\n  02 Falling Down the Stairs\n  03 Bell Tower\n  04 Bulldozer Love\n  05 Violet Delivery\n  06 Baby Closes the Door\n  07 Even the Score\n  08 Reach You On the Phone\n\n  Blank Realm's 2012 album Go Easy wasn't widely released until the following year, so when Grassed Inn arrived at the beginning of 2014, it felt like the band's creativity was running at a breakneck pace. While that wasn't exactly true, Grassed Inn is still a marked leap forward. Go Easy suggested that Blank Realm had more potential and ambition than many of the other bands reviving fuzzy college rock from the late '80s and early '90s, and the best moments here fulfill that promise. Lead track &quot;Falling Down the Stairs&quot; shows just how much they've progressed: brisk keyboards and crystalline guitars reflect the band's dedication to pop (and their fondness for the Flying Nun sound), while the detours they take on the verse-chorus-verse path prove they haven't cleaned up their act too much. This newfound focus extends to Grassed Inn's rangier tracks as well. &quot;Bulldozer Love&quot;'s nearly nine-minute length feels purposeful instead of rambling, and the determined grooves here and the joyously anthemic opener &quot;Back to Flood&quot; feel like forces of nature. \n\n  As Blank Realm's sound gets cleaner, their influences blur together in unexpected ways: the expansive repetition of &quot;Even the Score&quot; evokes the ecstatic chug of the Velvet Underground and Spiritualized as well as the Krautrock Motorik that has always inspired them. Grassed Inn also finds the band reveling in a wider range of sounds and textures; &quot;Violet Delivery&quot;'s synths and drum machines add a different dimension to the band's psychedelic haze even as they blend in perfectly. Perhaps more importantly, Blank Realm expand their palette of moods on Grassed Inn, and some of the album's saddest moments are also the best. There's a desperation in the screeching synth that pierces &quot;Baby Closes the Door&quot;'s murky meditation on loss to its core, while &quot;Reach You on the Phone&quot; tangles tough and wistful sentiments into something thrillingly bittersweet. These trips to the dark side add even more depth to an album that's a significant step forward for Blank Realm, and some of their most enjoyable music yet.","torrent":{"xt":"urn:btih:93f36abadd4a38d70a819bf6399826d7617ed61b","amp;dn":"Blank+Realm+-+Grassed+Inn+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f36abadd4a38d70a819bf6399826d7617ed61b","infoHashBuffer":{"type":"Buffer","data":[147,243,106,186,221,74,56,215,10,129,155,246,57,152,38,215,97,126,214,27]},"announce":[],"urlList":[]}}