{"title":"Film Noir Classic - Crime in the Streets 1956 - Armored Car Robb","uid":9495870,"size":6970458112,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:94920b79421d6d52877777184db208def49a6739&amp;dn=Film+Noir+Classic+-+Crime+in+the+Streets+1956+-+Armored+Car+Robb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":-1,"time":1390106562,"description":"Film Noir Classic - Crime in the Streets 1956 - Armored Car Robbery 1956 - [DDR]\n\nFilm Noir Classic - Crime in the Streets 1956\n\nCrime in the Streets is a 1956 film about juvenile delinquency, directed by Don Siegel and based on a television play written by Reginald Rose. The play first appeared on the Elgin Hour and was directed by Sidney Lumet.\n\nThe film, starring James Whitmore and John Cassavetes, also featured actor Sal Mineo, who had previously appeared in Rebel Without A Cause. From his role in Crime in the \n\nStreets, Mineo earned a Hollywood nickname, &quot;The Switchblade Kid.&quot; Malcolm Atterbury, Virginia Gregg and future director Mark Rydell had prominent roles.\n\nSiegel adapted the play to a film by expanding some sequences but keeping much of the same cast. His credited dialogue coach on the film was Sam Peckinpah.\n\n    CAST:-\n    James Whitmore as Ben Wagner\n    John Cassavetes as Frankie Dane\n    Sal Mineo as &quot;Baby&quot; Gioia\n    Virginia Gregg as Mrs. Dane\n    Malcolm Atterbury as McAllister\n    Mark Rydell as Macklin\n\nDirected by Don Siegel\nWritten by Reginald Rose\nMusic by Franz Waxman\nRunning time 91 min.\n\nMOVIE REVIEW:- Crime in the Streets (1956)\nAfter a rumble between New York City street gangs, the Hornets and Dukes, a youth is taken captive and threatened with a zip gun by Lenny Daniels, one of the Hornets. The act is witnessed by a neighbor, McAllister, who tells the cops.\n\nLenny is arrested and sentenced to a year in jail. Hornets leader Frankie Dane decides to get even. Seemingly incorrigible, 18-year-old Frankie resists all efforts to get through to him by social worker Ben Wagner or his worried mother, who was abandoned by Frankie's father when he was eight.\n\nFrankie threatens McAllister, who isn't afraid of Frankie. McAllister even slaps him, then walks away. An angry Frankie then enlists friends Lou Macklin and Angelo &quot;Baby&quot; Gioia to assist in killing McAllister, which frightens Frankie's 10-year-old brother Richie, who overhears the plotting.\n\nBaby's dad slaps Baby and orders, then pleads with him to stop hanging out with the no-good Frankie. An effort is made by Wagner to understand the boys rather than be angry with them, and Richie tells him of Frankie's plans to commit a murder. Wagner talks to Frankie, seemingly to no avail. The three conspirators fake going to bed, (to later use as their alibi) to wait until the agreed upon time to act. McAllister is trapped in an alley at 1:30 in the morning by the three. Richie stops his brother just-in-time, but ends up with a knife held to his throat by angry Frankie, while McAllister and other two run off, as the intended victim yells for help. Wagner appears due to the commotion, and watches as Frankie finally comes to his senses and lets his brother go. He is then accompanied by Wagner to the approaching police.\n\n\n=========================================\n\nFilm Noir Classic -  Armored Car Robbery 1956\n\nArmored Car Robbery is a 1950 film noir directed by Richard Fleischer, and starring Charles McGraw. The movie was filmed on location in Los Angeles, California.\n\nArmored Car Robbery is a heist movie, a sub-genre of crime-based films. It tells the story of a well-planned robbery of cash from an armored car when it stops at a sports stadium. The heist goes awry and a tough Los Angeles cop sets off in hot pursuit of the culprits.\n\n    CAST:-\n    Charles McGraw as Lt. Jim Cordell\n    Adele Jergens as Yvonne LeDoux aka Mrs. Benny McBride\n    William Talman as Dave Purvis aka Martin Bell\n    Douglas Fowley as Benny McBride\n    Steve Brodie as Al Mapes\n    Don McGuire as Detective Danny Ryan\n    Don Haggerty as Detective Driving Final Pursuit Car\n    James Flavin as Lt. Phillips\n    Gene Evans as William 'Ace' Foster\n\nDirected by Richard Fleischer\nProduced by Herman Schlom\nScreenplay by Gerald Drayson Adams, Earl Felton\nStory by Robert Leeds, Robert Angus\nMusic by Roy Webb\nRunning time 67 minutes\n\nMOVIE REVIEW:- Armored Car Robbery (1950)\nMastermind Dave Purvis (William Talman) is a professional criminal who devises a scheme to rob an armored car on its last pickup of the day. He recruits Benny McBride, who brings Mapes &amp; Foster to complete the gang of thieves.\n\nBenny needs money because Yvonne (Adele Jergens), his striptease artist wife, has lost interest in him and is seeing another man. Unbeknownst to Benny, the man she is two-timing him with is Purvis.\n\nThe robbery itself, at Wrigley Field in Los Angeles, begins as planned but goes badly wrong when a passing police patrol car intervenes. Purvis kills one of the police officers from the patrol car and he and his fellow robbers make their getaway. Lt. Jim Cordell (Charles McGraw), the dead policeman's partner, takes it upon himself to bring in his partner's killer and throws himself into the case, assisted by a rookie officer.\n\nMeanwhile, Purvis's gang unravels bit by bit as distrust and paranoia begins to build. Benny, wounded by police during the heist, is killed by Purvis as he demands his share of the loot from the robbery and attempts to seek medical help. Foster is killed by the police as the three attempt escape. After Mapes (Steve Brodie) gets away, he looks up Yvonne at the Burly Q where she works, intending to use her as a means to find Purvis, who has kept all the loot for himself. The waiting police, however, arrest Mapes at the Burly Q and learn Purvis's identity.\n\nAfter a further manhunt, Lt. Cordell and his team corner Purvis and Yvonne at Los Angeles Metropolitan Airport, and Purvis is crushed by a taking-off plane as he tries to escape across the tarmac.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 158 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 158 mins","torrent":{"xt":"urn:btih:94920b79421d6d52877777184db208def49a6739","amp;dn":"Film+Noir+Classic+-+Crime+in+the+Streets+1956+-+Armored+Car+Robb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94920b79421d6d52877777184db208def49a6739","infoHashBuffer":{"type":"Buffer","data":[148,146,11,121,66,29,109,82,135,119,119,24,77,178,8,222,244,154,103,57]},"announce":[],"urlList":[]}}