{"title":"299 Days: The 17th irregulars - Glen Tate","uid":10196460,"size":519507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9558ec7785e3283b18ad3aa0b8299d9055ff9b33&amp;dn=299+Days%3A+The+17th+irregulars+-+Glen+Tate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DaRule762","files":-1,"time":1400698123,"description":"In some ways, post-Collapse life at Pierce Point resembles the every day normalcy that Grant and others still hoped would return. The community is organized and humming along smoothly, the young guys on the Team are partnering off with local &quot;Team Chicks,&quot; and Grant's daughter has found a boyfriend. For most, the new reality has been accepted and a calm, self-sustaining groove is setting in.\n\nFor others, though, life is far from normal. Special Forces Ted returns with an offer that cannot be refused. In the blink of an eye, Grant Matson has another title he can add to father-of-the-year and prepper-in-chief: Lieutenant Grant Matson, Commander of the 17th Irregulars. Grant and the Team are whisked away to Marion Farm, where they will train civilians and be trained to become a special squad in a Special Forces guerrilla group. The slower, simple life at Pierce Point is about to disappear to make way for a community that is well-trained and battle-ready, posed to fight the Loyalist opposition. This cannot happen fast enough, though. Gangs are growing steadily and the government is becoming a bigger threat to freedom and the nation. Violence is turning into an everyday occurrence outside of Pierce Point and it is only a matter of time before the peaceful community will need to protect itself from external dangers. Grant feels the weight on his shoulders as he now needs to protect not just his family, but the entire community, and possibly, all of Washington State.","torrent":{"xt":"urn:btih:9558ec7785e3283b18ad3aa0b8299d9055ff9b33","amp;dn":"299+Days%3A+The+17th+irregulars+-+Glen+Tate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9558ec7785e3283b18ad3aa0b8299d9055ff9b33","infoHashBuffer":{"type":"Buffer","data":[149,88,236,119,133,227,40,59,24,173,58,160,184,41,157,144,85,255,155,51]},"announce":[],"urlList":[]}}