{"title":"Austin Sarat - States of Violence. War, Capital Punishment, and ","uid":10215663,"size":1878873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9755b70b6456d9d2dade10d26e84802597a3babb&amp;dn=Austin+Sarat+-+States+of+Violence.+War%2C+Capital+Punishment%2C+and+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1400960335,"description":"Description\nProduct Details\nBook Title: States of Violence: War, Capital Punishment, and Letting Die\t\nBook Author: Austin Sarat, Jennifer L. Culbert\nPaperback: 332 pages\nPublisher: Cambridge University Press; 1 edition (April 27, 2009)\nLanguage: English\nISBN-10: 0521699762\n\n===================================================================================\nBook Description\nPublication Date: April 27, 2009 | ISBN-10: 0521699762 | Edition: 1\nThe book brings together scholarship on three different forms of state violence, examining each for what it can tell us about the conditions under which states use violence and the significance of violence to our understanding of states. The contributors to this book demonstrate that states of violence thus have a history and sociology. Yet wherever the state acts violently, the legitimacy of its acts must be engaged with the real facts of war, capital punishment, and the ugly realities of death. This book calls into question the legitimacy of state uses of violence and mounts a sustained effort at interpretation, sense making, and critique. It suggests that condemning the state's decisions to use lethal force is not a simple matter of abolishing the death penalty or - to take another exemplary example of the killing state - demanding that the state engage only in just (publicly declared and justified) wars, pointing out that even such overt instances of lethal force are more elusive as targets of critique than one might think. Indeed, altering such decisions may do little to change the essential relationship of the state to violence. To change that relationship we must also attend to the violent state as a state of mind, a state of mind that is not just a social or psychological condition but also a moral commitment and/or a philosophical position.\n\n===================================================================================\nReview\n&quot;This well-rounded collection of essays asks the reader to re-configure how we think of a state's decision to use violence. It is not about the insistence of its citizens that the state only engage in justified acts of violence or about eliminating capital punishment, but rather how we evaluate the relationship between the sovereign state and its citizens.... It would therefore be remiss, not only for those already interested in issues dealing with states of violence, but also the novice reader, not to pick up a copy of this edited volume since it illuminates a state-constructing narrative and how discussions of 'war, punishment and structural violence,' once discussed separately, can illuminate each other by discussing them side by side.&quot;\n- Kimberley Fletcher, Law and Politics Book Review\n\n===================================================================================\nBook Description II\nThis book brings together scholarship on three different forms of state violence, examining each for what it can tell us about the conditions under which states use violence and the significance of violence to our understanding of states. This book calls into question the legitimacy of state uses of violence and mounts a sustained effort at interpretation, sense making, and critique.\n\n===================================================================================\nAbout the Author\nAustin Sarat is William Nelson Cromwell Professor of Jurisprudence and Political Science, Five College Fortieth Anniversary Professor, and Senior Advisor to the Dean of the Faculty at Amherst College. Professor Sarat founded both Amherst College's Department of Law, Jurisprudence, and Social Thought and The Association for the Study of Law, Culture, and the Humanities, a national scholarly association. He is former President of that association and has also served as President of the Law and Society Association of the Consortium of Undergraduate Law and Justice Programs. He is author or editor of more than sixty books, including The Killing State: Capital Punishment in Law, Politics, and Culture; When the State Kills: Capital Punishment and the American Condition; The Cultural Lives of Capital Punishment: Comparative Perspectives; Law, Violence, and the Possibility of Justice; Pain, Death, and the Law; Mercy on Trial: What It Means to Stop an Execution; When Law Fails: Making Sense of Miscarriages of Justice; and Capital Punishment, two volumes. His most recent book is The Road to Abolition? He is currently writing a book entitled Hollywood's Law: What Movies Do for Democracy. He is editor of the journal Law, Culture and the Humanities and of Studies in Law, Politics, and Society. Professor Sarat has received numerous prizes and awards, including the Harry Kalven Award, given by the Law Society Association for 'distinguished research on law and society'; the Reginald Heber Smith Award, given biennially to honor the best scholarship on 'the subject of equal access to justice'; and the James Boyd White Award from the Association for the Study of Law, Culture, and the Humanities, given for distinguished scholarly achievement and 'outstanding and innovative' contributions to the humanistic study of law.\nJennifer L. Culbert is an Associate Professor in the Political Science department at Johns Hopkins University where she teaches courses in political theory and jurisprudence. She is the author of Dead Certainty: The Death Penalty and the Problem of Judgment (Stanford University Press, 2008).\n===================================================================================","torrent":{"xt":"urn:btih:9755b70b6456d9d2dade10d26e84802597a3babb","amp;dn":"Austin+Sarat+-+States+of+Violence.+War%2C+Capital+Punishment%2C+and+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9755b70b6456d9d2dade10d26e84802597a3babb","infoHashBuffer":{"type":"Buffer","data":[151,85,183,11,100,86,217,210,218,222,16,210,110,132,128,37,151,163,186,187]},"announce":[],"urlList":[]}}