{"title":"Laura Lippman - What the Dead Know (Retail)","uid":10207368,"size":1435321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a8a9dbf7e8526113e6f6018d62d21723e303ce8&amp;dn=Laura+Lippman+-+What+the+Dead+Know+%28Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheRose88","files":1,"time":1400865316,"description":"Laura Lippman - What the Dead Know - Retail (epub)\n\n\nThirty years ago two sisters disappeared from a shopping mall. Their bodies were never found and those familiar with the case have always been tortured by these questions: How do you kidnap two girls? Who--or what--could have lured the two sisters away from a busy mall on a Saturday afternoon without leaving behind a single clue or witness?\n\nNow a clearly disoriented woman involved in a rush-hour hit-and-run claims to be the younger of the long-gone Bethany sisters. But her involuntary admission and subsequent attempt to stonewall investigators only deepens the mystery. Where has she been? Why has she waited so long to come forward? Could her abductor truly be a beloved Baltimore cop? There isn't a shred of evidence to support her story, and every lead she gives the police seems to be another dead end--a dying, incoherent man, a razed house, a missing grave, and a family that disintegrated long ago, torn apart not only by the crime but by the fissures the tragedy revealed in what appeared to be the perfect household.\n\nIn a story that moves back and forth across the decades, there is only one person who dares to be skeptical of a woman who wants to claim the identity of one Bethany sister without revealing the fate of the other. Will he be able to discover the truth?","torrent":{"xt":"urn:btih:9a8a9dbf7e8526113e6f6018d62d21723e303ce8","amp;dn":"Laura+Lippman+-+What+the+Dead+Know+%28Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a8a9dbf7e8526113e6f6018d62d21723e303ce8","infoHashBuffer":{"type":"Buffer","data":[154,138,157,191,126,133,38,17,62,111,96,24,214,45,33,114,62,48,60,232]},"announce":[],"urlList":[]}}