{"title":"Bones.S08.720p.READNFO.WEB-DL.DD5.1.H.264-ECI","uid":10194286,"size":34535712771,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9c593544005fff9375e7c9a4e4efb5ab74a99c40&amp;dn=Bones.S08.720p.READNFO.WEB-DL.DD5.1.H.264-ECI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"curtzxion","files":-1,"time":1400678462,"description":"Season 08\nTo Unravel A Murder, You Have To Strip It To The Bone. / Bones is an investigative drama following the exploits of Dr. Temperance Brennan , a top forensic anthropologist. Dr. Brennan heads up a team at the Jeffersonian Institute that works to identify remains that cannot otherwise be identified by traditional means. She also works hand-in-hand with law enforcement organizations, using her unique talents to see past the obvious and find the hidden clues others may not see. / Special Agent Seeley Booth , a former Army Ranger Sniper working in the FBI's Homicide Investigations Unit, teams up with Dr. Brennan, or &quot;Bones&quot; as he soon nicknames her, and they often clash on how best to approach a case. Booth and his no-nonsense attitude towards scientists -- &quot;squints&quot; as he often calls them -- finds him preferring to get answers from witnesses and investigations, but working with Dr. Brennan he comes to see that the science behind the crime is often just as important as the witnesses. / Dr. Brennan's team includes Dr. Jack Hodgins , a forensic scientist specializing in entomology and biological and geological trace evidence; Angela Montenegro , Dr. Brennan's best friend and a facial reconstructionist; Cam Saroyan , the Jeffersonian coroner; and Lance Sweets , an FBI psychologist who lends his unique behavioral analysis background to the investigations.\n\nGenre: Comedy, Crime, Drama\nCountry: US","torrent":{"xt":"urn:btih:9c593544005fff9375e7c9a4e4efb5ab74a99c40","amp;dn":"Bones.S08.720p.READNFO.WEB-DL.DD5.1.H.264-ECI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c593544005fff9375e7c9a4e4efb5ab74a99c40","infoHashBuffer":{"type":"Buffer","data":[156,89,53,68,0,95,255,147,117,231,201,164,228,239,181,171,116,169,156,64]},"announce":[],"urlList":[]}}