{"title":"Sodomania 20: For Members Only (Elegant Angel) XXX (DVDRip)","uid":10232509,"size":1903582800,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a33d1ef98c927bec68acd756850f35bd47aab2f5&amp;dn=Sodomania+20%3A+For+Members+Only+%28Elegant+Angel%29+XXX+%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xuluhulu","files":1,"time":1401148756,"description":"Neighborhood Watch: When tall, leggy, Anita Blonde, goes into the garden for her first fag of the day, her nosy neighbor, TT Boy, points out the dangers of smoking and gives her something meatier to suck on. Tough shag up against the tree is really what she needs. Body Double: Things go wrong in the sex toy warehouse when thick packer, Tom Byron, overdoses on 'pecker pills' and starts to hallucinate. Playing second fiddle to an inflatable dolly may not be very flattering but a damn good dicking from the maestro himself probably soothed Leanna Hart's injured pride. Mallice in Chains: Stunning black haired Anita Dark and black stud Sean Michaels act out their 'Slave and Master' fantasies. Later they will change roles and he will become her slave. Right Place at the Right Time: Short skirted slut, Alexandra Silk, phones Roscoe at just the right time. She wants to audition for a porno movie and he has two European studs in his office ready and willing to give her a go. Epic anal and double penetration makes this a genuine test of the girl's suitability. Out of Sight, Out of Mind: Home alone housewife, Raven McCall, is frightened by the scary but harmless local retard, TT Boy. The thought that he might be an escaped predator clearly appeals to her deepest, darkest fantasies and he reacts by turning into the aggressive sexual pervert she wants him to be. She lets him fuck her in the ass then takes his spurting cock in her mouth.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://imghoney.com/viewer.php?file=06196017899152136013.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghoney.com/viewer.php?file=06196017899152136013.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://imghoney.com/viewer.php?file=10366063847203520322.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghoney.com/viewer.php?file=10366063847203520322.jpg&lt;/a&gt;\n\n\nCAST:\n\nAlexandra Silk, Anita Blond, Anita Dark, Leanna Heart, Raven McCall, Reinhardt, Sean Michaels, Tom Byron, TT Boy, Zenza Raggi\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:a33d1ef98c927bec68acd756850f35bd47aab2f5","amp;dn":"Sodomania+20%3A+For+Members+Only+%28Elegant+Angel%29+XXX+%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33d1ef98c927bec68acd756850f35bd47aab2f5","infoHashBuffer":{"type":"Buffer","data":[163,61,30,249,140,146,123,236,104,172,215,86,133,15,53,189,71,170,178,245]},"announce":[],"urlList":[]}}