{"title":"Jolie Holland - Wine Dark Sea [2014][EAC/FLAC]","uid":10211298,"size":345117428,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a434f62c48d988f8bd70cde72224127baf792a84&amp;dn=Jolie+Holland+-+Wine+Dark+Sea+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dickspic","files":31,"time":1400913096,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Anti #87280\nCountry: USA\nYear: May 20, 2014\nGenre: Americana\nFormat: CD,Album\n\n\n01 On And On\n02 First Sign of Spring\n03 Dark Days\n04 Route 30\n05 I Thought It Was The Moon\n06 The Love You Save\n07 All The Love\n08 Saint Dymphna\n09 Palm Wine Drunkard\n10 Out On The Wine Dark Sea\n11 Waiting For The Sun\n\n\nSinger and songwriter Jolie Holland has immersed herself in the love of the various American musics since the very beginning of her career. From country and folk to blues, gospel, jazz, and 19th century parlor songs, she has always translated these forms with uncommon depth and understanding in her uniquely revealing songs. That said, Wine Dark Sea is somewhat of a departure. Her players -- two drummers, three additional guitarists (all of whom often play simultaneously), and reeds, winds, and bass -- come from the more experimental side of New York's music scene. They ramble, stab, and clatter through these energetic, visceral arrangements that rely as much on her elliptical musical direction as they do improvisational acumen. It's a raw, often raucous presentation, balanced by Holland's mature poetic vision and her continued exploration of American musical forms. She effortlessly links them, one source to another, as seemingly disparate performance styles are filtered through a universal language, the love song, and all 11 tracks here are just that; Holland's are filled with tenderness, ferocity, fearlessness, and unfettered desire. Elizabeth Cotton meets Jimmy Reed and the Velvets in &quot;On and On,&quot; with spiraling, scorching guitar breaks inside a bright melody and choogling tempo. Stephen Foster comes toward James Booker in the lovely ballad &quot;First Sign of Spring.&quot; John Lee Hooker's house rent boogie drives &quot;Dark Days,&quot; but it's informed by Blind Willie McTell's melodic sweetness, even as screaming, fragmented guitars push at the margins. &quot;Route 30&quot; is a strolling country blues; its subtle twists and turns nod at Hank Williams. No one has ever covered Joe Tex like Holland. His &quot;The Love You Save&quot; is performed in duet with Chanticleer Tru, strained through Memphis soul and Albert Collins' Texas blues. &quot;All the Love&quot; is a glorious soul tune, but Doug Wieselman's distorted clarinet solo sounds like it was poured through a broken Leslie speaker. It's abetted by a twin drum shuffle that could have come from Willie Mitchell's Hi studio. &quot;Saint Dymphna&quot; is a gorgeous Cajun waltz drenched in Southern Gothic poetry; its tempo like a lost couple's dance on the morning after Mardi Gras. On &quot;Palm Wine Drunkard,&quot; St. Louis blues testifies with a carny barker's conviction, Holland delivers a stellar violin break with a tuba providing the bassline. The brooding, spooky title track relies on Hooker's boogie, and cavernous, multi-layered percussion. This is where Zora Neale Hurston's Tell My Horse encounters Dr. John's &quot;I Walk on Gilded Splinters.&quot; Closer &quot;Waiting for the Sun&quot; is funky, strutting Southern R&amp;B. Its squalling, no-wave guitar break lends wings to Wieselman's gutbucket saxophone choir. Holland's vocal drips with emotion like honey from her lips. Her creative investment in experimental musics to further her reach on Wine Dark Sea takes her deeper and wider than any place she's been before. Holland not only delivers her most intuitively crafted and realized collection to date, but she expands the boundaries and possibilities for American roots music in the process.","torrent":{"xt":"urn:btih:a434f62c48d988f8bd70cde72224127baf792a84","amp;dn":"Jolie+Holland+-+Wine+Dark+Sea+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a434f62c48d988f8bd70cde72224127baf792a84","infoHashBuffer":{"type":"Buffer","data":[164,52,246,44,72,217,136,248,189,112,205,231,34,36,18,123,175,121,42,132]},"announce":[],"urlList":[]}}