{"title":"Walrus - Walrus (1970) - SHM-CD","uid":10187852,"size":313722045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4bbaf741aa15dbd6a6ede7bedc2e5a6ce1cf3eb&amp;dn=Walrus+-+Walrus+%281970%29+-+SHM-CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"willemdevries","files":12,"time":1400604571,"description":"\nCD rip with art.\n\n &lt;a href=&quot;\nhttp://bayimg.com/CAOIBAafe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CAOIBAafe&lt;/a&gt;\n\n\n\nWalrus biography\n\nIn the late sixties, bassist Steve HAWTHORN came up with an idea to fuse rock and jazz. By 1969, he'd formed WALRUS, an eight-piece monster (the band's roster in the tradition of large orchestral groups would fluctuate many times throughout Walrus's short career) and the band toured heavily around the London area.\n\nIn June of the same year, WALRUS was picked up by Decca Records, handed some money, and told to produce an album. Their self-titled debut was released in December [though technically a 1970 release] on Decca's Deram label with Hawthorn on bass along with John SCATES on guitars, Barry PARFITT on keyboards, Nick GABB's &amp; Roger HARRISON's drums, the vocals of Noel GREENAWAY, and Don RICHARDS, Roy VOCE &amp; Bill HOAD on various brass instruments, the track &quot;Who Can I Trust?&quot; being pushed as the single.\n\nHowever, the outfit was not to be. Another album was never realized and by 1972, despite having attained a large and faithful live following, the band split up. Among the many WALRUS alumni, only occasional percussionist Ian MOSELY went on to musical success, becoming a member of MARILLION.\n\nAlthough HAWTHORN's dream was for Walrus to become a fusion of jazz &amp; rock, the band's style is more reminiscent of orchestral early blues a la JETHRO TULL or ROOM. However, it is progressive blues with the lengthy jams of Tull mixed together with the chaos of AMON DUUL II and a touch of early KING CRIMSON to keep everyone sane. A rare treat for fans of early 70s classic prog.\n","torrent":{"xt":"urn:btih:a4bbaf741aa15dbd6a6ede7bedc2e5a6ce1cf3eb","amp;dn":"Walrus+-+Walrus+%281970%29+-+SHM-CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4bbaf741aa15dbd6a6ede7bedc2e5a6ce1cf3eb","infoHashBuffer":{"type":"Buffer","data":[164,187,175,116,26,161,93,189,106,110,222,123,237,194,229,166,206,28,243,235]},"announce":[],"urlList":[]}}