{"title":"The Painted Stallion (1937) DVD9 - Western Serial - 12 Chapters ","uid":9213987,"size":7922432000,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a61c426c45a94f69cd2e13b350db0a45d6ecbaf5&amp;dn=The+Painted+Stallion+%281937%29+DVD9+-+Western+Serial+-+12+Chapters+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1384836296,"description":"The Painted Stallion (1937) DVD9 - Western Serial - 12 Chapters [DDR]\n\nThe Painted Stallion is a 1937 Republic Movie serial. It was the sixth Republic serial of the sixty-six made by that company. \nWestern serials such as this made up a third of the serials from Republic, a studio that was also heavily involved in making B-Western feature films at the time.\n\nThis serial saw the directorial debut of William Witney who would become one of the star directors at Republic.\nIt was not until Zorro Rides Again, later in 1937, that he first worked with his famous directorial partner, John English. \nWitney had been working as an editor on earlier serials but made the switch when another director became unable to work due to heavy drinking.\n\nThe serial was filmed between February 10 and March 3, 1937. The serial's production number was 421. \nThe Painted Stallion was budgeted for $102,157 but went over budget by $7007 (6.9%). The final cost of production was $109,164. \nThis made the serial the cheapest republic serial of 1937 and the fourth cheapest of all Republic serials. Portions of the film were shot in the Coachella Valley, California.\n\n    CAST:-\n    Ray &quot;Crash&quot; Corrigan as Clark Stuart, government official with a trade treaty to be agreed with Mexico\n    Julia Thayer as 'The Rider', mysterious woman believed to be an Indian Spirit riding a Ghost Horse\n    Hoot Gibson as Walter Jamison, Leader of the Wagon train\n    LeRoy Mason as Alfredo Dupray, Spanish dictator determined to hold onto power\n    Duncan Renaldo as 'Zamorro', one of Dupray's henchmen\n    Sammy McKim as Young Christopher 'Kit' Carson, along as part of the wagon train\n    Hal Taliaferro as Jim Bowie, along as part of the wagon train\n    Jack Perrin as Davy Crockett, along as part of the wagon train\n    Oscar and Elmer as 'Oscar and Elmer', a comedy duo with the wagon train\n    Yakima Canutt as 'Tom', one of Dupray's henchmen\n    Matson Williams as 'Macklin', one of Dupray's henchmen undercover on the wagon train\n    Duke Taylor as 'Bill', one of Dupray's henchmen\n    Loren Riebe as 'Pedro', one of Dupray's henchmen\n    George DeNormand as 'Oldham', one of Dupray's henchmen undercover on the wagon train\n    Gordon De Main as 'Governor'\n    Charles King as 'Bull Smith', one of Dupray's henchmen\n    Vinegar Roan as 'Pete', one of Dupray's henchmen\n\nDirected by Alan James, Ray Taylor, William Witney\nProduced by J. Laurence Wickland\nWritten by Morgan Cox, Ronald Davidson, Hal G. Evarts, Winston Miller, Barry Shipman\n\n    CHAPTERS:-\n    01. Trail to Empire: Clark is shot from his horse and falls under the hoofs of attacking Indians.\n    02. Rider of the Stallion: Clark is knocked unconscious while fording a river in a wagon, which begins to sink.\n    03. The Death Leap: Escaping on horseback, Clark and the Rider are chased over a cliff into a lake.\n    04. Avalanche: An explosion catches Clark in a landslide\n    05. Volley of Death: Clark hides in a cupboard but has been seen - a firing squad opens fire.\n    06. Thundering Wheels: Clark is in a burning wagon full of gunpowder as it falls over a cliff.\n    07. Trail Treachery: Attempting to reign in a runaway stagecoach, Clark falls under their hooves.\n    08. The Whistling Arrow: Clark falls into a trapdoor.\n    09. The Fatal Message: Clark and Kit are caught in a burning building.\n    10. Ambush: While jumping a ravine, Clark slips from the saddle and falls.\n    11. Tunnel of Terror: Dupray's henchmen cause a landslide to fall on Jamison and the others.\n    12. Human Targets: \n\nSYNOPSIS:- The Painted Stallion (1937)\nThe period is the 1820's and the first wagon train leaves Independence heading west to Santa Fe. In order to maintain his power, the ruthless Official at Santa Fe must not let them arrive and he sends out his men to stop them. The wagon train then has to endure repeated attacks but is aided by a mysterious rider that shoots singing arrows and rides a painted stallion.\n\nA wagon train travelling from Independence, Missouri to Santa Fe means trouble for Alfredo Dupray, his authority from Spain will end with the arrival of a Mexican Governor. He plots to solve this by intercepting a trade agreement, to be negotiated by Clark Stuart on the wagon train, and disrupt US-Mexican relations.\n\nRepeated attacks are thwarted, however, by the appearance of a mysterious Rider on a Painted Stallion who issues warnings with her whistling arrows. With her help Clark Stuart, along with historical characters, Kit Carson, Jim Bowie and Davy Crockett work to defeat Dupray. Eventually, they assist the arrival of the US Cavalry and the treaty is signed, leaving Stuart and the Rider to ride away together.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 212 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 212 mins","torrent":{"xt":"urn:btih:a61c426c45a94f69cd2e13b350db0a45d6ecbaf5","amp;dn":"The+Painted+Stallion+%281937%29+DVD9+-+Western+Serial+-+12+Chapters+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a61c426c45a94f69cd2e13b350db0a45d6ecbaf5","infoHashBuffer":{"type":"Buffer","data":[166,28,66,108,69,169,79,105,205,46,19,179,80,219,10,69,214,236,186,245]},"announce":[],"urlList":[]}}