{"title":"BDtoAVCHD v2.1.0 - One click Blu-Ray to BD5/BD9/BD25/MKV","uid":9525148,"size":28542976,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6751a4411299625d343ea12021d2c579078811c&amp;dn=BDtoAVCHD+v2.1.0+-+One+click+Blu-Ray+to+BD5%2FBD9%2FBD25%2FMKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thexai","files":1,"time":1390734764,"description":"BDtoAVCHD is a tool to create AVCHD discs from Blu-Ray or MKV files. As output we get the folder structure ready to burn to a DVD5 or DVD9. The software compresses the video to achieve the desired overall size of 4.7 GB or 8.5 GB with the highest possible quality.\n\nThe AVCHD format allows playback the same type of content that a Blu-Ray and holding high definition (1080p) but on DVD5 or DVD9 media. It is ideal for backing up Blu-Ray with much smaller size and maintaining high quality.\n\nBDtoAVCHD is created with the idea that is very simple and quick to use and obtain the best possible quality in a DVD5 media. To achieve this avoids unnecessary conversions and do not need any codec installed as avisynth, ffdshow or Haali media splitter. The recorded discs obtained are compatible with almost any Blu-Ray player and PS3.\n\nAlso can convert Blu-Ray to MKV, MKV to AVCHD and Blu-Ray 3D to AVCHD/MKV 3D side-by-side/top-bottom.\n\n\n\nKEY FEATURES\n\n   * Finds the main .m2ts file for the movie by just selecting the BDMV folder or Blu-Ray root.\n   * Extract all information from the audio tracks, video and subtitles: length, language, format, etc.\n   * Extract chapter information or allows to add it.\n   * Select default audio track based on the language preferences and most appropriate criteria for the best quality but can also be set manually.\n   * Calculates the video bitrate to fill the DVD5 / DVD9 (most of the times gets filled between 99-100%).\n   * Converts audio (only if necessary): PCM to AC3, DTS-HD MA to DTS Core, DTS to AC3, etc.\n   * Detect delays in the original audio tracks and transfers them to the final job.\n   * Recompress the video using x264 64-bit if the computer supports it.\n   * Do not use external codecs like avisynth or ffdshow or Haali splitter in the process of video conversion.\n   * We can select a forced subtitle track is active by default when playing the disc.\n   * Allows to program multiple conversions in the queue and execute them one after another automatically.\n   * Multitasking: be can add new jobs in the queue while processing others.\n   * Various output sizes: DVD5 / DVD9 / USB 4GB / BD-25 and Custom.\n   * Ability to create a BD-25 without re-compressing video (BDRemux).\n   * MKV as alternate output: allows to convert Blu-Ray to MKV recoding the video or without recoding (BDremux).\n   * 3D ready: from Blu-Ray 3D we can get a AVCHD 3D or MKV 3D (side-by-side/top-bottom).\n\n\n\nCHANGELOG\n\nVersion 2.1.0 (01/24/2014)\n\n   * New: Output mode 2D+3D .ISO (BD Remux) if input is a 3D Blu-Ray. Can also determine if there is enough space on a BD-25 without recompress the video.\n   * New: 3D button on main window for selecting the 3D output mode for the current conversion (2D/SBS/TAB/2D+3D .ISO). Appears only if the input is a 3D Blu-Ray.\n   * Improved: Scan Bitrates function scans .ssif files in 3D Blu-Ray.\n   * Improved: MVC/AVC eye assignation (left-right) is shown also in source proprieties (main window).\n   * Improved: removed Haali Matroska Muxer of the installation package as it is not needed anymore. In some conversions that required to create a temporary MKV, now an    alternate/more direct method is used.\n   * x264 updated to revision r2389.\n   * Mkvmerge updated to version 6.7.0\n   * Added tsMuxeR version 2.6.12\n\n\nVersion 2.0.0 (01/10/2014)\n\n   * Updated the runtime libraries to better Windows 8.1 support.\n   * Improved: GUI appearance and fixes some controls in Windows 8/8.1\n   * Several improvements in the installer.\n   * Improved: system of automatic notification and download of new versions. Less intrusive and allows to postpone the download later.\n   * Should fix (rare) crashes reported by some users in Windows 7 64-bit.\n   * New: integrated &quot;Intel Media SDK System Analyzer&quot; tool in the Help menu. Shows system compatibility with Intel Quick Sync Video acceleration and information about graphics drivers installed.\n   * Improved: default output folder is created on current user profile folder &quot;C:Usersuser_nameBDtoAVCHD&quot; and default temp folder is created on current user temp folder &quot;C:Usersuser_nameAppDataLocalTempBDtoAVCHD&quot;.\n\n\nVersion 1.9.5 (12/28/2013)\n\n   * New: Hardware acceleration on MVC decoding (utilized in Blu-Ray 3D conversions). Requires Windows 7/8/8.1 and Intel Core CPU with Integrated Graphics like i7-3770k. Also requires recent Intel Graphics drivers installed. If all requirements are met, HW acceleration is used without user specific action. On i7-3770k e.g. can expect speed gains from 10-15 fps (SW) to 65-85 fps HW (x264 encoding 1st pass 3D MVC to 3D SBS/TAB).\t\t","torrent":{"xt":"urn:btih:a6751a4411299625d343ea12021d2c579078811c","amp;dn":"BDtoAVCHD+v2.1.0+-+One+click+Blu-Ray+to+BD5%2FBD9%2FBD25%2FMKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6751a4411299625d343ea12021d2c579078811c","infoHashBuffer":{"type":"Buffer","data":[166,117,26,68,17,41,150,37,211,67,234,18,2,29,44,87,144,120,129,28]},"announce":[],"urlList":[]}}