{"title":"Ross Campbell - Wet Moon Books 4-6","uid":10211958,"size":364601351,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ad0ba4c04b60cd6511d3ba839b596bf6bab9fbae&amp;dn=Ross+Campbell+-+Wet+Moon+Books+4-6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1400928073,"description":"Wet Moon Book 4 Drowned In Evil\nRoss Campbell\nOni Press, 2008, 168 Pages\nRoss Campbell returns yet again to the endless saga of the swampy southern city of Wet Moon. Cleo s relationship with Myrtle begins to take a dark turn, forbidden romance blossoms, secret pasts are revealed, a babysitting gig goes awry, and Wet Moon s own masked vigilante makes her appearance. Volume 4 of Eisner-nominated creator Ross Campbell s hit series continues its examination of Cleo and the rest of the residents of Wet Moon with the deft mix of humor, drama, and heartbreak readers have come to expect.\n\nWet Moon Book 5 Where All Stars Fail to Burn\nRoss Campbell\nOni Press, 2009, 168 pages\nThere's lots going on in the tiny town of Wet Moon and the weirdness isn't going to die down soon. With Cleo and her circle's attention focused on the big softball game, the dark emotional clouds gathering in the distance have gone unnoticed. Will anybody be ready for the brutal conflict that's on the horizon? Volume 5 of Eisner-nominated creator Ross Campbell's hit series continues its examination of Cleo and the rest of the residents of Wet Moon with the deft mix of humor, suspense, and heartbreak readers have come to expect.\n\nWet Moon Book 6 Yesterday: Gone\nRoss Campbell\nOni Press, 2012, 168 pages\nTrilby Bernarde has been attacked, brutally stabbed, and left to die. But how will Trilby's absence affect the rest of Wet Moon? For some, life moves on normally, but for others, this tragedy could change everything. While Mara and Cleo wait for some news about Trilby, Audrey and Natalie prepare to move, and Martin gets ready to leave for Winter break. And the attack brings someone else back to Wet Moon: FBI Agent David Wolfe.","torrent":{"xt":"urn:btih:ad0ba4c04b60cd6511d3ba839b596bf6bab9fbae","amp;dn":"Ross+Campbell+-+Wet+Moon+Books+4-6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad0ba4c04b60cd6511d3ba839b596bf6bab9fbae","infoHashBuffer":{"type":"Buffer","data":[173,11,164,192,75,96,205,101,17,211,186,131,155,89,107,246,186,185,251,174]},"announce":[],"urlList":[]}}