{"title":"Edward Sri - A Biblical Walk Through the Mass (EPUB/MOBI/PDF)","uid":10204790,"size":1869489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af620aae3bc5181115cccfef2a8e468f034255a7&amp;dn=Edward+Sri+-+A+Biblical+Walk+Through+the+Mass+%28EPUB%2FMOBI%2FPDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1400833542,"description":"A Biblical Walk Through the Mass: Understanding What We Say and Do in the Liturgy\n\nAs Catholics, the Mass is the center of our Faith. We celebrate it every day. We know all the responses. We know all the gestures. But do we know what it all means?\n\nIn A Biblical Walk Through the Mass, Dr. Edward Sri takes us on a unique tour of the Liturgy. Based on the revised translation of the Mass which goes into effect Advent, 2011, this book explores the biblical roots of the words and gestures we experience in the Liturgy and explains their profound significance. This intriguing look at the Mass is sure to renew your faith and deepen your devotion to the Eucharist.\n\nThis book is used as the text for the Adult Faith Formation Program, but may also be purchased separately at steep bulk discounts. For parishes not doing a study, this is a perfect resource for catechizing adults on the true meaning of the Mass, and why it is so central to our faith.\n\nAbout the Author\n\nDr. Edward Sri is a nationally-known Catholic speaker and the author of several best-selling books. He is provost and professor of theology and Scripture at the Augustine Institute and founding leader with Curtis Martin of FOCUS (Fellowship of Catholic University Students). Dr. Sri holds a doctorate from the Pontifical University of St. Thomas Aquinas in Rome. He resides with his wife, Elizabeth, and their six children in Littleton, Colorado.\n\nMore: https://thepiratebay.se/user/ancapcatholic\n\nBTC: 1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp\t","torrent":{"xt":"urn:btih:af620aae3bc5181115cccfef2a8e468f034255a7","amp;dn":"Edward+Sri+-+A+Biblical+Walk+Through+the+Mass+%28EPUB%2FMOBI%2FPDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af620aae3bc5181115cccfef2a8e468f034255a7","infoHashBuffer":{"type":"Buffer","data":[175,98,10,174,59,197,24,17,21,204,207,239,42,142,70,143,3,66,85,167]},"announce":[],"urlList":[]}}