{"title":"Chandrawal (1984) Haryanvi VCD - No Subs [DDR]","uid":9541698,"size":1148549896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1320961cdaee9448c9a1a70a433c865971916bb&amp;dn=Chandrawal+%281984%29+Haryanvi+VCD+-+No+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1391058234,"description":"Chandraval (1984) Haryanvi VCD - No Subs [DDR]\n\nChandrawal is a 1984 Bollywood film. It is the third Haryanavi-language film to be released and the first financially successful one. Written by Late. Shri Devi Shankar Prabhakar,produce by usha sharma and directed by Jayant Prabhaker, the film's music was created by J. P. Kaushik. Starring dancer Usha Sharma, the film tells the story of a tragic love affair between Chandrawal, a girl of the Gadia Lohar community, and Suraj, a boy of another caste. It was released in March 1984 and became very successful, spurred on by a popular soundtrack. A sequel is in development and will be produced by Usha Sharma and directed by Nishant Prabhakar.\n\nIt broke multiple box office records and was most successful in Haryana, Western U.P., Delhi and parts of Rajasthan, grossing more than Hindi films like Sholay and Bobby in these areas. Chandrawal celebrated its Silver Jubilee at Gagan Cinema in Faridabad, recovering its entire cost at that one theatre alone. While the movie was in theatres, the sight of hundreds of villagers coming in large-groups boarding rural tractor-trolleys and trucks to watch Chandrawal at theatre, was commonplace. This movie was popular in all age-groups. This movie was particularly instrumental in making the Haryanvi folksongs and music a popular choice in mainstream Indian music industry especially Indipop. Chandrawal has set a world record when the Producers honoured a dozen of cine goers of Haryana and Western U.P. who witnessed 'Chandrawal' more than 200 times.\n\nCAST:-\nJagat Jakhar - Suraj\nUsha Sharma - Chandrawal\nNasib Singh Kundu - Roondah\nDaryav Singh Malik - Khoondah\n\nDirected by Jayant Prabhakar\nProduced by Usha Sharma\nMusic by \tJ. P. Kaushik\nLanguage Haryanvi\n\nChandrawal is the grand daughter of the head of Gadia Lohar tribe, Jodha Sardar. Their gypsy tribe is proud of their heritage that they are the descendants of Maharana Pratap. They believe that after his defeat, their ancestors left Chittoor with the pledge that they would never settle down at a permanent place under roof till they again hoist Maharanas flag at Chitoor fort, and since then the tribe has been roaming about as gypsies, doing Lohars jobs for the people with great honesty and hard work. They never allow their girls to marry the boys of other castes. During their unending journey, Jodha Sardar was camping near Ram Garh village and here the young Suraj first saw Chanrdrawal dancing at a marriage ceremony in the camp. Both the young hearts fell in love at first sight. The love affair becomes an open secret soon and Ranjit Chaudhary the father of Suraj who is also the village Chaudhary becomes very angry. On the other hand Jodha Sardar also reacts very strongly and decides to leave the village at once as he does not like that Chandrawal and Suraj are given any chance to meet. He, before leaving the haveli of Chaudhary Ranjit, warns Suraj that if ultimately with the help of his friends he succeeds in finding out the place of his camp. On seeing Chandrawal after a long time, Suraj becomes so emotional that he runs towards the Dera crying - Chandra. Chandrawal also sees him and immediately rushes towards him without caring for the warnings of her grandfather that he would cut her into pieces with a long knife. At the same time Suraj sees Jodha Sardar throwing a knife to kill Chandrawal. Suraj at once turns himself to the side and takes the fatal attack on Chandrawal upon himself. Realising that Suraj is dead, Chandrawal snatches the knife out of the body of her lover and sacrifices herself there and then.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-1\nVideo Bitrate: 1119 kbps\nVideo Resolution: 352x288\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 25.000\nAudio Codec:  MPEG-1 Layer 2\nAudio Bitrate: 224kb/s CBR 44100 Hz\nAudio Streams: 2\nAudio Languages: Haryanvi\nRunTime: 1:49:10\nSubtitles: NONE\nRipped by: Trinidad [DDR]    \nDuration: 1:49:10","torrent":{"xt":"urn:btih:b1320961cdaee9448c9a1a70a433c865971916bb","amp;dn":"Chandrawal+%281984%29+Haryanvi+VCD+-+No+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1320961cdaee9448c9a1a70a433c865971916bb","infoHashBuffer":{"type":"Buffer","data":[177,50,9,97,205,174,233,68,140,154,26,112,164,51,200,101,151,25,22,187]},"announce":[],"urlList":[]}}