{"title":"Steve Tilston - An Acoustic Confusion [1971] {2007 Riverman Musi","uid":9512304,"size":280712862,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3ee8033384e8caf7babc6dda15be46a92a4af9e&amp;dn=Steve+Tilston+-+An+Acoustic+Confusion+%5B1971%5D+%7B2007+Riverman+Musi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1390434712,"description":"proper eac rip with cue log and scans\n\n2007 - Riverman Music / BTR0016 / Remastered (LP MINIATURE) Limited Edition / CD\n\nSTEVE TILSTON &quot;An Acoustic Confusion&quot; Scenesof SCOFCD1002\n&quot;Lovingly remastered&quot; is a phrase in danger of becoming a clich,, but in the case this re-release of Steve Tilston's first album, made in 1971, it is particularly apposite. Scenesof are based in Maine, USA, but they obviously share the unconditional admiration of these songs that Ian A. Anderson's Village Thing label displayed in pressing the original vinyl. And make no mistake, the ten songs of &quot;Acoustic Confusion&quot; (plus a couple of by-now obligatory &quot;Previously Unreleased&quot; studio demos from 1978) add up to what was probably described at the time as an extremely enjoyable listening experience. Still is!\n\nRanging from voice and guitar solos to all-systems-go harmonica, string bass, violin and extra guitar 'n' vocal pieces, &quot;An Acoustic Confusion&quot; shows surprising maturity in all three departments of our hero's chosen profession. The songs contain true poetic insight, the singing is assured and the guitar-playing, even then, is a source of wonder. As he hints at in the typically self deprecating insert-notes (worth the price of the album alone), time has not been kind to a couple of songs. &quot;Peel Street&quot; and &quot;Rock and Roll Star&quot; contain the kind of over-indulgence that twenty-nothings the world over are famous for, but there is compensation in spades. &quot;Simplicity&quot; could stand comfortably with his current work, while &quot;Normandy Day&quot; manages to absorb influences from Bob Dylan through to Nick Drake, distil them all and produce pure essence of Tilston.\n\nAs Steve's work has progressed, it has revealed successive layers of creativity, inventiveness and integrity. There is nothing on &quot;An Acoustic Confusion&quot; to cause embarrassment, and a great deal to be proud of. Wouldn't it be great if Scenesof were working on the difficult second album right now?\n\nAlan Rose","torrent":{"xt":"urn:btih:b3ee8033384e8caf7babc6dda15be46a92a4af9e","amp;dn":"Steve+Tilston+-+An+Acoustic+Confusion+%5B1971%5D+%7B2007+Riverman+Musi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ee8033384e8caf7babc6dda15be46a92a4af9e","infoHashBuffer":{"type":"Buffer","data":[179,238,128,51,56,78,140,175,123,171,198,221,161,91,228,106,146,164,175,158]},"announce":[],"urlList":[]}}