{"title":"BoDeans - Blend [1996]","uid":9539411,"size":276376862,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3f0992363da528d9c15a6a5b559ed0061aaa582&amp;dn=BoDeans+-+Blend+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391010406,"description":"Review by Rick Anderson\nThe tunes are achingly, unrelentingly lovely; the guitars jangle and shimmer charmingly; the chord progressions move from catharsis to catharsis. Sam Llanas and Kurt Neumann's voices blend like angels in a choir. Sometimes the effect is subtle -- like when they sing about a woman who will &quot;Sit on the front porch, watch the sun go down/Holding hands with her newborn baby.&quot; It's a sweet image, but one undermined by the fact that it's pretty hard to picture a woman holding hands with a newborn. Sometimes the effect is more abrasive -- like when they sing &quot;Sometimes she snores, sometimes she breathes on me/So I push her away so tenderly&quot; or &quot;When two hearts feel they could be as one/Ya just superglue 'em down until the fear is done.&quot; It's not hard to discern the good intentions here, but it takes some effort to ignore the clumsy, and sometimes downright gross, realization of them. However, at times the formula works; &quot;Can't Stop Thinking&quot; is an unbeatable hopeless-guy-in-love anthem, and &quot;Hurt By Love&quot; finds Llanas telling his baby that &quot;All those wishing stars/Hang out where you are&quot; as an acoustic guitar jingles and twinkles merrily behind him. &quot;Hurt By Love&quot; is what the BoDeans are trying for throughout this whole album, but they only get there once or twice. (3/5)","torrent":{"xt":"urn:btih:b3f0992363da528d9c15a6a5b559ed0061aaa582","amp;dn":"BoDeans+-+Blend+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3f0992363da528d9c15a6a5b559ed0061aaa582","infoHashBuffer":{"type":"Buffer","data":[179,240,153,35,99,218,82,141,156,21,166,165,181,89,237,0,97,170,165,130]},"announce":[],"urlList":[]}}