{"title":"Life - Our Century in Pictures (History Photo Art Ebook).pdf","uid":10199645,"size":66194539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b41a1299c22c6761d1cde5f6f3809f75b99e46e8&amp;dn=Life+-+Our+Century+in+Pictures+%28History+Photo+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"STBGD","files":-1,"time":1400755117,"description":"Pdf / English / 1999 / 423p / ISBN-10: 0821226339 / 63 MB\n\nRichard Stolley knows a bit about what we want from the pictures of our century. He's the LIFE magazine guy who acquired the Zapruder film of JFK being shot (the fatal instant is depicted in this book), and he basically created modern celebrity culture as the founding father of People, where he articulated his famous rules for cover photos: young is better than old, pretty better than ugly, rich better than poor--&quot;and nothing is better than the celebrity dead.&quot; All of the above are found abundantly in Stolley and Tony Chiu's lively, cannily selected, and sumptuously produced photo album LIFE: Our Century in Pictures.\nIt's not just a grab bag of 770 arresting, touching, scary, funny, alternately famous and unfamiliar images. It tells a semi-coherent story by breaking up the century into nine &quot;epochs,&quot; each introduced with a brief essay by a leading intellectual light (David M. Kennedy, Paul Fussell, and Garry Wills do especially well). There are fun facts aplenty: did you know Columbia Pictures' Lady Liberty-like logo was inspired by a debutante in an anti-Hun propaganda poster? Or that Ike almost chose Margaret Chase Smith instead of Nixon? Each epoch gets assigned a &quot;Turning Point,&quot; sometimes a defining moment or a flashy burst of upbeat cultural documentary to offset the sometimes stark violent-event photos. The World War I section breaks up the black-and-white trench-fighting scenes with a quickie history of the American musical, pages as radiant as a rainbow. Each chapter ends with &quot;Requiem&quot; photos of people whose passing is still news.\n\nThe layouts are often superb: you have to open the book to see how perfect a Mondrian looks next to a photo of college girls doing patriotic calisthenics that transform them into a similarly energetic grid. There are heftier historic-photo collections, like Bruce Bernard's true test of coffee-table construction, the 1,120-page Century: One Hundred Years of Human Progress, Regression, Suffering, and Hope. But you're not going to find a more popular book of its kind than Stolley and Chiu's. --Tim Appelo\n\nAbout the Author\nRichard Stolley is Senior Editorial Advisor of Time Inc. He started working for LIFE magazine in 1953 where he stayed for 19 years. Later, in 1972, he launched the highly successful People magazine. He is the recipient of numerous awards for contributions to the magazine industry and for outstanding journalism.","torrent":{"xt":"urn:btih:b41a1299c22c6761d1cde5f6f3809f75b99e46e8","amp;dn":"Life+-+Our+Century+in+Pictures+%28History+Photo+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b41a1299c22c6761d1cde5f6f3809f75b99e46e8","infoHashBuffer":{"type":"Buffer","data":[180,26,18,153,194,44,103,97,209,205,229,246,243,128,159,117,185,158,70,232]},"announce":[],"urlList":[]}}