{"title":"The Eye of Zoltar - Jasper Fforde","uid":10189827,"size":879844,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4bf788e934999eceddcd0adbcb5b6466a771b4d&amp;dn=The+Eye+of+Zoltar+-+Jasper+Fforde&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1400622570,"description":"Orphaned sixteen-year-old Jennifer Strange runs Kazam, a Mystical Arts Management company that rents out wizards for cash. The Mighty Shandar tells Jennifer that if she finds a mysterious jewel named The Eye of Zoltar, he will spare the dragons he didn't manage to kill in Book One.\n\nIt is said the Eye was last seen around the neck of the really very legendary and not at all likely Sky Captain Morgan, who reputedly plunders jetliners from the back of the equally legendary and probably not real Leviathan, a kind of flying manta ray the size of a coach.\n\nMeanwhile, the King and Queen of Snodd thinks that Jennifer, 'a young lady of considerable daring, moral worth and resourcefulness' should take over the tutelage of the hideous spoiled teenage Princess Shazzine, in order that she learns to rule with distinction once the King and Queen are gone.\n\nJennifer agrees with some reluctance, and together, she, trainee magician Perkins and the princess - cunningly and without any originality disguised as a handmaiden - cross into the neighbouring Cambrian Empire, a dangerous country strewn with peril and a focus for bored daredevils seeking perilous adventures as a form of Jeopardy Tourism.\n\nAfter procuring a tour guide aged ten named Addie, they venture deep into the heart of the most dangerous place in the most dangerous place in the whole Ununited Kingdoms: The Empty Quarter, within which lies their goal: The legendary Leviathan's Graveyard, inconveniently perched at the very top of the mountain known as Cadir Idris, its lofty summit permanently shrouded in cloud.\n\nMany people have visited the mountain, but none have returned. Perhaps the legend of Sky Pirate Morgan and the Leviathans are true - or perhaps the clouds that obscure the summit hide a far deeper secret. Pretty soon the Princess, Addie, Jennifer and Perkins are fighting the powers of darkness not just for their lives, but for everything they know and love...","torrent":{"xt":"urn:btih:b4bf788e934999eceddcd0adbcb5b6466a771b4d","amp;dn":"The+Eye+of+Zoltar+-+Jasper+Fforde","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4bf788e934999eceddcd0adbcb5b6466a771b4d","infoHashBuffer":{"type":"Buffer","data":[180,191,120,142,147,73,153,236,237,220,208,173,188,181,182,70,106,119,27,77]},"announce":[],"urlList":[]}}