{"title":"Queer as Folk - COMPLETE","uid":9476453,"size":23852872962,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5b82a8b646e026288fd86c404eef939126e45b1&amp;dn=Queer+as+Folk+-+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"navrasjueventa","files":81,"time":1389709916,"description":"Queer as Folk is a television series. An American-Canadian co-production, the series was produced for Showtime Entertainment and Showcase by Cowlip Productions, Tony Jonas Productions, and Temple Street Productions in association with Channel 4 Television. It was developed and written by Ron Cowen and Daniel Lipman (Sisters, An Early Frost), who were the showrunners, and also the executive producers along with Tony Jonas, former President of Warner Bros. Television.\n\nBased on the British series created by Russell T Davies, Queer as Folk was the first hour-long drama on American television to portray the lives of gay men and women. Although it was set in Pittsburgh, PA, interior scenes were actually shot in Toronto and employed various Canadian directors known for their independent film work (including Bruce McDonald, David Wellington, Kelly Makin, John Greyson, Jeremy Podeswa and Michael DeCarlo) as well as Australian director Russell Mulcahy (Highlander) who directed the pilot episode. Additional writers in the later seasons included Michael MacLennan, Efrem Seeger, Brad Fraser, Del Shores, and Shawn Postoff.\n\nPlot\nMain article: List of Queer as Folk episodes\n\nThe first episode finds the four friends ending a night at Babylon, a popular gay club. Brian picks up and has sex with Justin, who falls in love with him and eventually becomes more than a one-night-stand. Brian also becomes a father that night, bearing a son with Lindsay through artificial insemination.\n\nMichael's seemingly unrequited love for Brian fuels the story, which he occasionally narrates in voice-over. Justin's coming out and budding relationship with Brian has unexpected effects on Brian and Michael's lives much to Michael's dismay as Justin is only 17 years old. Justin confides in his straight high-school friend Daphne, while struggling to deal with homophobic classmates and his dismayed, divorcing parents, Craig and Jennifer. Later in the second season Justin and Michael co-create the sexually explicit underground comic Rage, featuring a &quot;Gay Crusader&quot; superhero based on Brian.\n\nBrian's son Gus, being raised by Lindsay and Melanie, becomes the focus of several episodes as issues of parental rights come to the fore. Ted is Melanie's accountant who once harbored a longstanding crush on Michael. He and Emmett begin as best friends, but briefly become lovers later in the series. Their relationship ends as Ted, unemployed and with a criminal record earned from running a legitimate porn website that was targeted by a Chief of Police running for Mayor, becomes addicted to crystal meth. In the fourth season, Brian, who has lost his job by assisting Justin in opposing an anti-gay political client, starts his own agency. Michael marries Ben Bruckner, an HIV-positive college professor, and the couple adopts a teenage son, James &quot;Hunter&quot; Montgomery, who is also HIV-positive as a result of his experiences as a young hustler.\n\nTed's affair with a handsome crystal meth addict, Blake Wyzecki, sets the pattern for Ted's later tragic but ultimately redeeming experiences with drug addiction.\n\nMelanie and Lindsay's relationship, while on the surface seeming more of a &quot;stable&quot; relationship, is actually quite tumultuous and controversial. Each cheats on the other at various points in the series; both tackle on a threesome shortly after they marry and become separated for much of the 4th and 5th seasons. Melanie is impregnated by Michael (through artificial insemination, as Lindsay was) in the third season, so that best friends Brian and Michael become co-fathers to Lindsay and Melanie's children. Melanie gives birth to a girl, Jenny Rebecca, over whom Melanie, Lindsay, and Michael have a brief legal custody battle following the women's transitory break-up. Brian's new advertising agency, Kinnetik, becomes highly successful both through a combination of Brian's customer loyalty and his edgier advertising. As a result of this, Brian is able to purchase Club Babylon from its bankrupt owner.\n\nIn the fifth and final season the boys have become men, and the series, perhaps more comfortable in its role in gay entertainment, tackles political issues head-on and with much more fervor.\n\nA political campaign called &quot;Proposition 14&quot; is depicted during much of the final season as a looming threat to the main characters. This proposition, like so many real-life recent legislative moves that have affected many U.S. states, threatens to outlaw same-sex marriage, adoption and other family civil rights. The many ways in which such a proposition would affect the characters are depicted through nearly every episode. Debbie, Justin, Jennifer, Daphne, Emmett, Ted, Michael, Ben, Lindsay, Melanie and the children are depicted standing up and fighting against this proposition both by active canvassing, political contributions and other democratic processes, but are met with staunch opposition, discrimination, outright hatred and political setbacks.\n\nThe show climaxes near the end of the series when a benefit to support opposition to Proposition 14 hosted at Brian's club Babylon (after repeated relocations of the benefit, due to discrimination) is attacked by a bomb that initially kills 4, and eventually another 3 and injures 67.\n\nThis horrible event sets the bittersweet tone for the final three episodes, in which Brian, frightened by this third possible loss of Justin, finally declares his love for him. The two even plan to marry, but Justin's artistic abilities get noticed by a New York art critic and the two decide, for the time being at least, in favor of a more realistic approach to a stormy relationship that nevertheless works for their characters. Melanie and Lindsay, realizing they have more in common than they don't, resume their relationship but relocate to Canada to &quot;raise [their children] in an environment where they will not be called names, singled out for discrimination, or ever have to fear for their life.&quot;\n\nEmmett becomes a Queer-Eye type TV presenter but is later fired when professional football player Drew Boyd kisses him on the news to signify his coming out. Ted confronts his midlife crisis head-on and finally reunites with Blake. Hunter returns and the Novotny-Bruckner family perseveres.\n\nThe series came full circle with the final scenes staged in the restored Babylon nightclub. In the final scene, Brian dances to Heather Small's &quot;Proud,&quot; a song that accompanied a pivotal scene between Brian and Michael in the very first episode of the series. It ends with a final narration by Michael:\n\n    &quot;So the &quot;thumpa thumpa&quot; continues. It always will. No matter what happens. No matter who's president. As our lady of Disco, the divine Miss Gloria Gaynor has always sung to us: We will survive.&quot;\n","torrent":{"xt":"urn:btih:b5b82a8b646e026288fd86c404eef939126e45b1","amp;dn":"Queer+as+Folk+-+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5b82a8b646e026288fd86c404eef939126e45b1","infoHashBuffer":{"type":"Buffer","data":[181,184,42,139,100,110,2,98,136,253,134,196,4,238,249,57,18,110,69,177]},"announce":[],"urlList":[]}}