{"title":"EXPLOITED COLLEGE GIRLS - Jasmine - Painful Anal Attempt  **NEW*","uid":10158807,"size":1018840622,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b9fe9a1b47350f0290d5730164e14b5321f573f5&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Jasmine+-+Painful+Anal+Attempt++%2A%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"beta2008x","files":1,"time":1400204795,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=nmtjd_jsm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=nmtjd_jsm.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=83lu0_ecg_jasmine_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=83lu0_ecg_jasmine_s.jpg&lt;/a&gt;\n\n\n\nThe first thing you'll notice about Jasmine is her, um, attitude. But the second thing you'll notice is her fine curvy ass, so you can ignore the first thing. Jay certainly does, as soon as he sees that ass he's only got one thing in mind: the buttsex. More specifically, getting Jasmine so turned on that she's willing to give up the butt. Does he? Spoiler alert: sorta.\n\nSo, Jasmine's attitude. There isn't much to say aside from it is what it is. However, unlike a lot of the girls we've featured with attitude, once Jasmine gets a taste of the cock, it evaporates and she really gets into the shoot. Things start off with a little interview in the bathroom and move quickly to the bed and even more quickly to Jasmine showing off her fine, bare pussy. Jay gets her off twice with the Rabbit and then has her get on the floor for a beej, as a prelude to the main event.\n\nOnce she's nicely preheated, Jay gets her on her back and applies his universal attitude corrector, aka the cock. Jasmine takes to it instantly and becomes much easier to take. After some hard pounding Jay flips her into doggy and repeats the procedure. At this point he's sure he can convince her to try anal and he goes for it. Jasmine balks, Jay goes for a last ditch lube app and tries to get in there, but alas he fails. Anal fail. So sad.\n\nI'm not saying this ends with the best facial in the history of porn, but it's on the list. Honestly, every time you see some girl make a goofball duck face haven't you wanted to splatter it with a load of jizz? We've taken care of that for you and you're welcome. ","torrent":{"xt":"urn:btih:b9fe9a1b47350f0290d5730164e14b5321f573f5","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Jasmine+-+Painful+Anal+Attempt++%2A%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9fe9a1b47350f0290d5730164e14b5321f573f5","infoHashBuffer":{"type":"Buffer","data":[185,254,154,27,71,53,15,2,144,213,115,1,100,225,75,83,33,245,115,245]},"announce":[],"urlList":[]}}