{"title":"Alice Calaprice - The Ultimate Quotable Einstein [2011][A]","uid":10224631,"size":1412324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc2542c5f8d88cf84cad047778430549e4e6b655&amp;dn=Alice+Calaprice+-+The+Ultimate+Quotable+Einstein+%5B2011%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401070600,"description":"Description\nProduct Details\nBook Title: The Ultimate Quotable Einstein\t\nBook Author: Albert Einstein (Author), Alice Calaprice (Editor), Freeman Dyson (Foreword)\nHardcover: 608 pages\nPublisher: Princeton University Press (October 31, 2010)\nLanguage: English\nISBN-10: 0691138176\nISBN-13: 978-0691138176\n\n===================================================================================\nBook Description\nHere is the definitive new edition of the hugely popular collection of Einstein quotations that has sold tens of thousands of copies worldwide and been translated into twenty-five languages.\nThe Ultimate Quotable Einstein features 400 additional quotes, bringing the total to roughly 1,600 in all. This ultimate edition includes new sections--&quot;On and to Children,&quot; &quot;On Race and Prejudice,&quot; and &quot;Einstein's Verses: A Small Selection&quot;--as well as a chronology of Einstein's life and accomplishments, Freeman Dyson's authoritative foreword, and new commentary by Alice Calaprice.\nIn The Ultimate Quotable Einstein, readers will also find quotes by others about Einstein along with quotes attributed to him. Every quotation in this informative and entertaining collection is fully documented, and Calaprice has carefully selected new photographs and cartoons to introduce each section.\nFeatures 400 additional quotations\nContains roughly 1,600 quotations in all\nIncludes new sections on children, race and prejudice, and Einstein's poetry\nProvides new commentary\nBeautifully illustrated\nThe most comprehensive collection of Einstein quotes ever published.\n\n===================================================================================\nReview\n&quot;[The Ultimate Quotable Einstein] is a compelling selection. . . . Students of Einstein's work and life, who are familiar with these contexts, can find many embellishments to their research, and often puzzling contrary notes to customary portrayals of his stance on issues ranging from Zionism to domestic life.&quot;--Choice\n\n===================================================================================\nAbout the Author\nAlice Calaprice is a renowned expert on Albert Einstein and was a longtime senior editor at Princeton University Press. She has worked with the &quot;Collected Papers of Albert Einstein&quot; since the founding of the project, has copyedited and overseen the production of all the volumes, and administered the accompanying translation series with a grant from the National Science Foundation. She is the author of several popular books on Einstein and was a recipient of the Literary Market Places award for individual achievement in scholarly editing.\n\n===================================================================================\nMost Helpful Customer Reviews\nEinstein - the scientist and the man\nBy L. Edward Sizemore\nFor the Denton Record-Chronicle\nThe Ultimate Quotable Einstein is neither novel nor reference work. It is the sort of delightful book that one dips into here and there, from time to time, for the simple pleasure of doing so.\nCalaprice arranges the material in 23 topical chapters, each dealing with a particular subject, such as death, education, Jews and Judaism, music, and Science and Scientists, to name but a few.\nOf special interest are the final chapters. There is a longish chapter on miscellaneous topics, followed by a chapter of Einstein's poetry, as well as quotes attributed to Einstein -- some rather questionable. The concluding chapter has quotes about Einstein by others.\nThe beauty of this book is that it allows us to see Einstein the man, as well as Einstein the scientist. He was, for example, essentially Jewish, though not observant. In a later chapter, we see Einstein as an international advocate of peace. One marvels to see that Einstein, arguably the greatest scientist of all time, was also a human being, subject to the same frailties that bedevil us all.\nThis small-format book contains a wealth of material for anyone interested in the man and his work. For that matter, for anyone who knows the pleasure of dipping in here and there.\n===================================================================================","torrent":{"xt":"urn:btih:bc2542c5f8d88cf84cad047778430549e4e6b655","amp;dn":"Alice+Calaprice+-+The+Ultimate+Quotable+Einstein+%5B2011%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc2542c5f8d88cf84cad047778430549e4e6b655","infoHashBuffer":{"type":"Buffer","data":[188,37,66,197,248,216,140,248,76,173,4,119,120,67,5,73,228,230,182,85]},"announce":[],"urlList":[]}}