{"title":"From the Shadows - Exposing the New World Order","uid":9605424,"size":194937209,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bc551be5071db55d793d4a27d48f64b958c45d51&amp;dn=From+the+Shadows+-+Exposing+the+New+World+Order&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bafridi","files":11,"time":1392214362,"description":"&quot;From the Shadows - exposing the New World Order.&quot;\n\n\nJoin Halaqah Media's production &quot;From the Shadows&quot; on an audio adventure unlike any other, enhanced with brilliant effects mastered digitally in Dolby Surround. Experience a gripping and compelling adventure through the realms of time. Explore the cloaked hand that has been responsible for some of history's most important turning points. The same hand that now controls every medium, exploiting it for their sole ambition of total global domination with a one World government. Be there when we uncover the gripping truth surrounding Masonry, past and present that is exposed in this exclusive insight never before revealed...\n\nFrom the Shadows, emerges a New World Order, their Order. We are all aware of the effects of media propaganda in our daily lives. Few of us however, realize that media propaganda is a well orchestrated global campaign to influence our behaviour; our thinking, our dressing, our culture, our lifestyle and virtually every aspect of our life, including our religion.","torrent":{"xt":"urn:btih:bc551be5071db55d793d4a27d48f64b958c45d51","amp;dn":"From+the+Shadows+-+Exposing+the+New+World+Order","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc551be5071db55d793d4a27d48f64b958c45d51","infoHashBuffer":{"type":"Buffer","data":[188,85,27,229,7,29,181,93,121,61,74,39,212,143,100,185,88,196,93,81]},"announce":[],"urlList":[]}}