{"title":"Larry Kramer - The Normal Heart &amp; The Destiny of Me","uid":10218885,"size":607446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfc4bae7e2f50b5a17c561657dbbb709cf3359e9&amp;dn=Larry+Kramer+-+The+Normal+Heart+%26amp%3B+The+Destiny+of+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pharmakate","files":-1,"time":1401000326,"description":"Larry Kramer - Two Plays: The Normal Heart &amp; The Destiny of Me (Grove Press, 2000). Foreword by Tony Kushner.\n\nEpub and mobi formats\n\nHBO's adaptation of Larry Kramer's 1985 play The Normal Heart is being broadcast Sunday, May 25. It stars  Mark Ruffalo, Julia Roberts, Matt Bomer, Taylor Kitsch, Jim Parsons, Alfred Molina, Jonathan Groff, and Joe Mantello.\n\n\ndescription:\n\nThe Normal Heart, set during the early years of the AIDS epidemic, is the impassioned indictment of a society that allowed the plague to happen, a moving denunciation of the ignorance and fear that helped kill an entire generation. It has been produced and taught all over the world. Its companion play, The Destiny of Me, is the stirring story of an AIDS activist forced to put his life in the hands of the very doctor he has been denouncing.\n\n*****\n\nThe Normal Heart was selected as one of the 100 Greatest Plays of the Twentieth Century by the Royal National Theatre of Great Britain\n\n&quot;An extraordinary play! It is bracing and exciting to hear so much passion and intelligence. Kramer produces a cross fire of life-and-death energies that create a fierce and moving human drama.&quot;--Jack Kroll, Newsweek\n\n&quot;The blood that's coursing through The Normal Heart is boiling hot. There can be little doubt that it is the most outspoken play round.&quot;--Frank Rich, The New York Times\n\n&quot;Kramer's astounding drama about AIDS is too urgent to ignore! An astounding drama...a damning indictment of a nation in the middle of an epidemic with its head in the sand. It will make your hair stand on end even as the tears spurt from your eyes. Dynamite!&quot;--Liz Smith, New York Daily News\n\n&quot;Wired with anger, electric with rage.... Powerful stuff.&quot;--The Boston Globe\n\n&quot;No one who cares about the future of the human race can afford to miss The Normal Heart.&quot;--Rex Reed\n\n&quot;The Normal Heart has broken a great silence.... It has put politics and journalism to shame for the cover-up of a major disaster and one of the great moral dramas of our time.&quot;--Francis Fitzgerald, author of Fire in the Lake\n\n&quot;Impassioned writing...explosively powerful...uniquely important.&quot;--The Advocate\n\n&quot;I haven't been this involved--upset--in too damn long. Kramer honors us with this stormy, articulate theatrical work.&quot;--Harold Prince\n\n&quot;Larry Kramer's The Normal Heart is arguably the best political play of that schizophrenic decade and definitely the definitive dramatic exploration of the early years of the AIDS crisis.&quot;--Chicago Tribune\n\n&quot;Larry Kramer's 1988 masterwork refuses to date.&quot;--Chicago Reader\n\n&quot;Kramer's play actually may work better now in the tragic hindsight of history.&quot;--Chicago Sun-Times\n\n*****\n\nThe Destiny of Me was a finalist for the Pulitzer Prize, a double Obie winner, and the recipient of the Lucille Lortel Award for Best Play of the Year.\n\n&quot;In The Destiny of Me, Larry Kramer has written a worthy sequel to The Normal Heart. What Kramer captures expertly in the past is family relations in their ambiguities, hostilities, and reconciliations...and almost equally skillfully in the present, the bristling relations of patient and doctor, patient and nurse.... A kind of--and this is meant as praise--Jewish-homosexual Long Day's Journey Into Night.&quot;--John Simon, New York\n\n&quot;Searing!&quot;--Vanity Fair\n\n&quot;Gives new hope to the American theater. One of the year's ten best.... Poignant, most moving, enriching.&quot;--Time\n\n&quot;Overwhelmingly powerful...scaldingly honest...a seismic jolt of visceral theatricality!&quot;--Frank Rich, The New York Times\n\n&quot;A harrowing, emotionally naked family-memory-AIDS play, playful and moving, personable and disturbing, with scenes of devastating counterpoint. The work of a theater artist...like Arthur Miller at his best.&quot;--Newsday\n\n&quot;Driven by a fierce honesty and searing pain, Kramer's emotional and moral urgency fills The Destiny of Me with irresistible human truth.&quot;--Newsweek\n\n&quot;A mature work by a gifted American playwright in his prime...bitter and angry and full of biting humor.&quot;--The Wall Street Journal\n\n&quot;The Destiny of Me is bigger than any one of us. The Long Day's Journey comparisons are apt. At long last Kramer the activist has leashed in Kramer the polemicist, letting loose Kramer the artist.&quot;--QW\n\n&quot;The Destiny of Me is a beautiful, somber play, very mature, and very personal. Plays are meant for presentation. Great plays also stand well as great literature. This is one of them. Kramer proves once again his place as one of the best writers of our times.&quot;--Lambda Book Report","torrent":{"xt":"urn:btih:bfc4bae7e2f50b5a17c561657dbbb709cf3359e9","amp;dn":"Larry+Kramer+-+The+Normal+Heart+%26amp%3B+The+Destiny+of+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfc4bae7e2f50b5a17c561657dbbb709cf3359e9","infoHashBuffer":{"type":"Buffer","data":[191,196,186,231,226,245,11,90,23,197,97,101,125,187,183,9,207,51,89,233]},"announce":[],"urlList":[]}}