{"title":"Drinking Water - A History (2013) By James Salzman (Epub,Mobi,Az","uid":9593518,"size":5554874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c090c0890c7b5cc3a7316f50f82d881b357cf9df&amp;dn=Drinking+Water+-+A+History+%282013%29+By+James+Salzman+%28Epub%2CMobi%2CAz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":3,"time":1391963094,"description":"Format: mobi/epub/azw3\nLength: 320 pages\nGenre: History\nDate: 31 January 2013\n\nWater is something we take for granted; whether from tap or bottle, we rarely think about its source. But its journey to our glasses is more complicated than we realise. With a booming worldwide population, where will our water come from in the future? And is it safe to drink tap water? Is bottled water wasteful? Drinking Water explains the overlooked and surprising history of drinking water from Biblical conflicts to overpriced mineral water. You will never look at your glass in the same way again.\n\nThis surprising, delightful, fact-filled book will help you shine in conversations at dinner tables and cocktail parties. What do Rome's aqueducts, Napoleon's death, and the pilgrimage site of Lourdes have in common? All involve water: the leading ingredient of our bodies, essential for our daily lives, and the subject of innumerable struggles. Why does bottled water, the cheapest and most abundant liquid, sell for more than the same volume of gasoline? Even if you prefer to drink wine - it's mostly water anyway - you'll enjoy this book.\n\nAuthor:\n\nJames Salzman is Professor of Law and Environmental Studies at Duke University and has written extensively on the topics of environmental conservation, population growth and climate change. He has lectured on environmental policy worldwide and served as the European Environmental Manager for S.C. Johnson. He lives in North Carolina. ","torrent":{"xt":"urn:btih:c090c0890c7b5cc3a7316f50f82d881b357cf9df","amp;dn":"Drinking+Water+-+A+History+%282013%29+By+James+Salzman+%28Epub%2CMobi%2CAz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c090c0890c7b5cc3a7316f50f82d881b357cf9df","infoHashBuffer":{"type":"Buffer","data":[192,144,192,137,12,123,92,195,167,49,111,80,248,45,136,27,53,124,249,223]},"announce":[],"urlList":[]}}