{"title":"The Green Hornet Radio Series (with accurate episode titles)","uid":10199412,"size":637148964,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c0b2c8b1ff0a10ac53bcc05bd34b5dfe50eef6f0&amp;dn=The+Green+Hornet+Radio+Series+%28with+accurate+episode+titles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"praeriedog1","files":122,"time":1400750039,"description":"&quot;The Green Hornet is an American radio adventure series that debuted in 1936 and introduced the character of the Green Hornet, a masked vigilante. He would be accompanied by his similarly masked chauffeur/bodyguard/enforcer, who was also Reid's valet, Kato, initially described as Japanese, and by 1939 as Filipino of Japanese descent.\n\nThe series originated on January 31, 1936, on WXYZ, the same local Detroit station that originated its companion shows The Lone Ranger and Challenge of the Yukon. Beginning April 12, 1938, the station supplied the series to the Mutual Broadcasting System radio network, and then to NBC Blue and its successors, the Blue Network and ABC Network, from November 16, 1939, through September 8, 1950. It returned from September 10 to December 5, 1952. It was sponsored by General Mills from January to August 1948, and by Orange Crush in its brief 1952 run.&quot;  --from Wikipedia\n\nI compiled these episodes from various sources.  I renamed them all so they'd have the same format in the title, and I tried to do my best at naming the episodes correctly.  Some of them were named incorrectly to begin with, and I fixed what I was able to catch. For example, I've found the episode &quot;Ballots and Bluff&quot; on a number of websites that offer Green Hornet episodes.  They all have it listed as &quot;Ballots and Bluff&quot; but when you listen to the episode, the announcer clearly states the title of the episode as &quot;Bullets and Bluff&quot;.  I also got rid of all the underlines, and capitalized words, so &quot;greenhornet390615_justice_wears_a_blindfold&quot; was changed to &quot;390615 Justice Wears a Blindfold&quot;. I may have missed something here and there but that's easy enough to fix.  I also listed the artist as The Green Hornet and the year of the episode in the file information on each mp3 file.\n\nTwo of the episodes don't have dates on them.  They were in a torrent that way with a number of others that also didn't have dates.  I was able to find out which episodes the others were and either put dates to them, or realize they were copies of episodes that had dates (or different titles) and deleted them.  I got it down to those two.\n\nUnfortunately, I was only able to find 120 episodes, plus an interview with one of the actors that played the Green Hornet.  If you find any episodes that aren't in this torrent, please let me know.  For the moment, however, I think this is the largest, and most accurate, source for the Green Hornet radio series there is.  If you download this, please seed it, so more and more people will be able to enjoy these episodes as well.","torrent":{"xt":"urn:btih:c0b2c8b1ff0a10ac53bcc05bd34b5dfe50eef6f0","amp;dn":"The+Green+Hornet+Radio+Series+%28with+accurate+episode+titles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b2c8b1ff0a10ac53bcc05bd34b5dfe50eef6f0","infoHashBuffer":{"type":"Buffer","data":[192,178,200,177,255,10,16,172,83,188,192,91,211,75,93,254,80,238,246,240]},"announce":[],"urlList":[]}}