{"title":"[PS3] TimeShift","uid":9509632,"size":4364609761,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c1a389cf764a6ec1004dc678484c2cc49e3c6388&amp;dn=%5BPS3%5D+TimeShift&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuckface69","files":-1,"time":1390378953,"description":"\nMaster time to become the ultimate weapon in TimeShift on PlayStation 3.\n\nDr. Aidan Krone has made sure he will be the first human being to make a time jump across the space-time continuum - a reckless act with frightening implications. As a result the megalomaniacal physicist now resides within an alternate reality that is his to control - a disturbing existence that has evolved into an experimental nightmare.\n\nIt is during this alternate reality that you arrive within the bleak and rain-soaked Alpha District. You are welcomed as the newest member of the Occupant Uprising, the few remaining soldiers that refuse to surrender to the ruthless Krone Magistrate. This outmanned rebel uprising is on the brink of extinction - but that was before your arrival.\n\nArmed with the experimental Beta Suit, a malfunction has given you the ability to slow, stop, and reverse the flow of time itself. Only you can perfect this ability to end Krone's madness. Join this battle for survival and lead the uprising to victory.\n\n* Master the ability to stop, slow and reverse time to become the ultimate weapon\n* Nine weapons, each with two functions that allow players to completely annihilate the competition\n* Sixteen person multiplayer featuring 14 maps to create time-stopping chaos and massive destruction to an already devastated world","torrent":{"xt":"urn:btih:c1a389cf764a6ec1004dc678484c2cc49e3c6388","amp;dn":"%5BPS3%5D+TimeShift","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1a389cf764a6ec1004dc678484c2cc49e3c6388","infoHashBuffer":{"type":"Buffer","data":[193,163,137,207,118,74,110,193,0,77,198,120,72,76,44,196,158,60,99,136]},"announce":[],"urlList":[]}}