{"title":"BlacksOnBlondes - Marley Blaze - Anal whore ass fucked","uid":9588613,"size":1015832704,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c2723fa71e9b70496f5f67c614956e8e7804530a&amp;dn=BlacksOnBlondes+-+Marley+Blaze+-+Anal+whore+ass+fucked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HardFuck","files":53,"time":1391820454,"description":"\nScene Pictures: \n\n\nMarley Blaze Interracial at Blacks On Blondes \n\nMarley Blaze is &quot;nervous&quot; and for good reason....she's never fucked a black guy on camera before-let alone via the booty. Wesley Pipes is soothing Marley's nerves by talking to her about the upcoming scene. Wesley's a veteran of the game and knows exactly how to introduce a slut into the world of fucking black dudes. We take things inside and Marley's first encounter with a black cock is one for the records book. Wesley schools the white slut on exactly how he likes his big black cock sucked, and she follows direction like a trooper. Marley's taste buds get their first taste of black cock and her inhibitions disappear the minute Wesley's black cock slides in that white pussy. Marley Blaze gets fucked hard right before that ass is next on the menu. Marley's booty also gets its first taste of mighty black meat. Cover your ears if Marley's uttering of &quot;nigger&quot; offends you. It certainly didn't Wesley as he pounded that ass into next year. Marley's holes are shown mercy only after Wesley paints her face with his Mississippi nectar.","torrent":{"xt":"urn:btih:c2723fa71e9b70496f5f67c614956e8e7804530a","amp;dn":"BlacksOnBlondes+-+Marley+Blaze+-+Anal+whore+ass+fucked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2723fa71e9b70496f5f67c614956e8e7804530a","infoHashBuffer":{"type":"Buffer","data":[194,114,63,167,30,155,112,73,111,95,103,198,20,149,110,142,120,4,83,10]},"announce":[],"urlList":[]}}