{"title":"Roxie Hart (1942) DVD5 - Ginger Rogers, George Montgomery [DDR]","uid":9508478,"size":6116628480,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c3b8be073c076e367c6894a50e2abd5e6a0f4dc7&amp;dn=Roxie+Hart+%281942%29+DVD5+-+Ginger+Rogers%2C+George+Montgomery+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"SaM","files":-1,"time":1390358822,"description":"Roxie Hart (1942) DVD5 - Ginger Rogers, George Montgomery [DDR]\n\nRoxie Hart is a 1942 comedy film directed by William A. Wellman and starring Ginger Rogers, Adolphe Menjou, George Montgomery, Nigel Bruce, Phil Silvers, William Frawley, and Spring Byington. It is also more known as Chicago or Chicago Gal.\n\nCAST:-\nGinger Rogers as Roxie Hart\nAdolphe Menjou as Billy Flynn\nGeorge Montgomery as Homer Howard\nLynne Overman as Jake Callahan\nNigel Bruce as E. Clay Benham\nPhil Silvers as Babe\nSara Allgood as Mrs. Morton\nWilliam Frawley as O'Malley\nSpring Byington as Mary Sunshine\n\nDirected by William Wellman\nProduced by Nunnally Johnson\nWritten by Maurine Dallas Watkins \nScreenplay by Nunnally Johnson, Ben Hecht\nMusic by Alfred Newman\nRunning time 75 minutes\n\nSYNOPSIS:- Roxie Hart (1942)\nAs soon as Stuart Chapman (Ted North) starts his new job as a newspaper reporter in Chicago, he is pulled into a murder investigation together with his new colleague Homer Howard (George Montgomery). As they sit down in a bar having a drink after a long day, Homer starts telling about a case he reported on in 1927 - a murder case involving the young dancer Roxie Hart (Ginger Rogers).\n\nBack in 1927, a theatre booking agent, Fred Casely, was murdered, and his body was found in Roxie's apartment. Roxie's husband Amos (George Chandler) is immediately questioned by the police, but Roxie is persuaded to let herself get arrested for the murder, since a woman hardly ever gets convicted of murder in Chicago. Besides, the fame she would earn for taking the blame could definitely improve her fading career. That is how reporter Jake Callahan (Lynne Overman) and Casely's partner E. Clay Benham (Nigel Bruce) reasons with Roxie to convince her of what to do.\n\nRoxie takes the blame, even though she knows her husband is guilty of the murder. Her mugshot is talen at the police station. When in jail, Roxie talks to different reporters about the case, including Homer, who has just started out as a journalist. Her husband also gets her the best lawyer money could buy, Billy Flynn (Adolphe Menjou), who is the closest thing to a show artist to ever enter a court room.\n\nBilly decides they will use the fact that Roxie is a weak woman and claim she killed the man in self-defence. Billy sets up a series of interviews with journalist reporters. Roxie is instructed to charm the reporters and dance her own trademark dance &quot;The Black Hula&quot;.\n\nHomer is one of these reporters who are charmed by the lovely Roxie. He also finds out that Amos in fact is the real killer from the jail janitor, Michael Finnegan, and decides to help Roxie out. When the press turns to report on another &quot;lady criminal&quot;, Gertie Baxter (Iris Adrian), and the publicity tide turns in favor of a tougher treatment of women criminals, Roxie pretends to be pregnant to sway the public opinion back to her ring side.\n\nTo further create sympathy for Roxie, Billy moves her trial further into the future, and gets Amos to divorce her. Roxie still doesn't trust the legal system enough, and wants Billy to find Finnegan and get him to testify in court on her behalf. It turns out Finnegan is dead, and the written statement he left before he died is judged as inadmissible evidence.\n\nBilly still manages to get Roxie off the hook, and her fainting in front of the jury helps her case tremendously. She is found not guilty of the murder, but Amos is arrested instead, stealing all the publicity from Roxie. Out of the limelight, Roxie has to choose between marrying the poor reporter Homer and a rich member of the jury, stockbroker O'Malley (William Frawley).\n\nIn present time 1942, Homer finishes his story and gets up. He addresses the man behind the bar, who is O'Malley, now a former stockbroker because he lost everything in the 1929 crash. A moment later, Homer is picked up from the bar by his wife, Roxie, who arrives in a car with their six children and announces she is pregnant with another\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 75 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 75 mins","torrent":{"xt":"urn:btih:c3b8be073c076e367c6894a50e2abd5e6a0f4dc7","amp;dn":"Roxie+Hart+%281942%29+DVD5+-+Ginger+Rogers%2C+George+Montgomery+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3b8be073c076e367c6894a50e2abd5e6a0f4dc7","infoHashBuffer":{"type":"Buffer","data":[195,184,190,7,60,7,110,54,124,104,148,165,14,42,189,94,106,15,77,199]},"announce":[],"urlList":[]}}