{"title":"Sexually Broken--Big tit blond deepthroats 10in cock Darling","uid":9463634,"size":1059389392,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c8962326ddf39b8b0bc26bd155b0a9c986e9150d&amp;dn=Sexually+Broken--Big+tit+blond+deepthroats+10in+cock+Darling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1389401846,"description":"Big titted blond bimbo deepthroats 10in of cock, brutally ASS fucked, devastating orgasms Category 5 | Darling | Matt Williams\n\nJanuary 10, 2014\n\n\nMP4 only.\n\n\nWe are proud and excited to bring Darling back to the pages of Sexually Broken. This big titted blond bimbo was built for rough sex and throat fucking. Darling can take the cock like no one we have seen before her. All three holes, mouth, ass and pussy are filled and stretched to the limit.\n\nWe start with our sexy bimbo on her knees, huge boobs cruelly bound, arms across a pole and a mouth ready for brutal throat fucking. The cocks come at her one at a time and are relentless. Darling can do nothing to stop the cock from pushing all the way down her hungry throat, she is completely helpless. Nonstop we fuck Darling's pretty face hole. She gets air only when we want her to, and soon Darling is dazed and deep in subspace. Her mascara runs down her pretty face and the cocks never let up. Darling is fighting for control of her own body, but we own it and her sloppy, hot throat.\n\nWhen we have Darling dazed and obviously broken from the brutal throat fucking we stand her up and bend her over. If you thought her huge tits were nice, her muscular legs and amazing ass are equally impressive. Still in her high heels, she strikes an amazing pose as her ass sticks out begging for cock. It takes just seconds for one hard cock to be banging cervix deep, while the other cock pushes down her throat, Darling is now &quot;air tight&quot;, both cocks ram deep and hold. Darling flashes, then cums harder then any before her. The game is on. \n\nBack and forth the cock fucks mouth and throat, soon one of the cocks slides deeply into her ASS and Darling instantly cums like the bimbo she inspires to be. We use every hole this blond goddess has to offer and then some. Darling is literally fucked into deep subspace, she can only cum and struggle for air. In the end, what was Darling is now just a pile of moaning, drooling girl. Some form of liquid is dripping from every hole, as Darling's eyes stare into nothingness, the lights are on, but she's not home... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_10darling6/SexuallyBroken-Darling-Matt-Williams-Big-titted-blond-bimbo-deepthroats-10in-of-cock-brutally-ASS-fucked-devastating-orgasms-Category-5.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/01_10darling6/SexuallyBroken-Darling-Matt-Williams-Big-titted-blond-bimbo-deepthroats-10in-of-cock-brutally-ASS-fucked-devastating-orgasms-Category-5.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n","torrent":{"xt":"urn:btih:c8962326ddf39b8b0bc26bd155b0a9c986e9150d","amp;dn":"Sexually+Broken--Big+tit+blond+deepthroats+10in+cock+Darling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8962326ddf39b8b0bc26bd155b0a9c986e9150d","infoHashBuffer":{"type":"Buffer","data":[200,150,35,38,221,243,155,139,11,194,107,209,85,176,169,201,134,233,21,13]},"announce":[],"urlList":[]}}