{"title":"Craig Goldy's 13th Floor - A Personal Tribute to DIO ","uid":10204672,"size":156305702,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ca1dba2606450e9bf80c75558d987570e9815d6c&amp;dn=Craig+Goldy%27s+13th+Floor+-+A+Personal+Tribute+to+DIO+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Tripower57","files":9,"time":1400829921,"description":"Includes MP3 and FLAC\n\nPer Craig Goldy:\n\nCRAIG GOLDY'S 13TH FLOOR: A Personal Tribute\n\n\n\n1 - Hole in My Heart\n2 - Dark Rainbow\n\nThis is my own personal tribute to my Mentor, Friend, Band Mate , Family Member and often &quot;Father and Brother Figure&quot;....Mr. Ronnie James Dio!\nI mentioned at his public memorial service that when I do some original material next, that I will use what I have learned from him over the years in such a way that I could only hope to make him proud! When Wendy Dio heard these 2 songs....the first thing she said was.....&quot;Wow, Ronnie would be proud of you&quot;! And the second thing she said was ...&quot;Who's that singing?&quot;!! And in a later email after listening to the final version....she said it brought tears to her eyes!!  This is meant also as a means of being therapeutic for those who still miss him as much as I do!  The first song &quot;Hole in my Heart&quot; is about his passing from the perspective of the fans, the band that was left behind and myself!  My hope is that this song will help with the pain that goes had in hand with losing a loved one of any kind, and be a musical memorial for Ronnie and all the lost loved ones everywhere! \nThe 2nd song &quot;Dark Rainbow&quot;  is a song about Ronnie! \nWhen Ritchie Blackmore had left Deep Purple and how he (Ronnie) seemed to come out of nowhere, when disco was taking the spotlight, and not only became unique unto himself , the music industry, fans around the world, but also became the voice for the &quot;downtrodden&quot; and/or the &quot;black sheep&quot; of the listeners of the entire globe. \nHow he had to step down from being a headliner in Sabbath and become an opening act just to get his own band Dio going, and how he labored over his melody lines and lyrics hour after hour, day after day, week after week piecing together masterpieces! After he left this world......the &quot;Black Hole&quot;  (of music and him being the first and last of his kind)......that Black Hole left behind....is what I call...the Dark Rainbow!  And that I didn't want him to go in there....because if he did....I would never see him again!\nThis song is also for those hard Rock/Heavy Metal fans that don't know about Ronnie like we do.....for them....this song is about something inexplicable came and went! Something so powerful....that it changed the world while it was here...\nand as a result of it's departure....was left a daunting after-effect that the world will never ever forget..... \nin the shape of a physical Black Hole or Doorway into another realm......that if ever entered into....one would never return!\n \n","torrent":{"xt":"urn:btih:ca1dba2606450e9bf80c75558d987570e9815d6c","amp;dn":"Craig+Goldy%27s+13th+Floor+-+A+Personal+Tribute+to+DIO+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1dba2606450e9bf80c75558d987570e9815d6c","infoHashBuffer":{"type":"Buffer","data":[202,29,186,38,6,69,14,155,248,12,117,85,141,152,117,112,233,129,93,108]},"announce":[],"urlList":[]}}