{"title":"The Decline of Intelligence in America by Seymour W. Itzkoff","uid":10221322,"size":1213617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce62c4f6a323614dedc642d7dd1549ee26627b35&amp;dn=The+Decline+of+Intelligence+in+America+by+Seymour+W.+Itzkoff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1401043119,"description":"The Decline of Intelligence in America - A Strategy for National Renewal (1994) by Seymour William Itzkoff.pdf\n\nMr. Itzkoff places most of the blame for America's alleged intellectual decline on what he sees as an economically and intellectually elite cast of misguided liberals. They have isolated themselves from American society, he says, by their paternalistic treatment of the underclass, by discounting the importance of traditional family values and by failing to raise enough bright children to sustain national competence. The New York Times Book Review\n\nFew doubt that the United States has slipped from its longstanding eminence as the world's wealthiest and most productive nation. The problem for the past 30 years has been the diagnosis of both the decline and then the cure. Literally trillions of dollars have been expended in futile programs to stanch the hemorrhaging of our economic wealth, jobs, educational achievement, and cultural elan.\n\nItzkoff argues that we will never stop the fall until we understand our real national dilemma. This is the decline in our national intelligence profile: fewer citizens of high intelligence, educational potential, and economic productivity. These ideas are taboo. Itzkoff, however, insists that these are the facts, and they must be examined. In this book, he lays out the available evidence for our social disintegration and suggests a rational program of policy initiatives that would begin to restore us to what we were as recently as 1955--the great hope of the world.\n\n256 pages\nPublisher: Praeger (November 30, 1994)\nLanguage: English\nISBN-10: 0275952290\nISBN-13: 978-0275952297","torrent":{"xt":"urn:btih:ce62c4f6a323614dedc642d7dd1549ee26627b35","amp;dn":"The+Decline+of+Intelligence+in+America+by+Seymour+W.+Itzkoff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce62c4f6a323614dedc642d7dd1549ee26627b35","infoHashBuffer":{"type":"Buffer","data":[206,98,196,246,163,35,97,77,237,198,66,215,221,21,73,238,38,98,123,53]},"announce":[],"urlList":[]}}