{"title":"Far Cry 3 (j-TAG/RGH ONLY) XBOX360","uid":10294901,"size":5614462840,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ced3ba07bbc3d57e99a2d353d387e463c5447c68&amp;dn=Far+Cry+3+%28j-TAG%2FRGH+ONLY%29+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"exdous69","files":1,"time":1401907156,"description":"PER REQUEST! THIS GAME IS FOR J-TAG/RGH ONLY! IT DOES NOT CONTAIN AN ISO. \n\n\nFar Cry 3 is a first-person shooter, which also features role-playing game elements including experience points, skill trees, and a crafting system. The player has the ability to take cover behind objects to break enemies' lines of sight and to peek around and over cover and blindfire. The player has the ability to perform silent takedowns by performing melee attacks from above, below, or close behind. The game's narrative director, Jason Vandenberghe, said that the story mode map is around ten times larger than the game's previous installments. Players are given the ability to survey and plan out their attacks with stealth takedown combinations and tag enemies with the camera in order to track their movement once they break the player's line of sight.[12]\n\nEquipment is controlled by a simple system. As missions are completed, new items are unlocked to be purchased or crafted by Jason, using the pelts of various animals found around the island. When scramblers on radio towers are removed, areas of the map are opened and weapons in the shop are made free. As outposts of Vaas' pirate group are attacked and retaken, the vicinity around the outpost becomes safer, it unlocks new side quests for that area, involving missions like hunting the many different wildlife species on the island to upgrade ones equipment.[13]\n\nSkills are collected by gaining experience from completing missions and killing enemies, and are unlocked in three skill trees, which correspond to the Spider, the Heron, and the Shark. Each skill tree upgrades different aspects of Jason's abilities, with the Spider upgrading his stealth takedowns and hunting skills, Shark for assault takedowns and health, with the Heron upgrading his long-range takedowns and mobility. As skills are collected, the tattoo on Jason's forearm grows which is made up of several different tribal designs resembling the three animal skill trees.","torrent":{"xt":"urn:btih:ced3ba07bbc3d57e99a2d353d387e463c5447c68","amp;dn":"Far+Cry+3+%28j-TAG%2FRGH+ONLY%29+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ced3ba07bbc3d57e99a2d353d387e463c5447c68","infoHashBuffer":{"type":"Buffer","data":[206,211,186,7,187,195,213,126,153,162,211,83,211,135,228,99,197,68,124,104]},"announce":[],"urlList":[]}}