{"title":"Rifftrax Eragon","uid":10205657,"size":1923393470,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d1b2af8e85aa36d86ce856e1671be4f58e18966a&amp;dn=Rifftrax+Eragon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PBNZ","files":3,"time":1400804274,"description":"video: 1920x816 AVC\naudio1 (default): movie plus Rifftrax AAC 2.0\naudio2: just movie\nsubs: English built in, off by default\n &lt;a href=&quot;\nhttp://www.rifftrax.com/rifftrax/eragon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rifftrax.com/rifftrax/eragon&lt;/a&gt;\n\nAre you a fan of Star Wars but feel that there just weren't enough brain-stunningly idiotic names for your taste? Do you like the Lord of the Rings films but find they move too quickly and make too much sense?\n\nDid you enjoy The Matrix but wish it could have contained a horrendously embarrassing performance by former actor/professional picnic ham John Malkovich? Then you need help! That is, then Eragon is the film for you!\n\nOstensibly about some punk who finds a dragon egg, Eragon is actually a poignant onscreen documentation of the decline of Jeremy Irons, whose eye bags, if there were any justice, would have received third billing. And it's also a showcase for first time actor - um- can't remember his name. Really made no impression one way or the other. (In fact, was he even in the film?)\n\nBut mostly it's an opportunity to watch John Malkovich turn in a performance that had to - HAD TO - be a direct challenge to the director, &quot;Please, fire me.I'm begging you to fire me. I'll do a take like this and then you'll have to fire me. Wait,I'm still not fired?&quot;\n\nKevin Murphy joins Mike in the RiffTrax International Studios (and Small Engine Repair) for Eragon, the blockbuster fantasy epic that forgets to be a blockbuster.\n\n----------------------------------------------------------------\n\nBack in the day for some reason the US DVD release of Eragon was a shortened censored version of the film so that was the version that got riffed, when it came time to release it in HD apparently they went back to the full length version of the film, so the Riff had to be resynced to match. \n\nIf this Rifftrax was enjoyable, you haven't paid for it and you have a few dollars to spare, please consider purchasing this riff (3.99USD) or make a general donation (5USD and up) - they take Bitcoin now too\n &lt;a href=&quot;\nhttp://www.rifftrax.com/donate&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rifftrax.com/donate&lt;/a&gt;","torrent":{"xt":"urn:btih:d1b2af8e85aa36d86ce856e1671be4f58e18966a","amp;dn":"Rifftrax+Eragon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b2af8e85aa36d86ce856e1671be4f58e18966a","infoHashBuffer":{"type":"Buffer","data":[209,178,175,142,133,170,54,216,108,232,86,225,103,27,228,245,142,24,150,106]},"announce":[],"urlList":[]}}