{"title":"Pow! - Hi-Tech Boom (2013) [FLAC]","uid":9522680,"size":152848458,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d687066b9af74cc834f76b553f9ccd21c00dc0e5&amp;dn=Pow%21+-+Hi-Tech+Boom+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"politux","files":-1,"time":1390671372,"description":"\n  Pow! - Hi-Tech Boom (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie, Garage\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Glitch\n  02 Hope Dealers\n  03 Vertical Slum\n  04 Sugi Walks\n  05 Switchboard Scientist \n  06 66\n  07 Cyber Attack!!\n  08 Hi-Tech Boom\n  09 @ The Station\n  10 Shoes (PLEH)\n  11 Fire Hose\n\n  It makes total sense for the young S.F. trio POW! to have their first album out on Castle Face Records. Like the label's head, John Dwyer of Thee Oh Sees, they play their warped pop with a slightly ragged joy that's loose-limbed, rough around the edges, and powerfully tight all at once. Hi-Tech Boom shows off a band that has a firm grasp on their sound, arriving packed with songs that feel like they've been worked and reworked until they shine like dirty diamonds. Taking inspiration from garage rock, post-punk, and early Devo, the songs on Boom are squirmy and punchy with fat synth squiggles and yowling, preening vocals taking the lead, though the snarling guitars drop in now and then to wrest away control. It's not a new sound and nobody will ever accuse POW! of being sonic innovators here, what they do and do well is kick out the scruffy jams in a fashion that will get listeners' pulses racing. Tracks like the hyper-charged &quot;66,&quot; &quot;Hope Dealers,&quot; and &quot;Vertical Slum&quot; have the thrust of jet engines, the vocals are never less than attention grabbing, and the intense energy grabs hold right away and doesn't let go. When they aren't raging like skinny tie-clad maniacs, the group shows that restraint can be just as exciting as abandon, and songs like &quot;Fire Hose,&quot; with its tough Motorik beat and mind-expanding fuzz guitar artistry, or the slowly churning, deeply synthy &quot;Switchboard Scientist,&quot; make just as much an impression in the long run as the songs that hit instantly. Hi-Tech Boom is a very impressive debut, and even though he's the one who discovered them, Dwyer could learn a thing or two about hooks and dynamics from his young charges.","torrent":{"xt":"urn:btih:d687066b9af74cc834f76b553f9ccd21c00dc0e5","amp;dn":"Pow%21+-+Hi-Tech+Boom+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d687066b9af74cc834f76b553f9ccd21c00dc0e5","infoHashBuffer":{"type":"Buffer","data":[214,135,6,107,154,247,76,200,52,247,107,85,63,156,205,33,192,13,192,229]},"announce":[],"urlList":[]}}