{"title":"Adriana Petryna - Life Exposed. Biological Citizens after Cherno","uid":10220308,"size":2912474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d77b3e29364f1e1eed5ffdbe72512ddbcf579ab6&amp;dn=Adriana+Petryna+-+Life+Exposed.+Biological+Citizens+after+Cherno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401034405,"description":"Description\nProduct Details\nBook Title: Life Exposed: Biological Citizens after Chernobyl (In-Formation)\t\nBook Author: Adriana Petryna\nSeries: In-Formation\nHardcover: 288 pages\nPublisher: Princeton University Press; 1 edition (October 28, 2002)\nLanguage: English\nISBN-10: 0691090181\nISBN-13: 978-0691090184\n\n===================================================================================\nAttention: This is a scanned copy, a very good one in my opinion, but far from perfect. The book is amazing though and deserves to be available. Thank you for understanding.:) Enjoy reading.\n\n===================================================================================\nBook Description\nPublication Date: October 28, 2002 | ISBN-10: 0691090181 | ISBN-13: 978-0691090184 | Edition: 1\nOn April 26, 1986, Unit Four of the Chernobyl nuclear reactor exploded in then Soviet Ukraine. More than 3.5 million people in Ukraine alone, not to mention many citizens of surrounding countries, are still suffering the effects. Life Exposed is the first book to comprehensively examine the vexed political, scientific, and social circumstances that followed the disaster. Tracing the story from an initial lack of disclosure to post-Soviet democratizing attempts to compensate sufferers, Adriana Petryna uses anthropological tools to take us into a world whose social realities are far more immediate and stark than those described by policymakers and scientists. She asks: What happens to politics when state officials fail to inform their fellow citizens of real threats to life? What are the moral and political consequences of remedies available in the wake of technological disasters?\nThrough extensive research in state institutions, clinics, laboratories, and with affected families and workers of the so-called Zone, Petryna illustrates how the event and its aftermath have not only shaped the course of an independent nation but have made health a negotiated realm of entitlement. She tracks the emergence of a &quot;biological citizenship&quot; in which assaults on health become the coinage through which sufferers stake claims for biomedical resources, social equity, and human rights. Life Exposed provides an anthropological framework for understanding the politics of emergent democracies, the nature of citizenship claims, and everyday forms of survival as they are interwoven with the profound changes that accompanied the collapse of the Soviet Union.\n\n===================================================================================\nReviews\nWinner of the 2006 New Millenium Award, Society of Medical Anthropology\nJoint Winner of the 2003 Sharon Stephens First Book Award, American Ethnological Society\n\n&quot;Petrynas ethnographic approach consciously shapes her account and illuminates it with detail that historians of the future will treasure.&quot;--Jeanne Guillemin, Medical Humanities Review\n\n&quot;The book presents exceptionally rich anthropological material generated through observations and interviews. . . . The true scope of the human tragedy caused by this man-made catastrophe comes to the fore via biological stories of Petryna's informants. . . . Most of the book's heroes were directly affected by radioactive fallout and often paid a terrible price, losing their physical and mental health.&quot;--Larissa Remennick, Journal of the American Medical Association\n\n&quot;[Chernobyl] is a dramatic and important story, and Life Exposed is a compelling book. . . . [A]n important study that will interest a wide anthropological audience.&quot;--Jonathan P. Parry, Journal of the Royal Anthropological Institute\n\n===================================================================================\nFrom the Inside Flap\n&quot;An ethnographic triumph. Life Exposed is as much a cultural study of science as it is a history of a nuclear disaster and a story of the politics of nation making in Ukraine. As powerful an analysis of biological citizenship and national technical processes of managing risks as I have ever read. Yet also a moving meditation on the aftermath of disaster for a poor Eastern European state, including the moral and medical morass faced by those who negotiate its world of disability.&quot;--Arthur Kleinman, Harvard University\n\n&quot;This extremely interesting work treats the social, political, and personal implications of Chernobyl as a prism--reflecting the political-economic, clinical, legal, and biographical processes that characterize this 'open-ended' catastrophe. There is nothing comparable. Very well written, it will be of major interest to readers in risk analysis and risk sociology, science studies, political science, as well as to anyone interested in the consequences of megatechnologies.&quot;--Ulrich Beck, author of The Brave New World of Work and What is Globalization?\n\n&quot;This is a marvelous piece of research on a timely topic that ought to be of great interest to a broad audience in sociocultural anthropology, to scholars and makers of public policy, to specialists in the politics of transition, and to social science and humanities scholars interested in contemporary Ukraine. Petryna's story is very moving and the material is wonderfully rich and suggestive.&quot;--Mark L. von Hagen, Columbia University, author of Soldiers in the Proletarian Dictatorship\n\n&quot;Life Exposed is a fascinating and highly original ethnographic analysis of the fragile political, economic, and social transition to post-Soviet citizenship in Ukraine as viewed through the Chernobyl disaster. Above all, it opens a window on a harrowing world with which most English-language readers will be unfamiliar. Through Petryna's well-written presentation of the illness narratives we slowly come to comprehend the enormity of the situation. I know of no other work that makes such a clear case for the importance of biomedical world views, practices, bureaucracies, and negotiations as foundational to contemporary citizenship.&quot;--Rayna Rapp, New York University, author of Testing Women, Testing the Fetus\n\n===================================================================================\nAbout the Author\nAdriana Petryna is Assistant Professor in the Department of Anthropology at the New School.\n===================================================================================","torrent":{"xt":"urn:btih:d77b3e29364f1e1eed5ffdbe72512ddbcf579ab6","amp;dn":"Adriana+Petryna+-+Life+Exposed.+Biological+Citizens+after+Cherno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d77b3e29364f1e1eed5ffdbe72512ddbcf579ab6","infoHashBuffer":{"type":"Buffer","data":[215,123,62,41,54,79,30,30,237,95,253,190,114,81,45,219,207,87,154,182]},"announce":[],"urlList":[]}}