{"title":"NoBloat v1.3.4 .apk","uid":9439128,"size":172255,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d7cffee44de152220d9b251d7f1c4fe36899a795&amp;dn=NoBloat+v1.3.4+.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"biffking","files":1,"time":1388964628,"description":"ROOT REQUIRED.\nNoBloat lets you delete unwanted apps that come pre-installed with your phone. Simply select the bloatware that you want to get rid of and click delete. By default, NoBloat will automatically place backups on your external storage which you can restore at any time.\nRemember, though: ALWAYS have a backup of your phone. Important features might break when deleting system apps.\nUsing the blacklist in the full version, you can swiftly get rid of all bloatware after installing a new ROM. When wiping your phone's data, you can export your blacklist to import it on your new ROM.\nYou're advised to try the free version before buying. Not all ROMs allow NoBloat to work.\n\nFree version features\n* Disabling and enabling system apps\n* Creating backups of system apps and restoring them\n* Deleting system apps\n\nFull version features\n* Creating a blacklist of system app to delete\n* Batch operation to backup/remove all blacklisted system apps\n* Batch operation to enable all disabled system apps\n* Batch operation to restore all backups\n* Export your settings and blacklist to external storage to import them later\n* Quickly find apps using the search functionality\n\nNotes\n* If you have issues uninstalling apps, try uninstalling the app's updates or enabling USB debugging.\n* In order to use NoBloat you need root access. If you do not know what root access means, you probably don't have it.\n* Be aware that in order to update your version of Android, you might need all original apps in place. It is advised to always have a backup of deleted apps or to just disable them so you can restore them later\n","torrent":{"xt":"urn:btih:d7cffee44de152220d9b251d7f1c4fe36899a795","amp;dn":"NoBloat+v1.3.4+.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7cffee44de152220d9b251d7f1c4fe36899a795","infoHashBuffer":{"type":"Buffer","data":[215,207,254,228,77,225,82,34,13,155,37,29,127,28,79,227,104,153,167,149]},"announce":[],"urlList":[]}}