{"title":"Allegorithmic Bitmap2Material Pro","uid":10167187,"size":2300878,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d7d5091df7642d2ff0e84dba167bc6be9b13d4e3&amp;dn=Allegorithmic+Bitmap2Material+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ihatethisrecaptcha","files":5,"time":1400357632,"description":"Bitmap2Material PRO version\nI paid for it, sharing it with my piratebros.\n\nBitmap2Material is an incredibly powerful tool that helps you generate full, seamlessly tiling materials (normal map, height map, specular, etc.) from any bitmap image, right within your favorite DCC tool and game engine*.\n\n*DCC tool &amp; engine integration is a Pro licence feature only.\n\nBitmap2Material lets you extract all the possible map from a single diffuse: normal, height, specular, curvature, AO...\n\nFULL CONTROL\nControl and adjust the finest details of your material thanks to the comprehensive set of parameters exposed by B2M.\n\nBitmap2Material provides the ability to make any material tile. You do not need to care anymore about making your photography tile, B2M takes care of it for you. You can chose between 2 modes of tiling.\n\nB2M offers the unique ability to randomize your material and produce infinite variations with a single click!\n\nThanks to the integration of the Substance Engine into the most used DCC tools and game engines on the market, Bitmap2Material can be used in any of those tools, allowing you to fine tune your material directly on your mesh. This feature is only available with the Pro license.","torrent":{"xt":"urn:btih:d7d5091df7642d2ff0e84dba167bc6be9b13d4e3","amp;dn":"Allegorithmic+Bitmap2Material+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d5091df7642d2ff0e84dba167bc6be9b13d4e3","infoHashBuffer":{"type":"Buffer","data":[215,213,9,29,247,100,45,47,240,232,77,186,22,123,198,190,155,19,212,227]},"announce":[],"urlList":[]}}