{"title":"Willie Nelson - Country Willie - His Own Songs (1965) [FLAC]","uid":10308739,"size":170474017,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8820dce5203b9afd875858e42cba51f55468355&amp;dn=Willie+Nelson+-+Country+Willie+-+His+Own+Songs+%281965%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1402163538,"description":"downloaded from Qobuz\n\nThe back of this record says, &quot;Willie writes the songs...You make them into hits&quot; and proceeds to talk about some of the artists who have had hits from the pen of Willie Nelson. While some of these tunes showed up in their original versions on the United Artist album Best of Willie Nelson, this is still worth tracking down. ~ Jim Worbois, Allmusic\n\nTracks:\n01. One Day at a Time (2:30)\n02. My Own Peculiar Way (2:54)\n03. Night Life (2:21)\n04. Funny How Time Slips Away (2:36)\n05. Healing Hands of Time (2:26)\n06. Darkness on the Face of the Earth (2:23)\n07. Hello Walls (2:10)\n08. Are You Sure (2:08)\n09. Mr. Record Man (2:11)\n10. It Should Be Easier Now (2:40)\n11. So Much to Do (2:01)\n12. WIthin your Crowd (2:03)\n\nFrom the original back cover:\n&quot;Willie writes the songs...You make them into hits&quot;\nDo you think he's kidding in calling himself 'Country Willie?' Unless you farm 101 acres (he has an even 100 surrounding his home place) or raise 165 hogs (he has 164) or 46 head of cattle (he has 45) or 391 chickens (he has 390), then Willie Nelson is actually more &quot;country&quot; than you and a lot of other folks. But that doesn't mean you and Willie don't have a lot in common. A likin' for country music, for example.\nHe writes the songs...You make them into hits. And the connecting link--the singers who record his music--have included everybody from Ernest Tubb to Julie London, and Governor Jimmie Davis to Damita Jo. And now, Willie takes the direct farm-to-market road, personally recording for you his hits, and several hits-to-be. Look at the list of titles! They recall stars like Faron Young ('Hello Walls'), Johnny Tillotson, Perry Como and Billy Walker ('Funny How Time Slips Away'), Ray Price and Doris Day ('Night Life') and going through this album, start to finish, you're going to have just ONE star in mind--Willie Nelson--'cause, friend, he sings 'em like he writes 'em: great!\nChet Atkins doesn't claim that he &quot;discovered&quot; Willie. Too many people in other cities where Willie worked his way up had already tabbed this lad for stardom. It was just Chet's luck that he got there first with the piece of paper that said: (Sign Here). And now, it's our pride to bring you the farming songwriter-singer COUNTRY WILLIE and HIS OWN SONGS. Bet this will be an experience you won't forget!","torrent":{"xt":"urn:btih:d8820dce5203b9afd875858e42cba51f55468355","amp;dn":"Willie+Nelson+-+Country+Willie+-+His+Own+Songs+%281965%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8820dce5203b9afd875858e42cba51f55468355","infoHashBuffer":{"type":"Buffer","data":[216,130,13,206,82,3,185,175,216,117,133,142,66,203,165,31,85,70,131,85]},"announce":[],"urlList":[]}}