{"title":"Fairy Tail &quot;Amateur&quot; Collection #2 - Part 1","uid":9526484,"size":65491702585,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d9280ab0aa32810ba9faf14cd5e4009ae96f5256&amp;dn=Fairy+Tail+%26quot%3BAmateur%26quot%3B+Collection+%232+-+Part+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Anime1901","files":-1,"time":1390757989,"description":"Yo, &quot;minna-san&quot; (means guys in Japanese)!!!\n\nBIG NEWS!!!! \nAs you can see have I reuploaded this part. This is not a update, just so you know it, but a reuploaded torrent.That's because I made some errors in the previous one. In some of the past days have I seen many people who have been downloaded this collection - part 1 - have been stuck at 99 %, and I know that suck. Therefore I have fixed these errors in this reuploaded Fairy Tail &quot;Amateur&quot; Collection #2 - Part 1. I really hope you guys notice this reuploaded collection and download this instead. For those who are almost finished with the downloading, can replace the files that they have downloaded already. \n\nCOLLECTION - PART 1 INF: \n\nWhat'z up? I hope you all are fine. Anyway, finally I am out with the second update of Fairy Tail &quot;Amateur&quot; Collection. I know I am late as usual, but like all of you guys we are busy with other things like school and work. \n\nAnyhow, originally I intended to upload this update at New Year, but as always I am late and this time I four days late. -.- \n\nThe entire collection has been broken up into 2 torrents because I weren't allowed to upload it as 1 torrent.\n\nThe new things/changes in part 1: \n\n- OVA 5 and 6. First of all I will thank the author Hiro Mashima for the special   chapters, A-1 Pictures, Satelight for the anime and finally \n  &quot;Hatsuyuki&quot; fansubs group for the subbing. \n\n- Fairy Tail OST songs have been re-ripped by me, because I bought the first OST on my vacation in Tokyo (yeah, I know I am lucky bastard :3), but the CD-covers have been received from &quot;Nipponsei&quot; fan group. \n\n\nThe new things/changes in part 2: \n\n- There have been added over 200+ new Fairy Tail fanart. Enjoy! :D As I have said before: &quot;I can't give credit to all the artist, but still I am really grateful for their effort. I hope to see many more good fan art artist in the future&quot;. \n\n- In addition, there have been added over 200+ new Fairy Tail hentai pics and most of them are from fairytailpixxx.com. The hentai pics from Fairy Tail PiXXX have been downloaded from this site: http://g.e-hentai.org/g/605754/8c322cf492/. I am very grateful. Thank you, bro! Then again I have to thank &quot;Nabe&quot; (that unfortunately resigned his job at hentaikey) for all the great artwork. I hope we can see good things from the new artist, &quot;Ferds&quot;, that is currently the artist at fairytailpixxx.com \n  The other hentai pics have been downloaded from sites like hentai.ms and other hentai sites. Then I have to say it again: &quot;I can't give credit to all the artist, but still I am really grateful for their effort. I hope to see many more good hentai artist in the future&quot;. \n\nThat was all the updates for this time. (Credit from the original collection: check the &quot;read me&quot; files part 1 and 2. Thank you!)\n\nPick and choose what you want from it, but please seed too and I hope you enjoy the collection as much as I do. :)\n\nNo credit for me. I am just a collector. :P\n\nNow then, happy fuc**** new year 2014, ma bitches!!!!! I hope I see you in hell!! Nah, just kidding happy new year, minna-sama. \nI hope you enjoy your new year present. :) (Though I am four days late -.-)\n\nNow then, enjoy it and seed fuc****!!! :D Nah, just kidding. Please seed, guys, seeeed!!!!\n\nMany kinds regards\n\nAnime 1901\t\t","torrent":{"xt":"urn:btih:d9280ab0aa32810ba9faf14cd5e4009ae96f5256","amp;dn":"Fairy+Tail+%26quot%3BAmateur%26quot%3B+Collection+%232+-+Part+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9280ab0aa32810ba9faf14cd5e4009ae96f5256","infoHashBuffer":{"type":"Buffer","data":[217,40,10,176,170,50,129,11,169,250,241,76,213,228,0,154,233,111,82,86]},"announce":[],"urlList":[]}}