{"title":"Spartacus 1960 1080p mp4 3.4 Gb","uid":10217929,"size":3557812098,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d9625de5def9d382a131683357f35e36389fb931&amp;dn=Spartacus+1960+1080p+mp4+3.4+Gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"audiomaximus","files":1,"time":1400990924,"description":"Stanley Kubrick was only 31 years old when Kirk Douglas (star of Kubrick's classic Paths of Glory) recruited the young director to pilot this epic saga, in which the rebellious slave Spartacus (played by Douglas) leads a freedom revolt against the decadent Roman Empire. Kubrick would later disown the film because it was not a personal project--he was merely a director-for-hire--but Spartacus remains one of the best of Hollywood's grand historical epics. With an intelligent screenplay by then-blacklisted writer Dalton Trumbo (from a novel by Howard Fast), its message of moral integrity and courageous conviction is still quite powerful, and the all-star cast (including Charles Laughton in full toga) is full of entertaining surprises. Fully restored in 1991 to include scenes deleted from the original 1960 release, the full-length Spartacus is a grand-scale cinematic marvel, offering some of the most awesome battles ever filmed and a central performance by Douglas that's as sensitively emotional as it is intensely heroic. Jean Simmons plays the slave woman who becomes Spartacus's wife, and Peter Ustinov steals the show with his frequently hilarious, Oscar-winning performance as a slave trader who shamelessly curries favor with his Roman superiors. The restored version also includes a formerly deleted bathhouse scene in which Laurence Olivier plays a bisexual Roman senator (with restored dialogue dubbed by Anthony Hopkins) who gets hot and bothered over a slave servant played by Tony Curtis. These and other restored scenes expand the film to just over three hours in length. Despite some forgivable lulls, this is a rousing and substantial drama that grabs and holds your attention. Breaking tradition with sophisticated themes and a downbeat (yet eminently noble) conclusion, Spartacus is a thinking person's epic, rising above mere spectacle with a story as impressive as its widescreen action and Oscar-winning sets. \n\nI downloaded a 12 gig 1080p version and reduced it to 3.4 gig for easier sharing.  Add this to your collection of excellent classic movies and help share by seeding.\n\n\nVideo\n\n1920 x 864   2300 kbps  24fps  mp4  runtime 3:16:39\n\n\nAudio\n\nMP3    128kbps  48khz  stereo","torrent":{"xt":"urn:btih:d9625de5def9d382a131683357f35e36389fb931","amp;dn":"Spartacus+1960+1080p+mp4+3.4+Gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9625de5def9d382a131683357f35e36389fb931","infoHashBuffer":{"type":"Buffer","data":[217,98,93,229,222,249,211,130,161,49,104,51,87,243,94,54,56,159,185,49]},"announce":[],"urlList":[]}}