{"title":"Charlie Byrd - Byrd's Word! (1958) [FLAC] {OJC 1054}","uid":10318271,"size":279291486,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da82c1375387368cee3c4621e314278987eeae39&amp;dn=Charlie+Byrd+-+Byrd%27s+Word%21+%281958%29+%5BFLAC%5D+%7BOJC+1054%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ArkieOkie","files":-1,"time":1402273987,"description":"eac secure cue log scans\n\nCharlie Byrd - Byrd's World! (1958) [FLAC] {OJC 1054}\n\nByrd's Word! is an early Charlie Byrd recording that finds the guitarist in a variety of settings. The idea seems to be showcasing Byrd with a number of friends, including valve trombonist Bobby Felder, tenor saxophonist Buck Hill, and pianist Tee Carson. Though there are really no bad cuts on the album, the content is so diverse -- acoustic trios, electric guitar with brass, and acoustic guitar with vocals -- that the album doesn't flow as a whole. &quot;Byrd's Word&quot; opens the album, with a big brassy sound, complete with Byrd cutting loose on electric guitar. On this cut, and even more so on &quot;Bobby in Bassoonville,&quot; his electric guitar sounds derivative of Charlie Christian or Herb Ellis. The best material finds an acoustic Byrd already in his small combo niche, as on &quot;Satin Doll,&quot; with bassist Keter Betts and drummer Eddlie Phyfe. On &quot;Conversation Piece,&quot; Byrd and Betts perform an intimate, bluesy instrumental with lots of interplay. Two quiet cuts, &quot;Blue Turning Grey Over You&quot; and &quot;Don't Explain,&quot; feature Ginny Byrd on vocals. These quiet songs, with her airy, pleasant vocals, backed only by Byrd's guitar, make for great listening. The variety of material and styles gives the impression that Byrd was experimenting, but even so, his experimentation was conservative. His electric playing looks back toward swing while his acoustic playing leans toward quieter ballads. The issue then is less about style than approach: To plug in or to not plug in, that is the question. Byrd's Word! may not be a great album, but it is certainly a good place to get a look at Byrd's early development. \n\nTracks\n01 - Byrd's World\n02 - Blue Turning Grey Over You\n03 - Bobby In Bassoonville\n04 - Satin Doll\n05 - Tri-X\n06 - Conversation Piece\n07 - What's New\n08 - Stompin' At The Savoy\n09 - Don't Explain\n10 - Buck's Hill\n\n\n","torrent":{"xt":"urn:btih:da82c1375387368cee3c4621e314278987eeae39","amp;dn":"Charlie+Byrd+-+Byrd%27s+Word%21+%281958%29+%5BFLAC%5D+%7BOJC+1054%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da82c1375387368cee3c4621e314278987eeae39","infoHashBuffer":{"type":"Buffer","data":[218,130,193,55,83,135,54,140,238,60,70,33,227,20,39,137,135,238,174,57]},"announce":[],"urlList":[]}}