{"title":"Glary Utilities 4.5","uid":9513739,"size":12013792,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dae8a9fb0fa28651bc77392b84a33319758c01ea&amp;dn=Glary+Utilities+4.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"audrey_marian13","files":-1,"time":1390475094,"description":"Glary Utilities is an amazing freeware tool which give you the power of disk cleaning, privacy protection and performance acceleration. Its basic function is to maintain maximum performance of your system by fixing registry errors, deleting clutters, safeguarding confidential files and optimizing internet speed.\n\nIts user interface is created to be easily used by both novices and professionals, with clear and detailed directions to all of its features in just 1 or 2 clicks. Professional users can also gain access to wide variety of abundant options.\n\nSee what Glary Utilities has to offer:\n\n    Disk Cleaner - Removes junk data from your disks and recovers disk space\n    Registry Cleaner - Scan and clean up your registry to improve your system's performance.\n    Shortcuts Fixer - Corrects the errors in your startmenu &amp; desktop shortcuts\n    Startup Manager - Manages programs which run automatically on startup\n    Memory Optimizer - Monitors and optimizes free memory in the background\n    Tracks Eraser - Erases all the traces,evidences,cookies,internet history and more\n    File Shredder - Erases files permanently so that no one can recover them\n    Internet Explorer Assistant - Manages Internet Explorer Add-ons and restores hijacked settings\n    Disk Analysis - Get details information of the desired files and folders\n    Duplicate Files Finder - Searchs for space-wasting and error producing duplicate files\n    Empty Folders Finder - Find and remove empty folders in your windows\n    Uninstall Manager - Completely uninstall programs you don't need any more\n","torrent":{"xt":"urn:btih:dae8a9fb0fa28651bc77392b84a33319758c01ea","amp;dn":"Glary+Utilities+4.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dae8a9fb0fa28651bc77392b84a33319758c01ea","infoHashBuffer":{"type":"Buffer","data":[218,232,169,251,15,162,134,81,188,119,57,43,132,163,51,25,117,140,1,234]},"announce":[],"urlList":[]}}