{"title":"DDFBsty.Romanian.Jasmine.Black.Breasty.Breakfst.2014.xXx-BASTARD","uid":10376786,"size":725697641,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:db3fd34b0400f983e16fd8b7c23b1d3285d74c17&amp;dn=DDFBsty.Romanian.Jasmine.Black.Breasty.Breakfst.2014.xXx-BASTARD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1403016075,"description":"DDFBsty.Romanian.Jasmine.Black.Breasty.Breakfst.2014.xXx-BASTARD\n\n\nIt's breakfast time at the Jasmine Black home in this serving of big breast sex, and for the Romanian bombshell the meal includes both a cup of coffee and a serving of rigid sausage. On this day her lucky entree is Lance Hardwood, and Jasmine can barely contain herself as he sips his java. Moments later she is cramming her 34D rack, supported by a turquoise boulder-holder, right into his face!\n\nAfter enjoying his nipple-sucking, Jasmine gets the stiff lad on his back so she can lap his log and rub it between her globes. All the time she keeps looking over at us in her Full HD video and nude pics, pleased to know we ire drooling for her dugs and jacking up a storm as she shows how uninhibited she can get so early in the morning.\n\nWhile Lance bangs her box, putting her ankles over his shoulders as he powers into her pie, we see him squeezing Jasmine is big natural boobs only moments before she lifts them up to lick the nips herself. We really get to watch those jugs in jiggly action as she gets done from behind while standing up, then later riding his rod cowgirl style.\n\nUltimately it comes back to a good ole titty fuck, though, and Jasmine happily receives cream on her cleavage from her man is squirting breakfast treat!","torrent":{"xt":"urn:btih:db3fd34b0400f983e16fd8b7c23b1d3285d74c17","amp;dn":"DDFBsty.Romanian.Jasmine.Black.Breasty.Breakfst.2014.xXx-BASTARD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db3fd34b0400f983e16fd8b7c23b1d3285d74c17","infoHashBuffer":{"type":"Buffer","data":[219,63,211,75,4,0,249,131,225,111,216,183,194,59,29,50,133,215,76,23]},"announce":[],"urlList":[]}}