{"title":"Captain Flash complete 1954","uid":9538042,"size":81354251,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:dbcdf10f996b304bf853913decbe318bd41da52c&amp;dn=Captain+Flash+complete+1954+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Mothra67","files":-1,"time":1390967103,"description":"Captain Flash was Keith Spencer, a science professor who lived in Atom City, a municipality located somewhere in western United States. As the name implies, lots of atomic research went on there. One day, Keith Spencer was a teaching a class when an experiment with radioactivity went horribly wrong. Keith bravely shielded his students with his own body, absorbing all the radiation. Although he survived the experience, he knew that the radiation would eventually kill him and prepared for a slow, painful death.\n\nBut to Keith's surprise and disbelief, he didn't die. In fact, the radiation seem to have made him feel stronger, faster, more resilient and generally better then ever before. Keith ran several experiments, not daring to allow himself a glimmer of hope, but the results came back the same. Keith clapped his hands and, to his amazement, this set off a miniature atomic explosion within his body. He became taller and more muscular, and his newfound abilities increased exponentially. Keith decided to use his powers to fight crime and protect the Atom City from anyone who tries to use the power of the atom for nefarious purposes as Captain Flash.\n\nThe effect of the atomic explosion were temporary. Whenever Keith needed to become Captain Flash, he had to clap his hands and his powers returned to their peak. Sometimes, the power ran out in the middle of the fight (the comics never established just how long they were supposed to last), but he could regain it by clapping his hands. He fought Eastern Block agents, aliens and supernatural creatures (most of which were after the research conducted in Atom City) He was nicknamed &quot;America's Ace Defender.&quot; Ricky Davis, a student in Keith's class, didn't have any super powers, but he put on a costume and tagged along as Captain Flash's sidekick, Ricky. Mostly, it was out of a sense of obligation (after all, Keith did save his life).\n\nNotes \nCaptain Flash was one of the several &quot;transitional&quot; heroes created between the decline of superheroes at the end of the Golden Age and the beginning of Silver Age. Like other heroes of his type, he was meant to test the waters for a superhero revival. Since it (obviously) didn't take, he only lasted for a few months.\n\nGolden Age Appearances  \nCaptain Flash #1-4","torrent":{"xt":"urn:btih:dbcdf10f996b304bf853913decbe318bd41da52c","amp;dn":"Captain+Flash+complete+1954+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcdf10f996b304bf853913decbe318bd41da52c","infoHashBuffer":{"type":"Buffer","data":[219,205,241,15,153,107,48,75,248,83,145,61,236,190,49,139,212,29,165,44]},"announce":[],"urlList":[]}}