{"title":"The Orb - Orblivion [1997]","uid":9530907,"size":414953925,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc01ee9b5c46917253ac6a0a78f29ace11506ec0&amp;dn=The+Orb+-+Orblivion+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"GenXRock","files":-1,"time":1390842274,"description":"Review by Sean Cooper  [-]\nIf the Orb's 1995 release Orbus Terrarum was an extended meditation on the earthbound, the band's follow-up in Orblivion rises from the muck of primordial ectoplasm for a guided tour of late 20th century Western culture's more paranoid face. From the Cold War (the album kicks off with Joseph McCarthy's intoning of the immortal invective &quot;Are you now, or have you ever been...&quot;) to the pre-millennial ranting of David Thewlis' warped, apocalyptic monologue from Mike Leigh's Naked (&quot;The bar code! The ubiquitous bar code!&quot;), Orblivion does for post-industrial, turn of the century mania what earlier albums such as The Orb's Adventures Beyond the Ultraworld and U.F.Orb did for aliens and flying saucers. Like the previous record -- an effusive mix of sprawling environmental textures, clanging, treated percussion, and humorous, trainspottery samples -- Orblivion brings with it another adjustment in mood, combining elements of downbeat, electro, and drum'n'bass with dense, soupy amalgams of treated electronics and shimmering rhythms. Orblivion also evidences a renewed interest in the more immediately engaging, upbeat pop of &quot;Perpetual Dawn&quot;- and &quot;Little Fluffy Clouds&quot;-era Orb, with a deeper, more embellished sound marked, in all likelihood, by the first full-time contributions from former engineer Andy Hughes (who replaced Kris Weston after the latter's departure in 1994). Dub is still the organizing principle of the Orb's music, however, and whatever one's opinion of the actual album (reactions are likely to range from &quot;genius&quot; to &quot;aimless&quot;) the production is undeniably amazing. (4.5/5)","torrent":{"xt":"urn:btih:dc01ee9b5c46917253ac6a0a78f29ace11506ec0","amp;dn":"The+Orb+-+Orblivion+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc01ee9b5c46917253ac6a0a78f29ace11506ec0","infoHashBuffer":{"type":"Buffer","data":[220,1,238,155,92,70,145,114,83,172,106,10,120,242,154,206,17,80,110,192]},"announce":[],"urlList":[]}}