{"title":"Various Production - The World is Gone [2006][FLAC][Japenese Edi","uid":10189802,"size":318094023,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dcfb59e2de45fa6244ba30bdf5fddceb9da460e9&amp;dn=Various+Production+-+The+World+is+Gone+%5B2006%5D%5BFLAC%5D%5BJapenese+Edi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aron990","files":18,"time":1400621852,"description":"Various, or Various Production, is an English dubstep/electronic music duo formed in 2002. The group blends samples, acoustic and electronic instrumentation, and singing from a revolving cast of vocalists. Its members, Adam and Ian, purposefully give very little information about the group or themselves, and tend to do little in the way of self-promotion.[1] Nevertheless, the group began winning critical acclaim with its single releases in 2005 and 2006, with singers Rachel Thomas Davies and Nicola Kearey.[2] Their full-length for XL, The World is Gone, arrived in July 2006.[3][4][5][6][7] They have released a large number of vinyl EPs and 7&quot; records, as well as digital exclusives for Rough Trade, iTunes, and Boomkat.[8] They have released remixes of a large variety of artists (sometimes uncredited) such as Thom Yorke, Adele, Virus Syndicate, Dave Cloud, Cat Power, Emma Pollock and Ian Brown and participated with one track on the Vexille Movie Soundtrack.\n\nIn 2002, the group started their own record label, called Various Records or Various Production, where they began releasing their own material, usually on 7&quot; or 12&quot; vinyl, or later as mp3 releases.[9] In 2009 the duo started another label, called &quot;Misc&quot;, this time for selling artworks and other products.\n\nThe duo signed a publishing deal with the newly formed Fire Songs in November 2007, a division of eclectic London-based record label Fire Records. In early 2009 they released a new LP, an experimental collaboration with poet Gerry Mitchell called The Invisible Lodger and signed the first act to release on the Various Production label, Gold Panda.\n\n\nGenre : Dub / Leftfield / Grime \nYear drive : 2006 \nManufacturer disk : Japan \nAudio codec : FLAC \nType rip : tracks +. cue \nBitrate : lossless \nDuration : 53:55\n\nTracklist : \n1. Various Production - Thunnk (2:22)\n2. Various Production - Circle Of Sorrow (4:30)\n3. Various Production - Don't Ask (3:58)\n4. Various Production - Hater (3:58)\n5. Various Production - Soho (5:01)\n6. Various Production - Lost (3:18)\n7. Various Production - Sir (3:50)\n8. Various Production - Sweetness (4:20)\n9. Various Production - Deadman (3:08)\n10. Various Production - Today (3:44)\n11. Various Production - The World Is Gone (3:42)\n12. Various Production - Fly (5:05)\n13. Various Production - Circle Of Sorrow (One Music Live Version) (4:11)\n14. Various Production - Foller (One Music Live Version) (2:48)\n\nExtras.\nInformation : &quot;The World is Gone&quot; - the musical duo's debut album Various. He came 17 July 2006 o the British nindie label XL Recordings and is designed in the genre of dubstep with elements of folk. Besides elements of folk, from the rest of dubstep Â«The World is GoneÂ» features an abundance of vocals, and mostly it is the female that at the time of the release, in principle, it is not peculiar to the dubstep scene. &quot;Dubstep, wrapped in velvet,&quot; as wrote the New York Vice Magazine. On the album there are both completely new tracks and previously released on his own eponymous label Various Production as vinyl singles - original vocal versions of tracks and Hater Sir, as well as vocal Today versions of tracks and Lost, originally issued in the form of instrumental versions edition of 100 copies each just before the release of the album","torrent":{"xt":"urn:btih:dcfb59e2de45fa6244ba30bdf5fddceb9da460e9","amp;dn":"Various+Production+-+The+World+is+Gone+%5B2006%5D%5BFLAC%5D%5BJapenese+Edi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcfb59e2de45fa6244ba30bdf5fddceb9da460e9","infoHashBuffer":{"type":"Buffer","data":[220,251,89,226,222,69,250,98,68,186,48,189,245,253,220,235,157,164,96,233]},"announce":[],"urlList":[]}}