{"title":"Michael Palmer - Resistant (2014) Epub, Mobi","uid":10196443,"size":1086931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df923447bf5cbc3a1f956657343a83959f1365ad&amp;dn=Michael+Palmer+-+Resistant+%282014%29+Epub%2C+Mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"karaokeking123","files":-1,"time":1400697467,"description":"Michael Palmer - Resistant (2014) Epub, Mobi\n\n\n\nWhen Dr. Lou Welcome fills in last minute for his boss at a national conference in Atlanta he brings along his best friend, Cap Duncan. But an accident turns tragic when Cap injures his leg while running.ã€€ Surgeons manage to save the leg, but the open wound is the perfect breeding ground for a deadly microbial invader committed to eating Cap alive from the inside out. Meanwhile, hundreds of miles away, a teenaged girl is fighting for her life against the same bacteria. The germ is resistant to any known antibiotic and the government scientist tasked with finding a cure has been kidnapped. Turning to the Centers for Disease Control for help, Lou Welcome uncovers a link to a shadowy group known as One Hundred Neighbors that has infiltrated our society and is using our health institutions as hostages.ã€€ã€€Like the deadly germs they can unleash, One Hundred Neighbors will stop at nothing to further their agenda. From the hospital corridors where anything you touch can mean your end, to the top corridors of power in this race against time, Lou must stop an epidemic, save his best friend, and face even his own most terrifying demons.From the New York Times bestselling author comes another heart stopping thriller that will make you look at the world around you in a new and frightening way. \n&quot;When you open the pages of a Michael Palmer novel, you know you are in the hands of a pro.&quot; \n\n\nFormats: .epub .mobi\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:df923447bf5cbc3a1f956657343a83959f1365ad","amp;dn":"Michael+Palmer+-+Resistant+%282014%29+Epub%2C+Mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df923447bf5cbc3a1f956657343a83959f1365ad","infoHashBuffer":{"type":"Buffer","data":[223,146,52,71,191,92,188,58,31,149,102,87,52,58,131,149,159,19,101,173]},"announce":[],"urlList":[]}}