{"title":"Dawn of the 21st Century - The Millennium Photo Project (Art Ebo","uid":10295815,"size":50265694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1507a2d1f76971f38cadf99fdaccbc6021591e4&amp;dn=Dawn+of+the+21st+Century+-+The+Millennium+Photo+Project+%28Art+Ebo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"STBGD","files":-1,"time":1401918085,"description":"pdf / English / Smashing Books / 2000 / 320 pages / 48 MB\n\nIn April of 1999, the Millennium Photo Project launched on the internet. The idea was to bring together photographers from around the world to document the passing of the millennium.\nPhotographers in more than a hundred countries, both amateur and professional, submitted thousands of photographs from New Year's Eve. The result of their hard work is a stunning hardcover coffee table book entitled &quot;Dawn of the 21st Century&quot;. It is the only book that documents the arrival of the year 2000 on a worldwide basis.\n\nThe book features 320 pages and more than 500 photos, all taken on New Year's Eve and New Year's Day. It is a whirlwind spin around the globe and features real people in real situations, relaxed and enjoying the company of their families, neighbours and friends.\n\nIt also takes in the splendour of the big events, the wonder of high profile spectacles like the Pyramids, Times Square, the fireworks in Sydney Harbour and every point in between. The book follows people as they seek out more unusual ways to spend the millennium - a boat trip in Antarctica, mountain climbing in Chile, scuba diving in Hawaii, camping in the Botswana desert. The book therefore is a fascinating insight into how the entire world spent a very special and unusual day. One that won't come about for another thousand years!\n\n&quot;A remarkably intimate snapshot of the human condition&quot; -- The Toronto Star\n\nFrom the Author\nThis book came about thanks to the community building power of the Internet and an incredible group of people who believed in the same idea of documenting the arrival of the 21st Century. No big publisher or corporations were involved, instead it came about solely through 'people power', and the commitment and dedication of several thousand individuals around the world. Photographers, both amateur and professional, in 117 countries, responded to the call to submit photos of their New Year's Eve experience. The very best of those photos have been crafted into this beautiful hardcover book. All the photos were taken in the same 24 hour period and the collection provides a fascinating historical insight into how an entire world of cultures celebrated the coming of the 'millennium'. My sincere thanks to everyone who helped make it happen.","torrent":{"xt":"urn:btih:e1507a2d1f76971f38cadf99fdaccbc6021591e4","amp;dn":"Dawn+of+the+21st+Century+-+The+Millennium+Photo+Project+%28Art+Ebo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1507a2d1f76971f38cadf99fdaccbc6021591e4","infoHashBuffer":{"type":"Buffer","data":[225,80,122,45,31,118,151,31,56,202,223,153,253,172,203,198,2,21,145,228]},"announce":[],"urlList":[]}}