{"title":"Chasing Maria Menounos S01E10 It's Good To Be Greek","uid":10198333,"size":191180902,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e337f27bf5e223e3c5b2219aa6659d73e327791e&amp;dn=Chasing+Maria+Menounos+S01E10+It%27s+Good+To+Be+Greek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"benbrown1","files":1,"time":1400725776,"description":"Oxygen Media takes viewers inside the mind and heart of TV personality Maria Menounos as she strives to have it all in the new half-hour docu-series &quot;Chasing Maria Menounos.&quot; Maria shares her personal life for the first time as she challenges expectations and makes untraditional choices while surrounded by tradition. Maria may be best known as the upbeat and beautiful host of &quot;Extra,&quot; traveling the world interviewing celebrities and guest starring on television. But if you dig a little deeper you'll find that Maria is a fearless, confident modern woman who is living her life as she designed it, confronting the obstacles head-on that surround her eclectic career and home life. Maria came from very humble beginnings but never stopped chasing her dreams. Now she lives with her boyfriend of 15 years, Keven, and traditional Greek immigrant parents, Costas and Litsa, who are demanding she at last get married and have children. Though she respects her devoted family and boyfriend's opinions, she tends to make decisions with or without their approval. As Maria turns 35, she contemplates whether she can support her parents and the friends who depend on her, while building a family with Keven and having some fun along the way.\n\nEpisode 10\nIt's Good To Be Greek\nReleased May 20, 2014\n\nCostas stirs up drama at Keven's conversion ceremony in the Season 1 finale. Also: Maria and Keven must make a big decision about having children. ","torrent":{"xt":"urn:btih:e337f27bf5e223e3c5b2219aa6659d73e327791e","amp;dn":"Chasing+Maria+Menounos+S01E10+It%27s+Good+To+Be+Greek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e337f27bf5e223e3c5b2219aa6659d73e327791e","infoHashBuffer":{"type":"Buffer","data":[227,55,242,123,245,226,35,227,197,178,33,154,166,101,157,115,227,39,121,30]},"announce":[],"urlList":[]}}