{"title":"TSSeduction--TS-35172 Yasmin Lee, Beretta James, Robert Axel and","uid":10112226,"size":2519450555,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e34b7f8b6fd52d7235662a430baf15d8ed51ad0a&amp;dn=TSSeduction--TS-35172+Yasmin+Lee%2C+Beretta+James%2C+Robert+Axel+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":-1,"time":1399536075,"description":"Yasmin Lee Stars in a TsSeduction FEATURE MOVE: &quot;The Super Soldier&quot;\n\nMay 7, 2014 - Performers: Yasmin Lee ,  Beretta James ,  Robert Axel  and  Marcus Ruhl \n\n\nMed. Hi and HD MP4 + Pics.\n\n\nTsSeduction.com presents a two part espionage feature film starring Yasmin Lee, Robert Axel, Marcus Ruhl and Beretta James. Yasmin Lee is the most talented agent for a covert, phantom organization that specializes in stealing world military secrets. Yasmin disguises herself as a nurse aide in order to infiltrate the lab of life-time military prisoner and mad scientist, Dr. Axel. \n Dr.Axel's life sentence is to design the military's most advance weapon - the Super Soldier - a man who does not need to sleep or eat. A man who can be controlled by memory manipulation - the most advanced and frightening new technology in military science since the A bomb. \n\nDr. Axel has developed a device that control his soldiers thoughts, implant memories and lessons in a matter of minutes and reorganizes his brain so he does nothing but what he is programmed to do. \n\nDr. Axel's techniques are perverse and highly sexual - he likes to watch his man-made soldier fuck women. He likes to fuck what ever Aide is in the room in the same way his soldier is fucking. Yasmin uses this knowledge in her favour and lets Dr. Axel seduce her, bending her over the lab desk and letting him fuck her ass while he watches his soldier do the same in the other room. \nThe men pound away at their lady's asses and orgasm huge loads of satisfying, pent up cum. \n When Dr. Axel thinks he is done, Yasmin flips him over and reveals her incredible thick, long cock. She spreads his ass and slips inside him, every inch of her cock rocking the depths of him, until she pulls out and releases a large, full load of cum. \n\nCum drunk and satisfied, Dr. Axel is easily convinced by Yasmin to let her clean the smell of sex and ejaculate up. As soon as he leaves the observation room, the real work begins for Yasmin's.\n\nScreens &lt;a href=&quot;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=35172&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsseduction.com/site/shoot.jsp?shootId=35172&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:e34b7f8b6fd52d7235662a430baf15d8ed51ad0a","amp;dn":"TSSeduction--TS-35172+Yasmin+Lee%2C+Beretta+James%2C+Robert+Axel+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e34b7f8b6fd52d7235662a430baf15d8ed51ad0a","infoHashBuffer":{"type":"Buffer","data":[227,75,127,139,111,213,45,114,53,102,42,67,11,175,21,216,237,81,173,10]},"announce":[],"urlList":[]}}