{"title":"The Flight from Science and Reason by Paul R. Gross, et al.","uid":10207917,"size":10055952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e406a96778f972608a723a672b88d17cf74368e6&amp;dn=The+Flight+from+Science+and+Reason+by+Paul+R.+Gross%2C+et+al.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1400872750,"description":"The Flight from Science and Reason (1997) edited by Paul R. Gross, Norman Levitt &amp; Martin W. Lewis.djvu\n\n&quot;Evidence of a flight from reason is as old as human record-keeping: the fact of it certainly goes back an even longer way. Flight from science specifically, among the forms of rational inquiry, goes back as far as science itself... But rejection of reason is now a pattern to be found in most branches of scholarship and in all the learned professions.&quot;--from the introduction\n\nIn the widely acclaimed Higher Superstition: The Academic Left and Its Quarrels with Science, Paul R. Gross and Norman Levitt offered a spirited response to the &quot;science bashers&quot;, raising serious questions about the growing criticism of scientific practice from humanists and social scientists on the academic left. Now, in The Flight from Science and Reason, Gross and Levitt are joined by Martin W. Lewis to bring together a diverse and distinguished group of scholars, scientists, and experts to engage these questions from a wide variety of perspectives.\n\nThe authors take on critics of science whose views range from moderate to extreme, from social constructivists to deconstructionists, from creationists and feminists to Afro-centrists. They discuss the rise of &quot;alternative medicine&quot; and radical environmentalism (here skewered as &quot;ecosentimentalism&quot;). They explain why the &quot;uncertainty principle&quot; does not work as a metaphor for ambiguity, and why &quot;chaos theory&quot; cannot be invoked without an understanding of mathematics. Throughout, they grapple with the paradox inherent in arguing with opponents who contend that reason itself, and thus logic, is suspect. \n\n593 pages\nSeries: Annals of the New York Academy of Sciences (Book 775)\nPublisher: New York Academy of Sciences\nLanguage: English\nISBN-10: 1573310026\nISBN-13: 978-1573310024","torrent":{"xt":"urn:btih:e406a96778f972608a723a672b88d17cf74368e6","amp;dn":"The+Flight+from+Science+and+Reason+by+Paul+R.+Gross%2C+et+al.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e406a96778f972608a723a672b88d17cf74368e6","infoHashBuffer":{"type":"Buffer","data":[228,6,169,103,120,249,114,96,138,114,58,103,43,136,209,124,247,67,104,230]},"announce":[],"urlList":[]}}