{"title":"Quality Street (1937) DVD5 - Katherine Hepburn, Francne [DDR]","uid":9439507,"size":3977269248,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e4513cffa858abb4b2cee484c316059461de018b&amp;dn=Quality+Street+%281937%29+DVD5+-+Katherine+Hepburn%2C+Francne+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1388976152,"description":"Quality Street (1937) DVD5 - Katherine Hepburn, Franchot Tone [DDR]\n\nQuality Street is a 1937 period romance film made by RKO Radio Pictures. It was directed by George Stevens and produced by Pandro S. Berman. Set in 19th century England, the film stars Katharine Hepburn and Franchot Tone. Joan Fontaine makes one of her early (uncredited) film appearances. The screenplay was by Allan Scott, Mortimer Offner and Jack Townley, based on the 1901 play of the same name by J. M. Barrie.\n\nThere was also a silent 1927 film version made by MGM, starring Marion Davies and Conrad Nagel and directed by Sidney Franklin.\n\nThe 1937 version was a flop at the box office, recording a loss of $248,000, one of several RKO films featuring Hepburn which resulted in her being labeled &quot;box office poison&quot; by a national group of movie exhibitors in 1938.\n\nThe film was rarely shown on TV until TCM began airing it. Along with a number of other obscure films Hepburn made in the 1930s, it has recently been issued on DVD for the first time from Warner Archive.\n\n    CAST:-\n    Katharine Hepburn as Phoebe Throssel\n    Franchot Tone as Dr. Valentine Brown\n    Eric Blore as Recruiting Sergeant\n    Fay Bainter as Susan Throssel\n    Cora Witherspoon as Patty\n    Estelle Winwood as Mary Willoughby\n    Joan Fontaine as Charlotte Parratt (uncredited)\n    Bonita Granville as Isabella (uncredited)\n\nDirected by George Stevens\nProduced by Pandro S. Berman\nWritten by Allan Scott, Mortimer Offner\nBased on Quality Street by J. M. Barrie\nMusic by Roy Webb\nRunning time 83 minutes\n\nMOVIE REVIEW:- Quality Street (1937)\nIn 1805 England, eligible bachelors are scarce on Quality Street. Twenty-year-old Phoebe Throssel (Hepburn) becomes very hopeful when one of the few, Dr. Valentine Brown (Tone), tells her he has something important to say to her that day. Both she and her older sister Susan believe he will propose. However, he informs her that he has enlisted in the army to fight in the Napoleonic Wars. Phoebe hides her devastation so well that Dr. Brown never suspects she is deeply in love with him. She gives up hope of ever marrying. By contrast, the Throssels' servant Patty, though she is a decade older and aware she is no beauty, is confident that she will get a man.\n\nFor the next ten years, the Throssels run a school for young boys and girls. Then, with the wars over, Brown returns as a captain. When he comes to invite the sisters to a ball, he is taken aback by how much Phoebe's looks appear to have deteriorated. Hurt by this, Phoebe declines.\n\nTo lift her spirits, Phoebe sheds her drab everyday clothes and dresses up in a beautiful gown. When Brown returns unexpectedly, Patty thinks quickly and identifies her as Phoebe's niece Livy. Taken in completely, Brown invites her to the ball. She accepts, planning to make him eventually fall in love with her, then when he proposes, reject him.\n\nAt the ball, she is quickly surrounded by admirers, much to Brown's annoyance. In the days that follow, she flirts with all the men. Finally, at a picnic, Brown draws Livy away to a gazebo when it starts to rain. To her shock, instead of asking for her hand in marriage, he merely lectures her on her behavior and reveals that he is in love with Phoebe.\n\nThe next day, the Throssels have to fend off their neighbors, the Willougbys, who suspect that Livy and Phoebe are one and the same, particularly elderly Mary Willoughby. When Brown comes calling, the Willoughbys mention their suspicions. He eventually corners Patty and gets the truth from her (she loyally places the blame squarely on his shoulders). With the help of the sergeant who first recruited him, he puts clothes around a large seat cushion and puts &quot;Livy&quot; in a carriage to return home, all in sight of the snooping neighbors. He tells the sergeant and Patty to get rid of the niece and not to return until much later. The couple are delighted to spend time together. Brown goes inside and embraces Phoebe.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 83 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 83 mins","torrent":{"xt":"urn:btih:e4513cffa858abb4b2cee484c316059461de018b","amp;dn":"Quality+Street+%281937%29+DVD5+-+Katherine+Hepburn%2C+Francne+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4513cffa858abb4b2cee484c316059461de018b","infoHashBuffer":{"type":"Buffer","data":[228,81,60,255,168,88,171,180,178,206,228,132,195,22,5,148,97,222,1,139]},"announce":[],"urlList":[]}}