{"title":"Alex Jones Show - 2014 Jan 07 TU [sebaygo1]","uid":9449167,"size":68996190,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e5ef3ca0135a4e10e071af0852a42e2ad0442197&amp;dn=Alex+Jones+Show+-+2014+Jan+07+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":8,"time":1389140423,"description":"\nThe Alex Jones Show \nTuesday, 07 January 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Tuesday, January 7 edition of The Alex Jones Show, Alex continues his coverage of the Fukushima radioactive ocean plume making its way toward the West coast of the United States. Officialdom in California remains perplexed by an increase of radiation and has downplayed its significance. \n\nAlex also takes a look at a call from the corporatist media for Obama to dispense with Congress, the Constitution and the American people and demand he instead rule by decree like a Roman autocrat. \n\nOn today's show, Alex talks with Dr. Christopher Busby, a director of Green Audit Limited and a visiting professor at the School of Biomedical Sciences at the University of Ulster. Dr. Busby talks about the growing threat of Fukushima radiation. \n\nAlex also welcomes back to the program William F. Jasper, a researcher, author and editor of The New American. Jasper talks about transatlantic convergence and the under the radar threat of a globalist contrived Transatlantic Trade and Investment Partnership. \n\nInfowars Nightly News reporter Lee Ann McAdoo files a report from outside the Austin, Texas city council where anti-fluoride activists are holding a hunger strike.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:e5ef3ca0135a4e10e071af0852a42e2ad0442197","amp;dn":"Alex+Jones+Show+-+2014+Jan+07+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ef3ca0135a4e10e071af0852a42e2ad0442197","infoHashBuffer":{"type":"Buffer","data":[229,239,60,160,19,90,78,16,224,113,175,8,82,164,46,42,208,68,33,151]},"announce":[],"urlList":[]}}