{"title":"Alex Jones Show - 2014 Jan 14 TU [sebaygo1]","uid":9478518,"size":75754169,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e64a7f70708d52c876ecd64f3f74ad545611ba15&amp;dn=Alex+Jones+Show+-+2014+Jan+14+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sebaygo1","files":12,"time":1389746222,"description":"\nThe Alex Jones Show \nTuesday, 14 January 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: On this Tuesday, January 14 edition of The Alex Jones Show, Alex looks at the slow and steady dissolution of our individual liberty as the Bill of Rights comes under assault by government, the courts and a predatory national security state. \n\nAlex covers the Kelly Thomas verdict and the state's message that cops are immune from prosecution and are free to beat, torture and murder citizens. \n\nOn today's broadcast, Alex talks with Josie Outlaw, a passionate advocate for the rights of the individual in a time when the state increasingly tromps on natural rights and demands unquestioning fealty from its subjects. Josie produced a viral Youtube video in December explaining why citizens need to be armed in these perilous times. \n\nThe Infowars team files a report from Los Angeles on the continuing story of increased radiation on the West coast in the wake of the Fukushima nuclear disaster and the corporate media's refusal to report on this increasingly serious health risk.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:e64a7f70708d52c876ecd64f3f74ad545611ba15","amp;dn":"Alex+Jones+Show+-+2014+Jan+14+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e64a7f70708d52c876ecd64f3f74ad545611ba15","infoHashBuffer":{"type":"Buffer","data":[230,74,127,112,112,141,82,200,118,236,214,79,63,116,173,84,86,17,186,21]},"announce":[],"urlList":[]}}