{"title":"Sternwheels On The Yukon-Arthur E. Knutson [1979]","uid":9515198,"size":67078117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8ff9aed898fd77222b1529df58b9d676efe05b5&amp;dn=Sternwheels+On+The+Yukon-Arthur+E.+Knutson+%5B1979%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xofokim","files":1,"time":1390508405,"description":"Searchable PDF Scan from paperback. Very rare book!\n\nI'm on a low bandwidth connection, so please be patient and continue to share if you have the capacity.\n\n\nFrom the Back Cover:\n\nWhat was once a way of life is almost forgotten. Only those still living who were actually a part of the action know how it really was. The wood burning sternwheelers plying the Yukon and Tanana rivers were the connecting links for people living in these remote areas.\nDeciding that this bit of history should not pass into oblivion, the author began researching the era. Five seasons of working on the Steamer Yukon gave him the inside track. After years of interviewing people who had been involved in steamboating, corresponding with many others, gathering old pictures and reading everything he could find on the subject, he put it all together in this book. His hope is that the why, the how, the laughter and the tears of those times will re- main a remembered part of our American heritage.\nMr. Knutson has written before but on the vocational level on job related topics. In his avocation of teaching subjects in which he saw a need for training and felt that his efforts would be effective he de- veloped his own texts. In the early 1950s he taught Material Handling for the Puget Sound Naval Shipyard at Bremerton, Washington. This was in a Supervisory training pr6gram under the auspices of Olympic College. At the same time he was on the advisory board to the Washington State Firemen's Training Program .\nEarly in his public works career he spent five years developing a manual for teaching the basics of the potable water field. He taught the pilot class in 1965 at Shoreline College using materials he co- authored. The entire program was funded by the Firemen's Training Bureau in Olym ia, Washington. For this effort he was named Man of the Year by the American Waterworks Association in 1967.\nAs Director of Public Services he has been very successful in re- building older communities. In 1973 the American Public Works Association recognized his accomplishments by naming him one of the Top Ten Public Works Men of the Year.\n\n\nForeword:\n\n&quot;The days of the woodburning steamboats were so romantic. It's a shame that they can't be revived.&quot; These were the sentiments expressed by Cathryne and Jess Knight when my wife, Claire, and I visited them in August of 1972. We were visiting as many of the old steamboat stops as we could, on a trip that we hoped would bring to mind many forgotten incidents.\nThe Knights were right where they had been back in the &quot;good old days&quot; -in Eagle, a small village on the Yukon river. Coming from Yukon Territory, Canada, in- to Alaska, it was the first stop if the river was your high- way.\nIt was early afternoon when we drove up in front of Biederman's store and went in to see who might be there. &quot;I'll be with you in a minute, Sir&quot; Cathryne called as she continued waiting on a customer. No &quot;grab a cart and find it yourself' service in this little town. A few moments later she turned to us and remarked &quot;You look very familiar to me.&quot; I grinned and told her &quot;If my memory is correct, in 1938, we delivered a brand new Dodge Sedan to you here in Eagle so you could run around on the seven miles of road existing here then.&quot; A startled look came over her face. &quot;Yoll are so right! Now, who in the world are you?&quot;\nMemories came flooding back as I talked to these people. Thirty-two years had passed since last we visited and there was a great deal of news to catch up on and many old time experiences to laugh over -\tMore on the Dodge later.\nThe first time I had seen the Knights was late in Sep- tember of 1937. We had been stuck on a sandbar in the Yukon River flats below the village of Circle City. Cathryne and Jess were on their way &quot;outside&quot; and their patience being exhausted after a fifty-four hour wait for our boat to pick them up, they had arranged to have Jim- my Dotson, a bush pilot of the first order, fly them to where we were toiling to free the boat.Â·They weren't the only ones who were unhappy! It took us seventy-two hours of continuous, grinding labor to move the two hundred and eleven foot steamboat over the top of that sandbar when a two foot depth of water was the most that could be found anywhere and the boat drew three and a halffeet.\nYou may romance all you choose about steamboating but it would be very difficult to convince a deckhand, pilot, mate or engineer of a boat stuck on a sandbar with the water level dropping because the tributaries were freezing, that there was anything good to be said about that damn way to make a living.\nAs we proceed through these pages we will be talking about the techniques used to accomplish what appeared to be impossible tasks. It could now probably be called almost a lost art. I felt a sense of responsibility to document the &quot;how&quot; of Yukon River steamboating.\nYou can buy books listing the names of steamboats, displaying their pictures and perhaps giving a short run- down of where they were used. Occasionally a few officers will be listed. Nowhere in any of the many books I read have I found any information about how certain things were done. I have heard tourists ask questions about the way things were accomplished and what was that thing over there used for and why is this built in such a way? Even the guides on the preserved steamboats have no knowledge of the procedures and can give no really satisfactory answers.\nI served my first four years under the finest of steam- boat mates, Fred Racy, who was First Mate on the Steamer Yukon. He liked me and made it a point to pass on to me as much of his vast knowledge of steamboating as I could absorb. When Fred had a stroke on board, early in the Spring of 1940, he left a vacancy in the of- ficers ranks. I was the only person on board with a mate's license so ready or not, I was promoted to Second Mate and a brand new set of responsibilities and experiences.\nAn old friend and I had come to Washington State from Nebraska in 1934. This was during the depression and we found things no better in Washington than back home.\nWork wasn't plentiful anywhere. We had no job skills but we did know how to work, took anything offered and weren't fussy about the pay as long as there were a few dimes in it for us.\nIt was during this time that I met Claire, the girl who was later to become my wife. Letters I wrote to her from the Yukon have been a source of material which might have been lost had she not saved many of them. Datelines and articles in quotes are from these letters and were in- serted wherever they might add interest or clarity to the text.\nI had no idea that she had kept two years of my correspondence. It only came to light when I started researching for this book. She had insisted that my let- ters be at least three pages long and we laugh about the fact that I was too bashful to write anything mushy so I had to fill the pages with a running account of day-to-day incidents, many of which I had forgotten about until the letters came to light.","torrent":{"xt":"urn:btih:e8ff9aed898fd77222b1529df58b9d676efe05b5","amp;dn":"Sternwheels+On+The+Yukon-Arthur+E.+Knutson+%5B1979%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8ff9aed898fd77222b1529df58b9d676efe05b5","infoHashBuffer":{"type":"Buffer","data":[232,255,154,237,137,143,215,114,34,177,82,157,245,139,157,103,110,254,5,181]},"announce":[],"urlList":[]}}