{"title":"Alan B. Krueger - What Makes a Terrorist. Economics and the Root","uid":10220490,"size":3381780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eade906cb1ada65803d87aa827aaadbbad957821&amp;dn=Alan+B.+Krueger+-+What+Makes+a+Terrorist.+Economics+and+the+Root&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anette14","files":-1,"time":1401036204,"description":"Description\nProduct Details\nBook Title: What Makes a Terrorist: Economics and the Roots of Terrorism\t\nBook Author: Alan B. Krueger (Author)\nPaperback: 208 pages\nPublisher: Princeton University Press; New edition (September 22, 2008)\nLanguage: English\nISBN-10: 0691138753\nISBN-13: 978-0691138756\n\n===================================================================================\nBook Description\nMany popular ideas about terrorists and why they seek to harm us are fueled by falsehoods and misinformation. Leading politicians and scholars have argued that poverty and lack of education breed terrorism, despite the wealth of evidence showing that most terrorists come from middle-class, and often college-educated, backgrounds. In What Makes a Terrorist, Alan Krueger argues that if we are to correctly assess the root causes of terrorism and successfully address the threat, we must think more like economists do.\nKrueger is an influential economist who has applied rigorous statistical analysis to a range of tough issues, from the minimum wage and education to the occurrence of hate crimes. In this book, he explains why our tactics in the fight against terrorism must be based on more than anecdote and speculation. Krueger closely examines the factors that motivate individuals to participate in terrorism, drawing inferences from terrorists' own backgrounds and the economic, social, and political conditions in the societies from which they come. He describes which countries are the most likely breeding grounds for terrorists, and which ones are most likely to be their targets. Krueger addresses the economic and psychological consequences of terrorism. He puts the terrorist threat squarely into perspective, revealing how our nation's sizeable economy is diverse and resilient enough to withstand the comparatively limited effects of most terrorist strikes. And he calls on the media to be more responsible in reporting on terrorism.\nWhat Makes a Terrorist brings needed clarity to one of the greatest challenges of our time.\n\n===================================================================================\nReviews\n&quot;Alan Krueger . . . has done path-breaking research on why so many terrorists come from middle-class backgrounds.&quot;--David Leonhardt, New York Times\n\n&quot;Full of first-rate empirical work.&quot;--Tyler Cowen, Marginal Revolution\n\n&quot;Economist Alan Krueger explores this phenomenon with a systematic study of the evidence. . . . All in all, the research that Krueger gathers together suggests that if there is a link between poverty, education and terrorism, it is the opposite of the one popularly assumed.&quot;--Tim Harford, Financial Times\n\n&quot;An invaluable little book. . . . uses standard tools of economics and statistical analysis to get at the truth about terrorism.&quot;--Daniel Finkelstein, Times (London)\n\n&quot;In a compelling analysis, Krueger points out how a lack of legitimate political expression and civil liberties turns some individuals to terrorism. He also provides a pointed and witty account of the problems the U.S. administration has faced in its own attempts at empiricism. . . . This book is a model of how academics can contribute to major public policy debates.&quot;--Lawrence D. Freedman, Foreign Affairs\n\n&quot;What are the individual and societal causes of terrorism? The book's great strength is its focus on new sources of data examined in new ways. The most compelling analysis in the book is of biographical information on operatives from Hezbollah and Hamas. This is a substantial contribution, offering insight into who becomes a terrorist and, as important, pushing terrorism studies in a productive new direction, toward microlevel data. The book provides a valuable service in dispelling the stereotype of the poor, ignorant terrorist.&quot;--Ethan Bueno de Mesquita, Science\n\n&quot;It seems universally obvious that poverty and poor education breed terrorism. But it's wrong.... [Alan Krueger] went in search of evidence for the terrorism part of the proposition and found next to none. He has set out his findings in What Makes A Terrorist.&quot;--Peter Martin, Canberra Times\n\n&quot;This new book by Alan Krueger, full of first-rate empirical work, punctures many myths about terrorism.&quot;--Tyler Cowen, Marginal Revolution\n\n&quot;[Krueger] seeks to put the risks Americans face from terrorism into 'proper perspective' with his unique book.&quot;--John McCaslin, Washington Times\n\n&quot;What Makes a Terrorist brings together disparate data, such as academic studies and government reports, arraying them into a concise, accessible argument against the notion that we can defeat terrorism through aid and education. While Krueger is careful to affirm that these are useful in combating many social ills, he is adamant that terrorism is not one of them. He offers skilled analysis to show that an aggressive foreign policy based on this fallacious assumption has cost several nations dearly and also warns that continuing along this course may provoke further terrorist acts.&quot;--Tony Azios, Christian Science Monitor\n\n&quot;Using raw data from government, academic, and think-tank sources and citing the work of other economists on poverty, race, terrorism, and hate crimes, Krueger explains in clear and accessible prose that the average terrorist suspect is highly educated, professionally employed, from a middle- or higher-class background, and, most important, from a country that suppresses civil liberties...Avoiding jargon whenever possible and defining it when unavoidable, Krueger excels in making his difficult subject easy to grasp without reducing its inherent complexity. The occasional pop culture reference (e.g., to the Daily Show) adds to the appeal. Highly recommended for both academic and public collections.&quot;--April Younglove, Library Journal (starred review)\n\n&quot;What makes a terrorist? Are the drivers primarily political or economic? Princeton economist Alan Krueger has made a great study of this question...What Makes a Terrorist lacks a question mark. That's because Krueger, marshaling persuasive statistics and analysis, comes down firmly on the side of politics, noting most terrorists are middle-class and well-educated.&quot;--Thomas P.M. Barnett, Knoxville News Sentinel\n\n&quot;Economist Alan Krueger explores this phenomenon with a systematic study of the evidence.... All in all, the research that Krueger gathers together suggests that if there is a link between poverty, education and terrorism, it is the opposite of the one popularly assumed.&quot;--Tim Harford, Financial Times\n\n&quot;[Krueger] analyzed data from NCTC and elsewhere, and came up with often counter-intuitive findings...Krueger's book collects comprehensive evidence.&quot;--Zack Phillips, Government Executive\n\n&quot;An invaluable little book.... What Makes a Terrorist uses standard tools of economics and statistical analysis to get at the truth about terrorism.... Krueger finds one familiar fact in all his numbers. Countries with fewer civil liberties tend to produce more terrorists.&quot;--Daniel Finkelstein, Times (London)\n\n&quot;Krueger's book is a necessary read for anyone who wishes to understand terrorism, especially because many of the popular notions of what causes it are not rooted in reality. One wishes that politicians, especially, would pay attention.&quot;--Amit Varma, Live Mint\n\n&quot;[Krueger] in his groundbreaking new book, What Makes a Terrorist, enlists the 'dismal science' to tackle the despicable one. Provocative, dispassionate and accessible, Krueger's book is a breath of fresh air in the stifling climate of empty speculation that dominates the terror dialogue in post-9/11 America.&quot;--Ryan Hagen, Brooklyn Rail\n\n&quot;As a noted scholar and former chief economist for the U.S. Department of Labor, Krueger is well qualified to perform the types of sophisticated statistical analyses presented here. Despite his weighty academic credentials . . . his book is happily succinct and eminently readable. What Makes a Terrorist is a quick and pleasurable read while remaining highly informative.&quot;--Major Jason Ridgeway, Military Review\n\n&quot;[R]ead Krueger's book and understand that if terrorism has identifiable root causes, they're the ones most frequently cited by Islamists themselves--the desire to achieve what terrorists see as holy ends, and the conviction that, in the service of these ends, terrorism works.&quot;--Walter Reich, Wilson Quarterly\n\n&quot;The author of this important new book, Alan Krueger . . . offers very compelling economic insight into the phenomenon of terrorism. . . . Kreuger's method of presenting and analyzing data from the field, as well as the open and broad way in which he relates to the topic, heightens the relevance of the information he presents. His book deepens our understanding of terror and makes the issue accessible to a broad readership. Indeed, this work could and should be used as an aid to policy makers who are charged with providing an appropriate response to the Herculean challenge of the war on terror.&quot;--Anat Berko, Israel Journal of Foreign Affairs\n\n&quot;In What Makes a Terrorist Krueger uses his experience and skill in collecting and analyzing data quantitatively and empirically, making much of what others have done look like arm-chair speculation.&quot;--Ziv Hellman, The Jerusalem Report\n\n&quot;A timely wake-up call for policy-makers and students of terrorism alike.&quot;--Commonwealth Lawyer\n\n&quot;This short, well-crafted book should be read by anyone interested in the causes and consequences of terrorism.&quot;--Helge Holtermann, Journal of Peace Research\n\n&quot;Alan Krueger is to be commended for taking his undoubted skills and economic techniques and applying them to an analysis of terrorism. He brings some useful insights and new information to the topic.&quot;--James M. Lutz, European Legacy\n\n&quot;What Makes a Terrorist brings needed clarity to one of the greatest challenges of our time.&quot;--World Book Industry\n\n===================================================================================\nAbout the Author\nAlan B. Krueger is the Bendheim Professor of Economics and Public Policy at Princeton University and an adviser to the National Counterterrorism Center. He is the coauthor of &quot;Inequality in America&quot; and &quot;Myth and Measurement&quot; (Princeton).\n===================================================================================","torrent":{"xt":"urn:btih:eade906cb1ada65803d87aa827aaadbbad957821","amp;dn":"Alan+B.+Krueger+-+What+Makes+a+Terrorist.+Economics+and+the+Root","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eade906cb1ada65803d87aa827aaadbbad957821","infoHashBuffer":{"type":"Buffer","data":[234,222,144,108,177,173,166,88,3,216,122,168,39,170,173,187,173,149,120,33]},"announce":[],"urlList":[]}}