{"title":"Infernal Restraints--Compliance Part 1  Cherie DeVille MP4","uid":9463541,"size":1874843030,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:eb576c6d8b7f1c6979a81a7cd7d9f6267d143568&amp;dn=Infernal+Restraints--Compliance+Part+1++Cherie+DeVille+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1389398454,"description":"Compliance Part 1 | Cherie DeVille\n\nJanuary 10, 2014\n\n\nMP4 only.\n\n\nHaving a hot, blonde MILF on set is always fun. Cherie DeVille is our favorite when it comes to that category. Her tits are the perfect size for pinching, fondling, or just standing out as targets for the whip. Her ass is equally pleasing. It's a tight little thing and the marks we make are going to show up on it beautifully. We are going to have so much fun with Cherie that there is no way we could contain it all in a single video. This one is going to have to be a two parter, because the action is just too good to miss.\n\nWe are going to get Cherie backward and forward today. It doesn't come across as the most intense slave position training she has ever had to experience but it will be full of little surprises. For instance, the shackles around her ankles aren't there to keep her legs in place. The way the chains run under her feet keeps them pointed like our special brand of high heeled bondage. Standing on point is such a trying feat that eventually she has to just suck it up and deal with the iron links digging into the soles of her feet.\n\n\nFirst we are going to play with that lovely ass. She's bent over in stocks while we go to work on her tail end. The way the wood and shackles hold her in place it is propped up perfectly for punishment. A little bit of tickling, a little bit of spanking and a whole lot of whipping are coming her way. She's going to have more stripes than a tiger by the time we're done with her. When it comes to whipping women or giving them any kind of corporal punishment we make sure to push every one of them to their limit.\n\n\nThe way she is bent forward does give us a bit of access to her tits. We can whip them from underneath or reach around and give them a good squeeze. But if we really want to show her a good time it is going to mean changing her position a bit. \n\nFor access to her tits and pussy we bend Cherie over backward, arching her almost horizontally at the waist and then anchoring it by putting her neck back into the stocks. It's a brutal position, a twist on an old medieval torture device, that strains all of the muscles in her body at once. It's hard to hold yourself up with your back bent that way, and even harder when every adjustment you make to your weight bears the risk of making you lose your balance and putting all of the pressure on your neck. Cherie knows right away the precariousness of the situation she is in. It's just too bad for her that it's bound to get worse. \n\nOr maybe that is the reason she keeps coming back to us. Having her pussy whipped and then vibrated is probably an experience that she can get anywhere, but with us it is about more than just the bondage you see on camera. It is a mental experience. She knows that once we begin she has given up all control of the situation. It turns her on to be so vulnerable. It makes her wet to know that she is at some strong man's mercy. \n\n\nThere isn't much time between the first time the dildo is pushed inside of her and when her moaning and panting start. The ecstasy of forced orgasms threatens to overtake her senses almost immediately. And that is just from the little Celebrator. When we break out the Hitachi, the most powerful hand held vibrator in our arsenal, she is cumming in a matter of seconds. \n\n\nIt isn't just the corporal punishment that turns her on, either. Cherie is excited by the slave training that she receives at our hands. She has been sucking cock for a long time but every girl could use a bit of deep throat advice. We have a dildo that will help her out. First we'll teach her how to breath through her nose when it is crammed down her throat. After that we'll see how long she can hold her breath when her face hole is overloaded and her nostrils are pinched shut. \n\n\nShe pretends like she hates it. Or at least that is the emotion written all over her face. But a quick inspection of her pussy tells a completely different story. Just like when we had blows raining down on her tits, ass and cunt, Cherie is dripping wet from the treatment. \n\nWe don't want her struggling too much, so this time her legs are strapped wide open. Exposed again there is nothing Cherie can do but squat in place and scream for mercy as orgasm after orgasm is torn from her over-stimulated little slit. Each one is more intense than the last and it begins to exhaust her. She can barely stay on her feet and we aren't even done with her for the day, yet. Like we said, there is so much more coming for her that we couldn't even fit it all in a single video.  \n\nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/01_10cdeville5/InfernalRestraints-Cherie-DeVille-Compliance-Part-1.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/01_10cdeville5/InfernalRestraints-Cherie-DeVille-Compliance-Part-1.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  ","torrent":{"xt":"urn:btih:eb576c6d8b7f1c6979a81a7cd7d9f6267d143568","amp;dn":"Infernal+Restraints--Compliance+Part+1++Cherie+DeVille+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb576c6d8b7f1c6979a81a7cd7d9f6267d143568","infoHashBuffer":{"type":"Buffer","data":[235,87,108,109,139,127,28,105,121,168,26,124,215,217,246,38,125,20,53,104]},"announce":[],"urlList":[]}}