{"title":"A Terrible Revenge (1994) Alfred-Maurice de Zayas","uid":10220458,"size":7514111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebb166b1ccd2cf9c37883be3fcbad778a5eca41e&amp;dn=A+Terrible+Revenge+%281994%29+Alfred-Maurice+de+Zayas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":-1,"time":1401035739,"description":"A Terrible Revenge - The Ethnic Cleansing of the East European Germans, 1944 - 1950 (1994) Alfred-Maurice de Zayas.pdf\n\nThe closing phase and the aftermath of World War II saw millions of refugees and displaced persons wandering across Eastern Europe in one of the most brutal and chaotic migrations in world history. The genocidal barbarism of the German forces has become a poorly documented legend. What hitherto has been little known is the fate of fifteen million German civilians who found themselves at the mercy of Soviet armies and on the wrong side of new postwar borders. All over Eastern Europe, the inhabitants of communities that had been established for many centuries were either expelled or killed. Over two million Germans did not survive. Many of these people had supported Hitler, and for the Czechs, Poles, Ukrainians, and surviving Jews, their fate must have seemed just. However, the great majority--East Prussian farmers, Silesian industrial workers, their wives and children--were guiltless. Their fate, sentenced purely by race, remains an appalling legacy of the period. Alfred de Zayas's book describes this horrible retribution. On the basis of extensive research in German and American archives, he outlines the long history of these German communities, scattered from the Baltic to the Danude, and, most movingly, reproduces the testimonies of surviors from the catastrophic exodus that marked the final end to Nazi fantasies of Lebensraum.\n\n179 pages\nPublisher: St. Martin's Press; 1st edition (August 15, 1994)\nLanguage: English\nISBN-10: 0312121598\nISBN-13: 978-0312121594","torrent":{"xt":"urn:btih:ebb166b1ccd2cf9c37883be3fcbad778a5eca41e","amp;dn":"A+Terrible+Revenge+%281994%29+Alfred-Maurice+de+Zayas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebb166b1ccd2cf9c37883be3fcbad778a5eca41e","infoHashBuffer":{"type":"Buffer","data":[235,177,102,177,204,210,207,156,55,136,59,227,252,186,215,120,165,236,164,30]},"announce":[],"urlList":[]}}