{"title":"Easy to Love (1953) Xvid 1cd - Esther Williams, Van Johnson Musi","uid":9600377,"size":874928128,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ec99c99a596575861f686ad87bf8f9b6a8b143e2&amp;dn=Easy+to+Love+%281953%29+Xvid+1cd+-+Esther+Williams%2C+Van+Johnson+Musi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SaM","files":-1,"time":1392097626,"description":"Easy to Love (1953) Xvid 1cd - Esther Williams, Van Johnson Musical [DDR]\n\nEasy to Love is a 1953 musical film directed by Charles Walters. It stars Esther Williams and Van Johnson. It was Williams' final aquatic film with a U.S. setting.\n\n    CAST:-\n    Esther Williams as Julie Hallerton\n    Van Johnson as Ray Lloyd\n    Tony Martin as Barry Gordon\n    John Bromfield as Hank\n    Edna Skinner as Nancy Parmel\n    Carroll Baker (in her feature film debut) as Clarice\n\nDirected by Charles Walters\nRunning time 96 min.\n\nSYNOPSIS:- Easy To Love 1953\nRay Lloyd runs a successful Cypress Gardens water show, but star attraction Julie Hallerton is overworked and underpaid. She fibs about pretending to marry her aquatic partner Hank, but is persuaded by Ray to accompany him to New York instead.\n\nJulie's hired to pose for a magazine lipstick ad when handsome singer Barry Gordon takes the place of a male model and kisses her instead. Barry offers to introduce Julie to a promoter who will pay and treat her better than Ray does.\n\nWhen they return to Florida, a jealous Hank tells off Ray for not realizing how Julie truly feels. Her roommate Nancy whacks her accidentally with a water ski, knocking Julie cold. All three men in her life rush to her side, and it appears Barry's going to win her.\n\nAt the last moment, Ray realizes he's in love with Julie, and vice versa. Barry quickly turns his attention to another bathing beauty while Nancy reveals a romantic interest in Hank.\n\nThe Cole Porter title tune is but one of the musical highlights in the (literally) splashy Esther Williams musical Easy to Love. Reshuffling plot devices utilized in previous Williams vehicles, the film casts Williams as Julie Hallerton, the star of Ray Lloyd's (Van Johnson) aquacade. She loves Lloyd, but he hardly knows she exists. Only when she inaugurates romances with swimming instructor Hank (John Bromfield) and singer Barry (Tony Martin) does Lloyd wake up and smell the chlorine. The plot's finale is top-heavy with &quot;good sport&quot; behavior involving the three male leads. However, if you've come to an Esther Williams movie for the plot, maybe you'd better try another theatre. Easy to Love is the film that includes Busby Berkeley's legendary &quot;motorboat/hang-glider&quot; production number, performed at Florida's Cypress Gardens--though, incredibly, this aquatic tour de force is not the end of the picture! \n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 96 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 96 mins","torrent":{"xt":"urn:btih:ec99c99a596575861f686ad87bf8f9b6a8b143e2","amp;dn":"Easy+to+Love+%281953%29+Xvid+1cd+-+Esther+Williams%2C+Van+Johnson+Musi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec99c99a596575861f686ad87bf8f9b6a8b143e2","infoHashBuffer":{"type":"Buffer","data":[236,153,201,154,89,101,117,134,31,104,106,216,123,248,249,182,168,177,67,226]},"announce":[],"urlList":[]}}