{"title":"[ExploitedCollegeGirls] Ashley (05.08.2014)","uid":10122544,"size":687502596,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ee5fea89fa48d2d219bf2fe844236dc861f3c8ef&amp;dn=%5BExploitedCollegeGirls%5D+Ashley+%2805.08.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chkm8te","files":1,"time":1399699048,"description":"[ExploitedCollegeGirls] Ashley (05.08.2014)\n\nThis week we may have our most orgasmic college girl ever: tanned and toned nineteen year old Ashley. While she comes off a little shy and laid back, this timid teen becomes a Texas tornado when you apply a cock to her g-spot. Jay's interview isn't especially in depth this week, every road he goes down seems to end in a dead end. Until, of course, he gets Ashley naked and lubed up, then all lights turn green.\nAs Ashley strips, we get a great look at her fine, tan body from her curvy ass to her perky little titties to her tight, meaty puss. While she may not win any points as Miss Congeniality, she could sure be a contender for Miss Bubble Butt, 2014. It's rare that we are treated to something so cheeky on a skinny, white girl. Jay comments on it and you can tell she appreciates the attention, as soon as Jay applies his fingers to her, she's close.\nJay has her hang her ass over the edge of the bed and gets to work with his fingers and then the ECG go-to, the Rabbit. It doesn't take long for Ashley to get there and show off a couple of intense O faces. In fact, she orgasms so hard at one point she has to take a break. As always, after putting in a little work Jay claims his reward by getting Ashely to blow him. Once he's ready to go, he sets her up on the bed in doggy and pounds a few more orgasms out of her. Then the same on her back, and then even more on her side.\nAfter getting her fill of orgasms, Ashley gets paid off in the form of a monster facial (which she hates.) If you are a fan of real orgasms, this update is a must watch. You'll have to watch it a few times, maybe in slow motion, to catch all the times Ashley cums.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=kg6wo1s8t0yvzmsqca5d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=kg6wo1s8t0yvzmsqca5d.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=bhy90p0640u0773k0506.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=bhy90p0640u0773k0506.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ee5fea89fa48d2d219bf2fe844236dc861f3c8ef","amp;dn":"%5BExploitedCollegeGirls%5D+Ashley+%2805.08.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5fea89fa48d2d219bf2fe844236dc861f3c8ef","infoHashBuffer":{"type":"Buffer","data":[238,95,234,137,250,72,210,210,25,191,47,232,68,35,109,200,97,243,200,239]},"announce":[],"urlList":[]}}