{"title":"Bobby Whitlock-Where There's a Will There's a Way(Itunes)","uid":10399540,"size":162777116,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:eed2fe6a85b7776a584b978988c73530ab422a96&amp;dn=Bobby+Whitlock-Where+There%27s+a+Will+There%27s+a+Way%28Itunes%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"er1975us","files":21,"time":1403331507,"description":"01. Where There's a Will 3:44\n02. Song for Paula 3:16      \n03. A Game Called Life 4:15     \n04. Country Life 3:06     \n05. A Day Without Jesus 3:24      \n06. Back in My Life Again 3:31     \n07. The Scenery Has Slowly Changed 3:52      \n08. I'd Rather Live the Straight Life 2:29     \n09. The Dreams of a Hobo 3:23      \n10. Back Home in England 2:51     \n11. Tell the Truth 3:50     \n12. Bustin' My Ass 3:31     \n13. Write You a Letter 2:29     \n14. Ease Your Pain 3:03      \n15. If You Ever 3:18      \n16. Hello L.A., Bye Bye Birmingham 3:56      \n17. You Came Along 3:04      \n18. Think About It 3:09     \n19. Satisfied 2:56      \n20. Dearest I Wonder 3:49      \n21. Start All Over \n\nIn the never-ending quest to remaster and repackage the greatest music you've never heard, Light In The Attic's imprint Future Days here releases The Bobby Whitlock Story: Where There's A Will, There's A Way, collecting the two early 1970's solo albums by Memphis singer/songwriter/keyboardist/guitarist Bobby Whitlock. Presented here together on one CD, Bobby Whitlock (1972) and Raw Velvet (also 1972) are star-studded (George Harrison, Eric Clapton, Delaney &amp; Bonnie), soulful albums from one of rock music's key unsung figures.\nWhitlock's story is a remarkable one. Born to a hardscrabble existence, raised in abject poverty, abused by his preacher father and sent out to pick cotton in the fields. Moving from one railroad town to another, Whitlock was quite literally from the wrong side of the tracks. Yet thanks to his singing and piano playing, music was Whitlock's escape. Winding up in Memphis, Whitlock hooked up with Stax Records, who signed him as the first white artist to their new pop label HIP. But it was soul music, not pop, that was in Whitlock's heart - and his break came when Delaney &amp; Bonnie asked him to join their band, The Friends.\n\nFollowing Delaney &amp; Bonnie from Stax to Elektra Records, Whitlock found his life starting to intertwine with '60s rock royalty. Delaney &amp; Bonnie took him on tour with Blind Faith, where Eric Clapton was impressed with Whitlock's playing and the camaraderie he saw in The Friends. Soon, Whitlock joined Clapton, Jim Gordon and Carl Radle in Derek &amp; The Dominos, the crack unit that backed George Harrison on much of the seminal All Things Must Pass and recorded the classic rock album Layla And Other Assorted Love Songs.\n\nDuring the recording of those albums, Whitlock tentatively made his first steps as a solo artist. Though drugs were already beginning to tear Derek &amp; The Dominoes apart, Whitlock was able to call on some high profile friends (and ''Friends'') to play on his album, including Clapton, Harrison, session bassist Klaus Voorman (John Lennon, Carly Simon, et al), drummer Jim Gordon, Chris Wood (of Traffic) and others. ''I really loved my first record and everything that was behind it,'' says Whitlock now. ''And for the love that was brought to the room by everyone each time we recorded. I know that you can hear it in Eric's solo on The Scenery Has Slowly Changed.''\n\nWhen Bobby presented his album to Atlantic Records they rejected it, citing a different vision for his debut record. So Bobby bought himself out of his contract. Soon after, The Dominos split up following troubled second album sessions. Bobby just kept moving: first back to his rural home in England, then to France, where the Rolling Stones were recording Exile On Main Street. He found a deal for his debut album (via producer Jimmy Miller) and a follow-up too. That second album, Raw Velvet, featured the Edwin Hawkins Singers, the L.A. Symphony, Eric Clapton, Jim Gordon and Bobby's new band members: Rick Vito on guitar, Keith Ellis on bass and Don Poncher on drums. Andy Johns co-produced the self-titled debut (with Whitlock) and Jimmy Miller produced the Raw Velvet LP. Andy was the recording engineer of Exile on Main Street and later produced Television's Marquee Moon. Miller, of course, produced Exile On Main Street.\n","torrent":{"xt":"urn:btih:eed2fe6a85b7776a584b978988c73530ab422a96","amp;dn":"Bobby+Whitlock-Where+There%27s+a+Will+There%27s+a+Way%28Itunes%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eed2fe6a85b7776a584b978988c73530ab422a96","infoHashBuffer":{"type":"Buffer","data":[238,210,254,106,133,183,119,106,88,75,151,137,136,199,53,48,171,66,42,150]},"announce":[],"urlList":[]}}