{"title":"The Big Breakfast Diet - Daniela Jakubowicz.epub","uid":9216726,"size":3385513,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef964bc5499c5c1655d857a3a7f80ff7bdd8071a&amp;dn=The+Big+Breakfast+Diet+-+Daniela+Jakubowicz.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"420weedman","files":1,"time":1384871222,"description":"Eat a huge breakfast, lose a lot of weight? It sounds counter-intuitive, but when a clinical professor of endocrinology and metabolic disease advocates it, maybe it's worth considering. And when that same clinical professor offers proof that overweight women lost nearly five times more weight on a breakfast cure diet than their counterparts did on a low-carb diet, it's time to pay attention.\nDr. Daniela Jakubowicz, a clinical professor at Virginia Commonwealth University and the Hospital de Clinicas Caracas in Venezuela, originally published her diet book in Venezuela and it became a South American bestseller, selling 300,000 copies. Now after continued research, Dr. Jakubowicz presents The Big Breakfast Diet, with its promise that you can have all the foods you crave, from pasta to bacon to ice cream, with just one catch&quot;you have to eat them before 9:00 A.M. Based on the body's natural rhythms, eating a big, complete breakfast revs up your metabolism; helps burn more calories during the day and more fat at night; satisfies hunger all day long; boosts your energy; eliminates cravings for sweets; and reduces the risk of serious health conditions like type 2 diabetes and heart disease.\nAfter explaining the science behind the diet, and how the body's hormones and metabolism process food differently depending on what time of day you eat, The Big Breakfast Diet centers around a full 28-day meal plan&quot;breakfast, lunch, dinner, and snacks, plus recipes. The day begins with a big breakfast&quot;a smoothie or shake, pancakes with berry syrup and ricotta cheese, Canadian bacon, a breakfast sweet&quot;and ends with a moderate, delicious dinner.","torrent":{"xt":"urn:btih:ef964bc5499c5c1655d857a3a7f80ff7bdd8071a","amp;dn":"The+Big+Breakfast+Diet+-+Daniela+Jakubowicz.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef964bc5499c5c1655d857a3a7f80ff7bdd8071a","infoHashBuffer":{"type":"Buffer","data":[239,150,75,197,73,156,92,22,85,216,87,163,167,248,15,247,189,216,7,26]},"announce":[],"urlList":[]}}