{"title":"Cloudberry Jam - The Impossible Shuffle [1998]","uid":9547277,"size":369684631,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:efffdb22dc6cbfac81dbc706b768b44a301fab86&amp;dn=Cloudberry+Jam+-+The+Impossible+Shuffle+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GenXRock","files":-1,"time":1391152914,"description":"Review by Stewart Mason\nThe fourth and final album by Sweden's Cloudberry Jam moves away from the silky-smooth neo-Bacharach pop of their earlier albums, although it's hardly raucous. Instead, it's their version of a soul-influenced pop album, akin in theory (but not sound) to Culture Club's Colour by Numbers. With a new musical emphasis on Hammond organ and wah-wah grooves and a new sultriness to lead singer Jennie Medin's vocals, The Impossible Shuffle sounds a bit like Saint Etienne's early albums with a decreased emphasis on dance beats and a big crush on '70s Curtis Mayfield albums. Surprisingly, however, the highlight is a lengthy reworking of Dinosaur Jr.'s &quot;Water,&quot; transforming the song into a soulful and somewhat jazzy dance-pop groove, a change that the song takes to remarkably well. Of the originals, the highlight is probably the single &quot;Let Me Know Why,&quot; a mix of sunny hooks and mildly anguished lyrics that epitomizes the dark-light dichotomy at the root of '90s Swede pop. Cloudberry Jam broke up shortly after the release of this album, as Medin returned to graduate school, but they certainly managed to go out on a high note. (4/5)","torrent":{"xt":"urn:btih:efffdb22dc6cbfac81dbc706b768b44a301fab86","amp;dn":"Cloudberry+Jam+-+The+Impossible+Shuffle+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efffdb22dc6cbfac81dbc706b768b44a301fab86","infoHashBuffer":{"type":"Buffer","data":[239,255,219,34,220,108,191,172,129,219,199,6,183,104,180,74,48,31,171,134]},"announce":[],"urlList":[]}}