{"title":"Valvrave the Liberator","uid":9496817,"size":2352041426,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f0ca63585a0d8429917dc07988bf6a7f5343eef1&amp;dn=Valvrave+the+Liberator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zerefff","files":-1,"time":1390091918,"description":"plot\n\nHaruto Tokishima, a student from Sakimori High School living on the sphere's &quot;Module 77&quot;, discovers a mysterious and powerful mecha called Valvrave  and uses it to defend the module from a Dorssian invasion that takes over the rest of JIOR. Once they learn that both Dorssia and the ARUS intend to claim the Valvrave for themselves, with no concern with their lives, the students of Sakimori High declare Module 77 an independent state and abandon JIOR territory. Soon after, several other Valvraves are found inside the school and some of them are claimed by other students who join Haruto's fight to protect it. Once Haruto is approached by L-elf Karlstein, a Dorssian spy who claims to have the intentions to one day stage a revolution in his own country, both join forces in an unlikely alliance to secure the sovereignty of their newfound nation declared and officially recognized as New JIOR.\n\nformat    -mp4,mkv\nsize      -av 90mb\nlength    -24min\nepisodes  -24\nquality   -great for size\n\nhay this is my first torrent so u know don't get ya panties in a bunch if I fucked up sum how sooooo year. almost forgot thanks to the original uploaders all credit to them I just assembled them.\n\nplease support the anime buy purchasing a genuine copy\n\n                                                   -zerefff the drunken uniicorn","torrent":{"xt":"urn:btih:f0ca63585a0d8429917dc07988bf6a7f5343eef1","amp;dn":"Valvrave+the+Liberator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ca63585a0d8429917dc07988bf6a7f5343eef1","infoHashBuffer":{"type":"Buffer","data":[240,202,99,88,90,13,132,41,145,125,192,121,136,191,106,127,83,67,238,241]},"announce":[],"urlList":[]}}