{"title":"Shadow Flight - Joe Webber epub (steelballz)","uid":9499547,"size":2278734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0dd29917c83b7c0b768db96fbf74a165951959c&amp;dn=Shadow+Flight+-+Joe+Webber+epub+%28steelballz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"steelballz","files":-1,"time":1390187688,"description":"In the near-future of Weber's second techno-thriller (after DEFCON One ), the KGB has hijacked a Stealth bomber and landed it in Cuba. The theft, a rogue operation, is ultimately denounced by the Soviet government, but Castro, enraged by efforts to recover the plane, declares war on the U.S. America's response is a full-scale strike against Cuba's key military installations, while the B-2 remains unaccounted for. Weber, at his best describing details of modern carrier operations, gives readers a firm sense of what it is like to fly against modern air defenses. He establishes credibility, unusual in this genre, by allowing equipment to malfunction regularly. The unsophisticated, two-dimensional characters are less convincing, however, and their insubstantiality is difficult to reconcile with the use of massive military force. The story implies that the eclipse of Russia has left the U.S. with a redundant military capacity desperately seeking outlets.\nCopyright 1990 Reed Business Information, Inc.\nReview\nGlasnost and perestroika have been unsuccessful and the Soviet economy is reeling under the weight of its failed ideology. The KGB chief,...decides on a daring plan to seize America's most threatening new weapon.\n\nMonths later, on a routine training flight, a B-2 Stealth bomber...is hijacked by a civilian weapons technician turned traitor. At gunpoint, the pilots are forced to fly to Cuba -- a flight that, due to the radar-resistant properties of the aircraft, is untraceable.\n\nAs the superpowers waltz arm-in-arm in a deadly dance of nuclear brinkmanship, only one man (Steve Wickham) can save the plane and its crew -- and avert a global confrontation. ","torrent":{"xt":"urn:btih:f0dd29917c83b7c0b768db96fbf74a165951959c","amp;dn":"Shadow+Flight+-+Joe+Webber+epub+%28steelballz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0dd29917c83b7c0b768db96fbf74a165951959c","infoHashBuffer":{"type":"Buffer","data":[240,221,41,145,124,131,183,192,183,104,219,150,251,247,74,22,89,81,149,156]},"announce":[],"urlList":[]}}