{"title":"CreativeLIVE - Intro to HTML and CSS: Beyond Templates with Jani","uid":9509718,"size":5108565025,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f26f0c9f9a805de3186ac6470eeacb2d0ccbe620&amp;dn=CreativeLIVE+-+Intro+to+HTML+and+CSS%3A+Beyond+Templates+with+Jani&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kr33","files":2,"time":1390381168,"description":"Intro to HTML and CSS: Beyond Templates with Janine Warner\n\nMaking a website is relatively painless, thanks to popular web design programs like WordPress and Dreamweaver. But if you want to go beyond templates and create a website customized for your needs, it's important to learn the basics of HTML and CSS. Understanding these languages allows you to adjust fonts, colors, and other formatting -- maximizing your website's ability to surprise and delight.\n\nJoin creativeLIVE instructor Janine Warner for a two-day comprehensive introduction to this powerful pair of languages. Starting with the basics of how to write HTML and CSS in a text editor, Janine then covers the intermediate skills needed to use a program like Dreamweaver, and finishes with the advanced skills required to edit themes in a program as sophisticated as WordPress.\n\nWhether you're new to writing HTML, or you just want to beef up your coding skills, Janine's simple recipes and step-by-step instructions will have you whipping up great code in no time. ","torrent":{"xt":"urn:btih:f26f0c9f9a805de3186ac6470eeacb2d0ccbe620","amp;dn":"CreativeLIVE+-+Intro+to+HTML+and+CSS%3A+Beyond+Templates+with+Jani","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f26f0c9f9a805de3186ac6470eeacb2d0ccbe620","infoHashBuffer":{"type":"Buffer","data":[242,111,12,159,154,128,93,227,24,106,198,71,14,234,203,45,12,203,230,32]},"announce":[],"urlList":[]}}