{"title":"Toby Jug &amp; Washboard Band - Greasy Quiff (1973) [2001]","uid":10316558,"size":319569243,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f69fc88fb95fda7b323674db1a714fa2ccfeb09a&amp;dn=Toby+Jug+%26amp%3B+Washboard+Band+-+Greasy+Quiff+%281973%29+%5B2001%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ArkieOkie","files":-1,"time":1402250282,"description":"eac secure cue log scans\n\nToby Jug &amp; Washboard Band - Greasy Quiff [1973]\n2001 - Kissing Spell Ltd. / KSCD 921 / Remastered CD\n\nFirst time on CD, 8 pages of rare pictures and sleeve notes by a radio 2 presenter. Originally only 50 pressed in '70 and therfore one of the most collectable folk/psych albums from the UK. including extreme version of HENDRIX &quot;Electric Ladyland&quot; called &quot;Lady Electricland&quot;.\n\nYou hold in your hand a piece of recording history. Thirty years ago an L.P. was recorded which was the most important event in the annals of, er, recording things.\n\nThis record would from a unique, bejewelled yet sturdy milestone, probably made from granite, in the long road which would wind from popular music quite a long time ago right up to popular music quite recently.\n\nAt the dawning of the seventies when Disco had yet to flare up, Progressive Rock had not yet progressed and Punk was un-thunk, three odd musicians from Cambridge, England burst onto the scene in a very secretive way.\n\n\nThey sold their Beatle wigs and boots to help raise the fortune needed to finance their independently released long-playing record, which became one of the first independent record labels in the world.\n\nThis sale of chattels though, was still no enough; a further ten punds, five shillings and sixpence was required. Undaunted, they raised the rest by busking on the River Cam to Japanese tourists who fortunately had a yen to show their appreciation. Some of the cash landed in the punt, most went to the bottom of the Cam.\n\nWith nearly thirty quid saved up they went for it...and so Fifty copies (count them, fifty) of &quot;Greasy Quiff&quot; by Toby Jug and Washboard Band were pressed and delivered to the boys in the band, who spent the next few evenings hand-mounting the jacket covers and disc labels with best quality fish glue. (Why would anybody want to glue fish?)\n\nSince then the record has become very collectable for fans of fish glue. Little did those three destitute, justifiably penniless and fame-hungry musicians know that 30 years later, collectors would be willing to pay over $1700 (A31214 or 1062 Euros) for the privilege of owning just one copy of this legendary waxing.\n\nThis material has been painstakingly rescued from three sheds, and represents the later work of TJWB. So it is that with a deep sense of destiny and honour that we now present the Compact Disc version of the album, perfectly preserved, and digitally re-masturbated with all the technical and artistic shortcomings of the original masterpiece.\n\nPlease enjoy Greasy Quiff and rest assured that no fish were hurt in the production of this Historic Recording.","torrent":{"xt":"urn:btih:f69fc88fb95fda7b323674db1a714fa2ccfeb09a","amp;dn":"Toby+Jug+%26amp%3B+Washboard+Band+-+Greasy+Quiff+%281973%29+%5B2001%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f69fc88fb95fda7b323674db1a714fa2ccfeb09a","infoHashBuffer":{"type":"Buffer","data":[246,159,200,143,185,95,218,123,50,54,116,219,26,113,79,162,204,254,176,154]},"announce":[],"urlList":[]}}