{"title":"Chinese Comfort Women: Imperial Japan's Sex Slaves (2014)","uid":10196876,"size":4678418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fac14eef65ca86463a44c43767e5cbb05777cbcd&amp;dn=Chinese+Comfort+Women%3A+Imperial+Japan%27s+Sex+Slaves+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookzilla","files":1,"time":1400704104,"description":"Chinese Comfort Women: Testimonies from Imperial Japan's Sex Slaves -epub\n\n\nDuring the Asia-Pacific War, the Japanese military forced hundreds of thousands of women across Asia into &quot;comfort stations&quot; where they were repeatedly raped and tortured. Japanese imperial forces claimed they recruited women to join these stations in order to prevent the mass rape of local women and the spread of venereal disease among soldiers. In reality, these women were kidnapped and coerced into sexual slavery. Comfort stations institutionalized rape, and these &quot;comfort women&quot; were subjected to atrocities that have only recently become the subject of international debate. Chinese Comfort Women: Testimonies from Japan's Imperial Sex Slaves features the personal narratives of twelve women forced into sexual slavery when the Japanese military occupied their hometowns. Beginning with their prewar lives and continuing through their enslavement to their postwar struggles for justice, these interviews reveal that the prolonged suffering of the comfort station survivors was not contained to wartime atrocities but was rather a lifelong condition resulting from various social, political, and cultural factors. In addition, their stories bring to light several previously hidden aspects of the comfort women system: the ransoms the occupation army forced the victims' families to pay, the various types of improvised comfort stations set up by small military units throughout the battle zones and occupied regions, and the sheer scope of the military sexual slavery-much larger than previously assumed. The personal narratives of these survivors combined with the testimonies of witnesses, investigative reports, and local histories also reveal a correlation between the proliferation of the comfort stations and the progression of Japan's military offensive. The first English-language account of its kind, Chinese Comfort Women exposes the full extent of the injustices suffered by and the conditions that caused them.\n\nOxnard univ. press","torrent":{"xt":"urn:btih:fac14eef65ca86463a44c43767e5cbb05777cbcd","amp;dn":"Chinese+Comfort+Women%3A+Imperial+Japan%27s+Sex+Slaves+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac14eef65ca86463a44c43767e5cbb05777cbcd","infoHashBuffer":{"type":"Buffer","data":[250,193,78,239,101,202,134,70,58,68,196,55,103,229,203,176,87,119,203,205]},"announce":[],"urlList":[]}}