{"title":"Continuum - Season 2","uid":9594092,"size":11639008778,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:faf4b99091c22fd54a94cb1fcae96561460247ab&amp;dn=Continuum+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":-1,"time":1391973533,"description":"Continuum - Season 2\n\nContinuum - Season 2\n\nContinuum is a Canadian science fiction series created by Simon Barry and produced by Reunion Pictures Inc., Boy Meets Girl Film Company, and GK-TV.\n\nThe series centers on the conflict between a group of rebels from the year 2077 who time-travel to Vancouver, BC, in 2012, and a police officer who accidentally accompanies them. In spite of being many years early, the rebel group decides to continue its violent campaign to stop corporations of the future from replacing governments, while the police officer endeavours to stop them without revealing to anyone that she and the rebels are from the future.\n\nThe show premiered on Showcase on May 27, 2012.[2] The first season has 10 episodes.[2] On August 25, 2012, Showcase renewed Continuum for a second season of 13 episodes[3] which premiered on April 21, 2013 (Showcase) in Canada, May 23, 2013 (Syfy) in the UK and on June 7, 2013 (Syfy) in the US.[4] On June 5, 2013, Continuum was officially renewed and will be returning for a third season[5] slated to premiere on March 16, 2014.[6]\n\nEvery episode begins with the plot of the show narrated by a voiceover from the point of view of Kiera Cameron.\n\n  2077. My time, my city, my family. When terrorists killed thousands of innocents, they were condemned to die. They had other plans. A time travel device sent us all back 65 years. I want to get home but I can't be sure what I will return to if history is changed. Their plan, to corrupt and control the present in order to win the future. What they didn't plan on was me!\n\nCity Protective Services (CPS) law enforcement officer Kiera Cameron (Rachel Nichols) lives a quiet, normal life with her husband and son in 2077-era Vancouver. Under the corporatocratic and oligarchic dystopia of the North American Union and its &quot;Corporate Congress&quot;, life goes on in apparent freedom under a technologically advanced high-surveillance police state.\n\nWhen a group of anarcho-socialist self-proclaimed freedom fighters known as &quot;Liber8&quot; escape execution by fleeing to the year 2012, Kiera is involuntarily transported with them into the past. Joining with Detective Carlos Fonnegra (Victor Webster) and the Vancouver Police Department, and enlisting the help of teen computer genius Alec Sadler (Erik Knudsen), Kiera works to track down and thwart Edouard Kagame (Tony Amendola) and his followers in the present day while concealing her identity as a time-traveller from the future.\n\nKagame and the members of Liber8 plot to alter the past to avert the rise of what they see as a dictatorial and Orwellian corporate regime to be stopped at all costs. Meanwhile, Kiera learns that Alec is none other than Alec Sadler, future corporate mogul and head of SadTech, one of the mega-corporations that dominate the world in 2077.\n\nFighting to return home to her family, Kiera finds that her presence in 2012, and that of the members of Liber8, may be no accident at all.\nTime travel\n\nThroughout the series, multiple theories are suggested as to the nature of time travel and its effect on the timeline of events leading from 2012 to 2077.\n\nIn discussion with Kiera, Alec posits that his future self recalled his interactions with Kiera in the past, potentially inspiring the creation of his own cybernetic technology from her futuristic implants and equipment and leading to a &quot;time loop&quot; whereby conditions in 2077 cannot be altered. Otherwise, Alec and Kiera consider that Kiera and Liber8's presence in the past may have already altered the timeline and created a separate chain of events, and thus the state of the world in 2077 is no longer certain.\n\nEvidence for each possibility is presented over the course of the series. Ultimately, the first season finale, &quot;Endtimes&quot;, reveals that the elderly Alec Sadler orchestrated the time jump that sent Kiera and the members of Liber8 back in time and that he knew precisely what was to occur in 2012. At the start of the second season, the contents of a message sent from the 2077-era Alec to his younger self reveal that his apparent goal is to avert the corporate-dominated future that his actions and inventions created. It is, however, unclear whether this is possible and what implications it may have for the unfolding timeline; it is presently unclear if future-Alec has any memory of the events of 2013 since Kiera went to the past, although the fact that he appears to have been aware that Kiera would be in a position to meet himself -- implanting certain codes and messages in her suit and CMR -- along with his knowledge of the freelance time travelers that Kiera learned about during her time in the past, suggests that at least some version of the time-travel happened before.\n\nSeries creator and executive producer Simon Barry has confirmed that the creative staff have established a set of &quot;rules&quot; for the version of time travel depicted, which will be further explored as the series progresses.[7]","torrent":{"xt":"urn:btih:faf4b99091c22fd54a94cb1fcae96561460247ab","amp;dn":"Continuum+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf4b99091c22fd54a94cb1fcae96561460247ab","infoHashBuffer":{"type":"Buffer","data":[250,244,185,144,145,194,47,213,74,148,203,31,202,233,101,97,70,2,71,171]},"announce":[],"urlList":[]}}