{"title":"Stossel.2014.05.15.[Dearly Beloved].Fox Business.CF.avi","uid":10170244,"size":348062328,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc674b8fae766ca209d7c124e3d25cac2774eee3&amp;dn=Stossel.2014.05.15.%5BDearly+Beloved%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1400394134,"description":"----------\n\nSTOSSEL - [Dearly Beloved] - Fox Business Network\n2014, May 15, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nTIL DEBT DO US PART: I'm grossed out by how much money people spend on weddings. The Wedding Channel claims that the average spent today is more than $29,000. &quot;Miss Manners' Guide To A Surprisingly Dignified Wedding&quot; author Jacobina Martin says weddings have gotten out of control.\n\nHELPING MARRIAGE: Government gives your tax dollars to groups that claim they help people stay married, even when government's own research concludes that the program has no effect. Melissa Moschella of Catholic University of America still says government should do more to try to keep families together. Steve Horwitz of St. Lawrence University disagrees.\n\nIT'S FOR THE CHILDREN: When I was a kid, about 2% of children were born to unwed mothers. Today, it's 29%. For Hispanics, it's 53%, for Blacks, it's 72%. Kay Hymowitz of the Manhattan Institute says &quot;kids do better growing up with...two stably married parents.&quot;\n\nCOHABITATION: People used to get married before they moved in together. Now, 65% of people live with each other before they are married. Pamela Smock of the University of Michigan says it's become &quot;a normal part of the life course.&quot;\n\nI DO, I DO, I DO, I DO: You've heard a lot about gay marriage. But what about polygamist marriages? Joe Darger -who has three wives-says &quot;polygamy is the oldest and most traditional form of marriage.&quot;\n\nDIVORCE CORP: Some couples think their divorce lawyer just wants to help. But divorce lawyers are paid by the hour to fight. Divorce Corp director Joe Sorge says &quot;this is a prevalent problem.&quot;\n\nMY TAKE: As we've seen recently, there's still plenty of racism in America. But every year more people than ever marry someone from a different race. There aren't many better ways to show acceptance of racial difference than that.\n\nLove who you love regardless of race, gender or number, even. Leave government out of it.","torrent":{"xt":"urn:btih:fc674b8fae766ca209d7c124e3d25cac2774eee3","amp;dn":"Stossel.2014.05.15.%5BDearly+Beloved%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc674b8fae766ca209d7c124e3d25cac2774eee3","infoHashBuffer":{"type":"Buffer","data":[252,103,75,143,174,118,108,162,9,215,193,36,227,210,92,172,39,116,238,227]},"announce":[],"urlList":[]}}