{"title":"[PS3] Superstars V8 Racing","uid":9500176,"size":1429152976,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:fcca3de1ff702bd7ef3867be090feae828970d1e&amp;dn=%5BPS3%5D+Superstars+V8+Racing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fuckface69","files":-1,"time":1390207748,"description":"Fasten your seatbelt and get ready for the ride of your life! Superstars V8 Racing for the PlayStationNetwork seamlessly blends arcade and simulation style driving for the ultimate high octane race to the finish line! Shift into gear, tearing up the track and peel into first place for the ultimate title of Superstar Champion!\n\nGet ready for adrenaline-filled racing action against your friends vying for the Superstars Championship title. With limitless replayability and simple pick up and play mechanics this title offers it all. Superstars V8 Racing features dozens of official circuit tracks, name brand European and American vehicles and official drivers. Get behind the wheel in single player or multiplayer mode in the most intense European racing competition on PSN. Strap yourself in and prepare for a wild and competitive ride!\n\nKey Features:\n\n* 18 vehicles on track for every race\n* Play solo or go head-to-head in online play against up to 11 other drivers\n* Change gear into simulation mode for the ultimate driving experience\n* Race along the best circuit tracks in the world\n* Real cars from Audi, BMW, Mercedes, Jaguar, Chevrolet, Chrysler and more","torrent":{"xt":"urn:btih:fcca3de1ff702bd7ef3867be090feae828970d1e","amp;dn":"%5BPS3%5D+Superstars+V8+Racing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcca3de1ff702bd7ef3867be090feae828970d1e","infoHashBuffer":{"type":"Buffer","data":[252,202,61,225,255,112,43,215,239,56,103,190,9,15,234,232,40,151,13,30]},"announce":[],"urlList":[]}}