{"title":"ESET NOD32 Antivirus 7 v7.0.317.4 (32 and 64 bit) Incl Activator","uid":10193046,"size":133334682,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fe132e24f7c26a8c1e0da5cfba1c7dd2b9e661e9&amp;dn=ESET+NOD32+Antivirus+7+v7.0.317.4+%2832+and+64+bit%29+Incl+Activator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"akguru47","files":-1,"time":1400662796,"description":"ESET NOD32 Antivirus - provides a reliable, advanced protection  against threats endangering your PC. Viruses, worms, Trojan horses and  other troubles now will not cause any harm to information valuable to  you. Improved detection methods that are used by the program, even  provide protection against future threats, which are the new worms and viruses.\n\nHigh performance NOD32.\nEffective detection of malware not necessarily slow down your computer.  NOD32 for the most part written in assembly language, and has repeatedly  won awards for outstanding performance of antivirus apps. NOD32 on  average, 2-5 times faster than its competitors (source: Virus Bulletin).  With the switch to NOD32 will increase your system's performance.\n\nThe main advantages of the program NOD32 Antivirus\n- Protects your system from viruses, spyware, Trojans, password stealers and other malicious programs\n- Proactively stop the latest threats\n- Scans and cleans Internet traffic and e-mail, even when the SSL encryption\n- Blocks malicious software from removable devices (USB flash drives, etc.), so you can share files with confidence\n- High speed operation with a minimum load of the system\n- Built-in components SysInspector and SysRescue simplify system diagnostics and recovery\n\nLittle impact on system resources\nNOD32 conserves resources and hard disk memory, leaving it for critical  applications. The installer is just 8.6 MB and the application requires  at least 20 MB of RAM (this may vary with changes in detection  technology).\n\nUpgrade technology ThreatSense, which include heuristics logic and write  virus signatures, typically have a volume of 20-50 KB. Go to NOD32 help  to save valuable system resources.\n\nEase of Management\nProgram updates and virus database are performed automatically in the  background. If NOD32 is used for personal or home computer, you can just  turn on automatic updates and never think about it. Businesses and  organizations with large distributed networks can use the powerful  Remote Administration component (Remote Administrator), which allows to  deploy, install, monitor and control thousands of workstations and  servers NOD32.\n\nESET NOD32 Antivirus provides maximum protection with minimum  resource consumption and highest speed. As part of NOD32 offers multiple  levels of protection for organizations, jobs, file servers and mail  gateways. Choose the best solution for you.","torrent":{"xt":"urn:btih:fe132e24f7c26a8c1e0da5cfba1c7dd2b9e661e9","amp;dn":"ESET+NOD32+Antivirus+7+v7.0.317.4+%2832+and+64+bit%29+Incl+Activator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe132e24f7c26a8c1e0da5cfba1c7dd2b9e661e9","infoHashBuffer":{"type":"Buffer","data":[254,19,46,36,247,194,106,140,30,13,165,207,186,28,125,210,185,230,97,233]},"announce":[],"urlList":[]}}