{"title":"Anal.Buffet.9.DiSC2.XXX.DVDRip.x264-CHiKANi","uid":9500651,"size":896209128,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fe1e8aeedee9ae87247324907f6d52eb5303ba14&amp;dn=Anal.Buffet.9.DiSC2.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxlavalxxx","files":3,"time":1390176762,"description":"Pioneering anal pervert Jay Sin serves up a steaming selection of rim jobs, anal gapes, hard-core ass fucking, sphincter-stretching toys and nasty ass-to-mouth antics is a massive, four-and-a-half-hour epic of backdoor filth to satisfy even the heartiest appetite for female bunghole. And the director has assembled a cast of extremely talented buttholes; the stunning sluts in charge of this rectal feast are not your typical lunch ladies! Dressed in frilly white lingerie, supermodel Casey Calvert enjoys two huge boners at once, stuffing her ass and pussy in a lewd double-penetration. Tall, hard-bodied Juelz Ventura and Asian bombshell London Keyes invade rectums with hole-stretching dildos and tongue-clean each others gaping sphincter. Blonde anal queen Roxy Raye and thick-assed MILF Ava Devine worship each others red, glistening, prolapsed rectal innards. They even mash their nasty, protruding colons together before tackling Lexington Steeles massive black cock and sharing a creamy cum facial. Tall, slender blonde Ivana Sugar, brunette temptress Tiffany Doll and purple-haired punk princess Proxy Paige use big double-dongs, swap gooey strands of drool and worship Christian Clays shaft in a dirty, sloppy foursome. All natural, young Italian Valentina Nappi savors a slow and steady butt banging. Sweet brunette Mischa Brooks and Latina beauty Vicki Chase receive tender interracial butt fucks from Sean Michaels followed by a cum shower. The deluxe double-DVD release includes 90 minutes of outtakes and behind-the-scenes footage. The mouth-watering dishes will have you coming back for more!\n\nAva Devine, Casey Calvert, Chris Strokes, Christian Clay, Ivana Sugar, Juelz Ventura, Lexington Steele, London Keyes, Mischa Brooks, Proxy Paige\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=32942950394151120344.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=32942950394151120344.jpeg&lt;/a&gt;\n\n\ncd1 &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=19318059990965373549.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=19318059990965373549.jpeg&lt;/a&gt;\n\ncd2 &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=82244353217971454902.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=82244353217971454902.jpeg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fe1e8aeedee9ae87247324907f6d52eb5303ba14","amp;dn":"Anal.Buffet.9.DiSC2.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe1e8aeedee9ae87247324907f6d52eb5303ba14","infoHashBuffer":{"type":"Buffer","data":[254,30,138,238,222,233,174,135,36,115,36,144,127,109,82,235,83,3,186,20]},"announce":[],"urlList":[]}}