{"title":"The Wrath of the Gods (1914) Xvid 1cd - Silent - English Interti","uid":10170257,"size":770568192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fee0726b122aab66de43ea93f9020ccc5e8f9364&amp;dn=The+Wrath+of+the+Gods+%281914%29+Xvid+1cd+-+Silent+-+English+Interti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SaM","files":-1,"time":1400394540,"description":"The Wrath of the Gods (1914) Xvid 1cd - Silent - English Intertitles [DDR]\n\nThe Wrath of the Gods is a 1914 US silent drama film directed by Reginald Barker. The film features Sessue Hayakawa, Tsuru Aoki, Frank Borzage, Thomas Kurihara and Henry Kotani in the lead roles. It was released in Japan on 15 September 1918. This was the first feature film appearance of Sessue Hayakawa and the directorial debut of Barker. \nThe film was banned in Japan for 'bringing dishonor to the country'.\n\n    CAST:-\n    Sessue Hayakawa as Lord Yamaki\n    Tsuru Aoki as Toya San\n    Frank Borzage as Tom Wilson\n    Thomas Kurihara as Takeo\n    Henry Kotani as Mr. Hoshida\n\nBaron Yamaki (Sessue Hayakawa) is a fisherman who lives along with his daughter Toya San (Tsuru Aoki) on an island. The island is inhabited by Buddhists and Yamaki had been cursed by Buddha for an affront by one of his ancestors who in a murderous rage, defiled an altar of Buddha in the nearby temple. The curse was that if his daughter married anyone then the nearby volcano would erupt. Toya finds it difficult to form relationships with boys because the village prophet Takeo (Thomas Kurihara) spreads the rumour that she is cursed. She is therefore unwilling to continue her father's acceptance of the curse. When Yamaki takes Toya-san to the Buddha shrine in the garden of his house to pray and try to get the curse removed she vents her feelings about the god's unfairness.\n\nAn American sailor, Tom Wilson (Frank Borzage), whose ship has been wrecked in a storm comes to them for help and shelter. Wilson falls in love with Toya and teaches her about Christianity. To the consternation of her father, Toya decides to convert and marry Tom at the local Japanese-American mission. However, her father also converts. The locals, who have been stirred up by Takeo, go on a murderous rampage against the family. They first go to the chapel but the newlyweds evade them and so they go to the beach house instead. When the mob reaches his house Yamaki throws out the Buddha statue he had set up in his house and puts a cross in its place. The villagers are infuriated by this; they beat him to death beneath the cross and burn his house. Eventually, the volcano erupts and the village is destroyed. Takeo dies in an avalanche. Only Tom Wilson and Toya San survive. They are taken away from the destroyed village by a United States merchant vessel. At the end of the film, Tom tells his bride, &quot;Your gods may be powerful, Toya San, but mine has proved his omnipotence. You are saved to perpetuate your race.&quot;\n\nPRODUCTION NOTES:-\nOn 12 January 1914, a volcano erupted on the island of Sakura-Jima in Kagoshima prefecture, in the southern part of Japan. It was one of the biggest disasters in the history of Japan. Producer Thomas H. Ince immediately decided to make a film based on the incident. The newspaper Toledo Blade reported on 24 January 1914 that &quot;News of the eruption was hardly a day old before Mr. Ince had built in Santa Monica canyon a whole Japanese village&quot;. Ince had constructed a huge village in his studio Inceville and decided where possible to use Japanese people instead of Americans as extras. He gathered workers from the southern parts of California who were to work as peasants in the film. Approximately 1,000, mostly Japanese, extras were used. The film's shooting began on 27 January 1914, just 15 days after the eruption finished.\n\nTo help publicize the production, Ince reported to the newspapers that lead-actress Tsuru Aoki was a native of the island of Sakura and she had lost all her relatives in the eruption - she was actually from Obara Tsuru, a city in the Kyushu area, which was located 180 miles north of Sakura-Jima. Ince also embroidered her biography so that she would appeal to the middle-class audiences as the heroine of a melodrama, claiming that she was the daughter of an illustrious Japanese artist. The biographical-type publicity added emotional and psychological authenticity to the character that Aoki played in the film.\n\nSessue Hayakawa, Aoki's soon-to-be husband, played her father in the film; they married on May 1 just before the film's release. Hayakawa was paid $500 a week and, seeing another chance to publicize his production, Ince stated that Hayakawa was &quot;the highest paid of all Oriental stars.&quot;The film's shipwreck scene was shot off the coast of Santa Monica, and an erupting volcano was also included among its lavish effects.\n\nThe film was targeted at a middle class audience and a large-scale publicity campaign was organized by the New York Motion Picture Corporation. Four months prior to the release, New York Motion Picture Corporation put an ad in the newspaper New York Clippers 14 February 1914 edition, announcing &quot;Wait for The Wrath of the Gods.&quot; Major journals carried a full-page advertisement for the film every week with pictures, various ad lines and photographs taken on the film set. An advertisement for the film featured an angry looking statue of Buddha and a young woman in a kimono praying in front of it. The marriage of the lead actors Tsuru Aoki and Sessue Hayakawa was also included in the publicity campaign. The film was released in a new theater called The Strand on 7 June 1914.\n\nThe film has a rating of 5.8 out of 10 on IMDb. It was praised for its happy ending even though the Aoki's character lost her village. Gina Marchetti proposed in her book Tragic and Transcendent Love in the Forbidden City that the film was &quot;simultaneously warning against miscegenation while celebrating romantic love.&quot;The lead actress Tsuru Aoki's acting was highly appreciated for adding 'the sense of naturalness to the archetypal narrative between Japan and the United States.'\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: NONE - Japanese Silent Film\nRunTime 58 mins\nSubtitles: English Intertitles\nRipped by: Trinidad [DDR]\nDuration: 58 mins","torrent":{"xt":"urn:btih:fee0726b122aab66de43ea93f9020ccc5e8f9364","amp;dn":"The+Wrath+of+the+Gods+%281914%29+Xvid+1cd+-+Silent+-+English+Interti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fee0726b122aab66de43ea93f9020ccc5e8f9364","infoHashBuffer":{"type":"Buffer","data":[254,224,114,107,18,42,171,102,222,67,234,147,249,2,12,204,94,143,147,100]},"announce":[],"urlList":[]}}